


                                  relax repository checkout r21124
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'analysis_mq_cr72.py'
----------------------------------------------------------------------------------------------------
"""Script for CPMG relaxation dispersion curve fitting to the 'MQ CR72' model using Dr. Flemming Hansen's data from http://dx.doi.org/10.1021/jp074793o.

This is to test the nesting of the 'CR72' and 'MQ CR72' models.  The 'MQ CR72' results should be identical to the 'CR72' results but with dwH = 0.

To run:

$ ../../../../../relax --tee analysis_mq_cr72.log analysis_mq_cr72.py
"""


# Python module imports.
from os import sep

# relax module imports.
from auto_analyses.relax_disp import Relax_disp
from data_store import Relax_data_store; ds = Relax_data_store()
from pipe_control.mol_res_spin import return_spin
from status import Status; status = Status()


# Analysis variables.
#####################

# The dispersion models.
MODELS = ['R2eff', 'MQ CR72']

# The grid search size (the number of increments per dimension).
GRID_INC = 6

# The number of Monte Carlo simulations to be used for error analysis at the end of the analysis.
MC_NUM = 3



# Set up the data pipe.
#######################

# Create the data pipe.
pipe_name = 'base pipe'
pipe_bundle = 'relax_disp'
pipe.create(pipe_name=pipe_name, bundle=pipe_bundle, pipe_type='relax_disp')

# The path to the data files.
data_path = status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'Hansen'

# Load the sequence.
sequence.read('fake_sequence.in', dir=status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'Hansen', res_num_col=1, res_name_col=2)

# Name the spins so they can be matched to the assignments, and the isotope for field strength scaling.
spin.name(name='N')
spin.isotope(isotope='15N')

# The spectral data - spectrum ID, peak list file name, CPMG frequency (Hz), spectrometer frequency in Hertz.
data = [
    ['500_reference.in',    '500_MHz'+sep+'reference.in_sparky',           None,  500e6],
    ['500_66.667.in',       '500_MHz'+sep+'66.667.in_sparky',           66.6666,  500e6],
    ['500_133.33.in',       '500_MHz'+sep+'133.33.in_sparky',          133.3333,  500e6],
    ['500_133.33.in.bis',   '500_MHz'+sep+'133.33.in.bis_sparky',      133.3333,  500e6],
    ['500_200.in',          '500_MHz'+sep+'200.in_sparky',             200.0000,  500e6],
    ['500_266.67.in',       '500_MHz'+sep+'266.67.in_sparky',          266.6666,  500e6],
    ['500_333.33.in',       '500_MHz'+sep+'333.33.in_sparky',          333.3333,  500e6],
    ['500_400.in',          '500_MHz'+sep+'400.in_sparky',             400.0000,  500e6],
    ['500_466.67.in',       '500_MHz'+sep+'466.67.in_sparky',          466.6666,  500e6],
    ['500_533.33.in',       '500_MHz'+sep+'533.33.in_sparky',          533.3333,  500e6],
    ['500_533.33.in.bis',   '500_MHz'+sep+'533.33.in.bis_sparky',      533.3333,  500e6],
    ['500_600.in',          '500_MHz'+sep+'600.in_sparky',             600.0000,  500e6],
    ['500_666.67.in',       '500_MHz'+sep+'666.67.in_sparky',          666.6666,  500e6],
    ['500_733.33.in',       '500_MHz'+sep+'733.33.in_sparky',          733.3333,  500e6],
    ['500_800.in',          '500_MHz'+sep+'800.in_sparky',             800.0000,  500e6],
    ['500_866.67.in',       '500_MHz'+sep+'866.67.in_sparky',          866.6666,  500e6],
    ['500_933.33.in',       '500_MHz'+sep+'933.33.in_sparky',          933.3333,  500e6],
    ['500_933.33.in.bis',   '500_MHz'+sep+'933.33.in.bis_sparky',      933.3333,  500e6],
    ['500_1000.in',         '500_MHz'+sep+'1000.in_sparky',           1000.0000,  500e6],
    ['800_reference.in',    '800_MHz'+sep+'reference.in_sparky',           None,  800e6],
    ['800_66.667.in',       '800_MHz'+sep+'66.667.in_sparky',           66.6666,  800e6],
    ['800_133.33.in',       '800_MHz'+sep+'133.33.in_sparky',          133.3333,  800e6],
    ['800_133.33.in.bis',   '800_MHz'+sep+'133.33.in.bis_sparky',      133.3333,  800e6],
    ['800_200.in',          '800_MHz'+sep+'200.in_sparky',             200.0000,  800e6],
    ['800_266.67.in',       '800_MHz'+sep+'266.67.in_sparky',          266.6666,  800e6],
    ['800_333.33.in',       '800_MHz'+sep+'333.33.in_sparky',          333.3333,  800e6],
    ['800_400.in',          '800_MHz'+sep+'400.in_sparky',             400.0000,  800e6],
    ['800_466.67.in',       '800_MHz'+sep+'466.67.in_sparky',          466.6666,  800e6],
    ['800_533.33.in',       '800_MHz'+sep+'533.33.in_sparky',          533.3333,  800e6],
    ['800_533.33.in.bis',   '800_MHz'+sep+'533.33.in.bis_sparky',      533.3333,  800e6],
    ['800_600.in',          '800_MHz'+sep+'600.in_sparky',             600.0000,  800e6],
    ['800_666.67.in',       '800_MHz'+sep+'666.67.in_sparky',          666.6666,  800e6],
    ['800_733.33.in',       '800_MHz'+sep+'733.33.in_sparky',          733.3333,  800e6],
    ['800_800.in',          '800_MHz'+sep+'800.in_sparky',             800.0000,  800e6],
    ['800_866.67.in',       '800_MHz'+sep+'866.67.in_sparky',          866.6666,  800e6],
    ['800_933.33.in',       '800_MHz'+sep+'933.33.in_sparky',          933.3333,  800e6],
    ['800_933.33.in.bis',   '800_MHz'+sep+'933.33.in.bis_sparky',      933.3333,  800e6],
    ['800_1000.in',         '800_MHz'+sep+'1000.in_sparky',           1000.0000,  800e6]
]

# Loop over the spectra.
for id, file, cpmg_frq, H_frq in data:
    # Load the peak intensities.
    spectrum.read_intensities(file=file, dir=data_path, spectrum_id=id, int_method='height')

    # Set the relaxation dispersion experiment type.
    relax_disp.exp_type(spectrum_id=id, exp_type='MQ CPMG')

    # Set the relaxation dispersion CPMG frequencies.
    relax_disp.cpmg_frq(spectrum_id=id, cpmg_frq=cpmg_frq)

    # Set the NMR field strength of the spectrum.
    spectrometer.frequency(id=id, frq=H_frq)

    # Relaxation dispersion CPMG constant time delay T (in s).
    relax_disp.relax_time(spectrum_id=id, time=0.030)

# Specify the duplicated spectra.
spectrum.replicated(spectrum_ids=['500_133.33.in', '500_133.33.in.bis'])
spectrum.replicated(spectrum_ids=['500_533.33.in', '500_533.33.in.bis'])
spectrum.replicated(spectrum_ids=['500_933.33.in', '500_933.33.in.bis'])
spectrum.replicated(spectrum_ids=['800_133.33.in', '800_133.33.in.bis'])
spectrum.replicated(spectrum_ids=['800_533.33.in', '800_533.33.in.bis'])
spectrum.replicated(spectrum_ids=['800_933.33.in', '800_933.33.in.bis'])

# Peak intensity error analysis.
spectrum.error_analysis(subset=['500_reference.in', '500_66.667.in', '500_133.33.in', '500_133.33.in.bis', '500_200.in', '500_266.67.in', '500_333.33.in', '500_400.in', '500_466.67.in', '500_533.33.in', '500_533.33.in.bis', '500_600.in', '500_666.67.in', '500_733.33.in', '500_800.in', '500_866.67.in', '500_933.33.in', '500_933.33.in.bis', '500_1000.in'])
spectrum.error_analysis(subset=['800_reference.in', '800_66.667.in', '800_133.33.in', '800_133.33.in.bis', '800_200.in', '800_266.67.in', '800_333.33.in', '800_400.in', '800_466.67.in', '800_533.33.in', '800_533.33.in.bis', '800_600.in', '800_666.67.in', '800_733.33.in', '800_800.in', '800_866.67.in', '800_933.33.in', '800_933.33.in.bis', '800_1000.in'])

# Deselect unresolved spins.
deselect.read(file='unresolved', dir=data_path+sep+'500_MHz', res_num_col=1)
deselect.read(file='unresolved', dir=data_path+sep+'800_MHz', res_num_col=1)

# Select just spins :70@N and :71@N.
select.spin(":70-71", change_all=True)



# Auto-analysis execution (manually replicated).
################################################

# Do not change!
#Relax_disp(pipe_name=pipe_name, pipe_bundle=pipe_bundle, models=MODELS, grid_inc=GRID_INC, mc_sim_num=MC_NUM)


# The 'R2eff' model.
#~~~~~~~~~~~~~~~~~~~

# Pipe setup.
model = MODELS[0]
pipe.copy(pipe_from='base pipe', pipe_to=model, bundle_to='relax_disp')
pipe.switch(pipe_name=model)
relax_disp.select_model(model='R2eff')

# Optimisation.
calc(verbosity=1)


# The 'MQ CR72' model.
#~~~~~~~~~~~~~~~~~~~~~

# Pipe setup.
model = MODELS[1]
pipe.copy(pipe_from='base pipe', pipe_to=model, bundle_to='relax_disp')
pipe.switch(pipe_name=model)
relax_disp.select_model(model=model)
value.copy(pipe_from='R2eff', pipe_to=model, param='r2eff')

# Alias the spins.
spin70 = return_spin(":70")
spin71 = return_spin(":71")

# Set the initial parameter values (from the CR72 model).
spin70.r2 = [6.972410747346718, 9.404991115575587]
spin70.pA = 0.989863340969402
spin70.dw = 5.607897281786709
spin70.kex = 1758.043421316185459
spin70.chi2 = 55.341147669668452
spin71.r2 = [4.981350615734756, 10.0]
spin71.pA = 0.996612283732306
spin71.dw = 4.347174100886806
spin71.kex = 1935.650258540921413
spin71.chi2 = 5.517033650699763

# Optimisation.
#grid_search(lower=None, upper=None, inc=6, constraints=True, verbosity=1)
minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)
spin70.dwH = 0.0
spin71.dwH = 0.0
minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)

# Results output.
results_dir = data_path + sep + 'relax_results' + sep + model
relax_disp.plot_disp_curves(dir=results_dir, force=True)
value.write(param='pA', file='pA.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
value.write(param='pB', file='pB.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir=results_dir, force=True, norm=False)
grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir=results_dir, force=True, norm=False)
value.write(param='dw', file='dw.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir=results_dir, force=True, norm=False)
value.write(param='dwH', file='dwH.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
grace.write(x_data_type='res_num', y_data_type='dwH', spin_id=None, plot_data='value', file='dwH.agr', dir=results_dir, force=True, norm=False)
value.write(param='k_AB', file='k_AB.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
value.write(param='kex', file='kex.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
value.write(param='tex', file='tex.out', dir=results_dir, scaling=1.0, comment=None, bc=False, force=True)
grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir=results_dir, force=True, norm=False)
grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir=results_dir, force=True, norm=False)
grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir=results_dir, force=True, norm=False)
grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir=results_dir, force=True, norm=False)
results.write(file='results', dir=results_dir, compress_type=1, force=True)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='base pipe', pipe_type='relax_disp', bundle='relax_disp')

relax> sequence.read(file='fake_sequence.in', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=2, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/fake_sequence.in' for reading.
# mol_name    res_num    res_name    spin_num    spin_name    
None          1          GLY         None        None         
None          2          GLY         None        None         
None          3          GLY         None        None         
None          4          GLY         None        None         
None          5          GLY         None        None         
None          6          GLY         None        None         
None          7          GLY         None        None         
None          8          GLY         None        None         
None          9          GLY         None        None         
None          10         GLY         None        None         
None          11         GLY         None        None         
None          12         GLY         None        None         
None          13         GLY         None        None         
None          14         GLY         None        None         
None          15         GLY         None        None         
None          16         GLY         None        None         
None          17         GLY         None        None         
None          18         GLY         None        None         
None          19         GLY         None        None         
None          20         GLY         None        None         
None          21         GLY         None        None         
None          22         GLY         None        None         
None          23         GLY         None        None         
None          24         GLY         None        None         
None          25         GLY         None        None         
None          26         GLY         None        None         
None          27         GLY         None        None         
None          28         GLY         None        None         
None          29         GLY         None        None         
None          30         GLY         None        None         
None          31         GLY         None        None         
None          32         GLY         None        None         
None          33         GLY         None        None         
None          34         GLY         None        None         
None          35         GLY         None        None         
None          36         GLY         None        None         
None          37         GLY         None        None         
None          38         GLY         None        None         
None          39         GLY         None        None         
None          40         GLY         None        None         
None          41         GLY         None        None         
None          42         GLY         None        None         
None          43         GLY         None        None         
None          44         GLY         None        None         
None          45         GLY         None        None         
None          46         GLY         None        None         
None          47         GLY         None        None         
None          48         GLY         None        None         
None          49         GLY         None        None         
None          50         GLY         None        None         
None          51         GLY         None        None         
None          52         GLY         None        None         
None          53         GLY         None        None         
None          54         GLY         None        None         
None          55         GLY         None        None         
None          56         GLY         None        None         
None          57         GLY         None        None         
None          58         GLY         None        None         
None          59         GLY         None        None         
None          60         GLY         None        None         
None          61         GLY         None        None         
None          62         GLY         None        None         
None          63         GLY         None        None         
None          64         GLY         None        None         
None          65         GLY         None        None         
None          66         GLY         None        None         
None          67         GLY         None        None         
None          68         GLY         None        None         
None          69         GLY         None        None         
None          70         GLY         None        None         
None          71         GLY         None        None         
None          72         GLY         None        None         
None          73         GLY         None        None         

relax> spin.name(name='N', spin_id=None, force=False)

relax> spin.isotope(isotope='15N', spin_id=None, force=False)

relax> spectrum.read_intensities(file='500_MHz/reference.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_reference.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/reference.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         19312.608    
:2@N         40148.897    
:3@N         40068.959    
:4@N         51701.544    
:5@N         29811.94     
:6@N         5990.5349    
:7@N         48753.25     
:8@N         38628.954    
:10@N        36604.809    
:11@N        50984.946    
:12@N        40394.627    
:13@N        46505.888    
:14@N        42325.073    
:15@N        34883.499    
:16@N        44593.269    
:17@N        41805.531    
:18@N        39546.218    
:19@N        42535.101    
:20@N        33680.308    
:21@N        32571.258    
:22@N        41089.662    
:23@N        41548.982    
:24@N        28119.249    
:25@N        40710.101    
:26@N        32342.841    
:29@N        37797.18     
:31@N        38850.677    
:32@N        42320.977    
:33@N        42762.184    
:34@N        38715.5      
:35@N        35825.727    
:36@N        35094.871    
:37@N        40885.27     
:38@N        38635.076    
:39@N        44639.246    
:40@N        33650.055    
:41@N        38123.128    
:42@N        43478.12     
:43@N        42545.592    
:44@N        57807.407    
:45@N        32803.021    
:46@N        39211.095    
:47@N        39512.868    
:48@N        38979.349    
:49@N        45118.083    
:50@N        39622.685    
:51@N        39847.255    
:52@N        33648.739    
:53@N        29973.27     
:55@N        36640.166    
:56@N        40903.67     
:57@N        38805.298    
:58@N        44369.278    
:59@N        40469.072    
:60@N        39410.204    
:61@N        34241.94     
:62@N        46560.353    
:63@N        46670.542    
:64@N        34428.285    
:65@N        37634.449    
:66@N        46469.294    
:67@N        30469.201    
:70@N        25707.455    
:71@N        39274.345    
:72@N        27308.616    
:73@N        17387.446    

relax> relax_disp.exp_type(spectrum_id='500_reference.in', exp_type='MQ CPMG')
Setting the '500_reference.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_reference.in', cpmg_frq=None)
Setting the '500_reference.in' spectrum CPMG frequency None Hz.

relax> spectrometer.frequency(id='500_reference.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_reference.in', time=0.03)
Setting the '500_reference.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/66.667.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_66.667.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/66.667.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         9900.7022    
:2@N         35082.951    
:3@N         34698.901    
:4@N         49187.324    
:5@N         20351.238    
:6@N         5710.9091    
:7@N         47336.223    
:8@N         31282.912    
:10@N        30419.45     
:11@N        46452.533    
:12@N        34508.147    
:13@N        45737.759    
:14@N        34810.511    
:15@N        29116.56     
:16@N        40674.88     
:17@N        34723.441    
:18@N        32992.337    
:19@N        35791.189    
:20@N        27974.385    
:21@N        25031.944    
:22@N        34304.904    
:23@N        33311.504    
:24@N        23763.947    
:25@N        34387.713    
:26@N        23069.329    
:29@N        31328.299    
:31@N        31271.419    
:32@N        32851.455    
:33@N        34798.202    
:34@N        31112.133    
:35@N        29864.219    
:36@N        30235.206    
:37@N        33942.608    
:38@N        31757.892    
:39@N        34647.671    
:40@N        27645.398    
:41@N        30980.275    
:42@N        35928.316    
:43@N        35214.012    
:44@N        47662.762    
:45@N        26858.976    
:46@N        31922.752    
:47@N        32314.465    
:48@N        32037.09     
:49@N        40799.971    
:50@N        33009.785    
:51@N        32308.364    
:52@N        21254.47     
:53@N        23923.71     
:55@N        26356.81     
:56@N        35120.021    
:57@N        33094.377    
:58@N        37284.195    
:59@N        32795.126    
:60@N        31782.679    
:61@N        22312.18     
:62@N        40345.67     
:63@N        36246.49     
:64@N        23854.184    
:65@N        29709.057    
:66@N        41026.639    
:67@N        15402.599    
:70@N        15885.628    
:71@N        31792.844    
:72@N        15189.406    
:73@N        15887.294    

relax> relax_disp.exp_type(spectrum_id='500_66.667.in', exp_type='MQ CPMG')
Setting the '500_66.667.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_66.667.in', cpmg_frq=66.6666)
Setting the '500_66.667.in' spectrum CPMG frequency 66.6666 Hz.

relax> spectrometer.frequency(id='500_66.667.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_66.667.in', time=0.03)
Setting the '500_66.667.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/133.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_133.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/133.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         10761.746    
:2@N         35189.608    
:3@N         34386.782    
:4@N         49198.165    
:5@N         20658.284    
:6@N         5770.0454    
:7@N         47397.777    
:8@N         31539.594    
:10@N        30411.779    
:11@N        46551.977    
:12@N        34602.563    
:13@N        45555.624    
:14@N        34673.727    
:15@N        29082.064    
:16@N        40524.834    
:17@N        34674.498    
:18@N        32867.063    
:19@N        35725.976    
:20@N        27881.892    
:21@N        25271.765    
:22@N        34180.29     
:23@N        33711.569    
:24@N        23898.313    
:25@N        34467.956    
:26@N        23518.162    
:29@N        31480.986    
:31@N        31480.755    
:32@N        33305.656    
:33@N        34724.372    
:34@N        31186.862    
:35@N        29919.369    
:36@N        30288.367    
:37@N        33698.034    
:38@N        31698.505    
:39@N        34734.002    
:40@N        27647.328    
:41@N        31228.077    
:42@N        35868.98     
:43@N        35032.127    
:44@N        47280.704    
:45@N        26986.381    
:46@N        31716.724    
:47@N        32420.493    
:48@N        32150.538    
:49@N        41049.719    
:50@N        33248.614    
:51@N        32589.394    
:52@N        22159.391    
:53@N        24553.403    
:55@N        27185.427    
:56@N        35432.238    
:57@N        33135.283    
:58@N        37501.374    
:59@N        32863.949    
:60@N        31910.268    
:61@N        23045.149    
:62@N        40285.41     
:63@N        36900.213    
:64@N        24593.52     
:65@N        30107.657    
:66@N        41152.791    
:67@N        15388.144    
:70@N        16627.668    
:71@N        31972.777    
:72@N        15490.596    
:73@N        15466.502    

relax> relax_disp.exp_type(spectrum_id='500_133.33.in', exp_type='MQ CPMG')
Setting the '500_133.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_133.33.in', cpmg_frq=133.3333)
Setting the '500_133.33.in' spectrum CPMG frequency 133.3333 Hz.

relax> spectrometer.frequency(id='500_133.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_133.33.in', time=0.03)
Setting the '500_133.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/133.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_133.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/133.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         10237.749    
:2@N         35115.182    
:3@N         34483.566    
:4@N         49357.169    
:5@N         20858.677    
:6@N         5799.1615    
:7@N         47226.766    
:8@N         31616.322    
:10@N        30402.288    
:11@N        46563.217    
:12@N        34478.415    
:13@N        45699.013    
:14@N        34634.326    
:15@N        29270.708    
:16@N        40661.187    
:17@N        34832.147    
:18@N        33074.131    
:19@N        35694.532    
:20@N        27735.73     
:21@N        25312.011    
:22@N        34278.2      
:23@N        33696.919    
:24@N        23769.719    
:25@N        34478.802    
:26@N        23687.365    
:29@N        31553.164    
:31@N        31536.164    
:32@N        33141.571    
:33@N        34754.18     
:34@N        31526.214    
:35@N        29998.92     
:36@N        30661.446    
:37@N        34089.567    
:38@N        31611.156    
:39@N        34609.443    
:40@N        27502.562    
:41@N        31410.698    
:42@N        35821.846    
:43@N        34944.573    
:44@N        47517.543    
:45@N        26667.588    
:46@N        32116.166    
:47@N        32182.741    
:48@N        31991.169    
:49@N        40931.436    
:50@N        33075.9      
:51@N        32600.062    
:52@N        22125.916    
:53@N        24474.87     
:55@N        27007.014    
:56@N        35337.864    
:57@N        33296.04     
:58@N        37717.953    
:59@N        32995.944    
:60@N        32055.487    
:61@N        23094.687    
:62@N        40518.316    
:63@N        36779.928    
:64@N        24385.052    
:65@N        29733.432    
:66@N        41334.449    
:67@N        15688.498    
:70@N        16276.208    
:71@N        32117.182    
:72@N        15424.051    
:73@N        15564.511    

relax> relax_disp.exp_type(spectrum_id='500_133.33.in.bis', exp_type='MQ CPMG')
Setting the '500_133.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_133.33.in.bis', cpmg_frq=133.3333)
Setting the '500_133.33.in.bis' spectrum CPMG frequency 133.3333 Hz.

relax> spectrometer.frequency(id='500_133.33.in.bis', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_133.33.in.bis', time=0.03)
Setting the '500_133.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/200.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_200.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/200.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         10888.429    
:2@N         35467.932    
:3@N         34607.447    
:4@N         49361.759    
:5@N         21223.418    
:6@N         5717.5072    
:7@N         47197.448    
:8@N         31438.149    
:10@N        30261.119    
:11@N        46481.178    
:12@N        34871.209    
:13@N        45650.307    
:14@N        34960.732    
:15@N        29087.85     
:16@N        40717.951    
:17@N        34998.175    
:18@N        32995.257    
:19@N        35928.995    
:20@N        27880.153    
:21@N        25319.212    
:22@N        34197.384    
:23@N        33766.862    
:24@N        23267.587    
:25@N        34389.283    
:26@N        23971.962    
:29@N        31566.739    
:31@N        31611.202    
:32@N        34098.002    
:33@N        34954.805    
:34@N        31426.964    
:35@N        29904.048    
:36@N        30443.127    
:37@N        33809.693    
:38@N        31814.396    
:39@N        35078.168    
:40@N        27507.258    
:41@N        31174.9      
:42@N        36015.254    
:43@N        35144.294    
:44@N        47708.39     
:45@N        27016.343    
:46@N        31887.268    
:47@N        32211.815    
:48@N        31942.344    
:49@N        41070.773    
:50@N        33263.327    
:51@N        32613.384    
:52@N        22558.714    
:53@N        24618.299    
:55@N        27486.123    
:56@N        35098.489    
:57@N        32928.694    
:58@N        37517.605    
:59@N        32851.555    
:60@N        32138.366    
:61@N        23755.66     
:62@N        40743.725    
:63@N        37307.441    
:64@N        25034.009    
:65@N        30213.178    
:66@N        41591.461    
:67@N        16160.132    
:70@N        16710.653    
:71@N        32347.697    
:72@N        16024.446    
:73@N        15026.479    

relax> relax_disp.exp_type(spectrum_id='500_200.in', exp_type='MQ CPMG')
Setting the '500_200.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_200.in', cpmg_frq=200.0)
Setting the '500_200.in' spectrum CPMG frequency 200.0 Hz.

relax> spectrometer.frequency(id='500_200.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_200.in', time=0.03)
Setting the '500_200.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/266.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_266.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/266.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         11214.928    
:2@N         35356.294    
:3@N         34495.396    
:4@N         49169.489    
:5@N         22283.13     
:6@N         5663.9173    
:7@N         47364.502    
:8@N         31981.921    
:10@N        30516.955    
:11@N        46578.416    
:12@N        34661.264    
:13@N        45738.883    
:14@N        35221.11     
:15@N        29138.036    
:16@N        40723.683    
:17@N        34633.746    
:18@N        33001.016    
:19@N        35941.515    
:20@N        27830.59     
:21@N        25718.79     
:22@N        34176.508    
:23@N        33851.606    
:24@N        23500.503    
:25@N        34581.928    
:26@N        24222.222    
:29@N        31490.148    
:31@N        31928.404    
:32@N        34046.294    
:33@N        35157.286    
:34@N        31751.618    
:35@N        29916.243    
:36@N        30544.772    
:37@N        33767.862    
:38@N        31890.577    
:39@N        35300.884    
:40@N        27599.689    
:41@N        31387.481    
:42@N        36344.216    
:43@N        35243.913    
:44@N        47411.735    
:45@N        26917.319    
:46@N        31890.737    
:47@N        32337.651    
:48@N        32046.044    
:49@N        41110.72     
:50@N        33201.486    
:51@N        32858.066    
:52@N        23076.906    
:53@N        24545.609    
:55@N        28118.8      
:56@N        35387.219    
:57@N        33182.18     
:58@N        37615.397    
:59@N        33164.718    
:60@N        32409.32     
:61@N        24382.992    
:62@N        40796.258    
:63@N        37682.346    
:64@N        25554.872    
:65@N        30626.445    
:66@N        41674.944    
:67@N        16732.095    
:70@N        17581.482    
:71@N        32478.272    
:72@N        16854.22     
:73@N        15165.716    

relax> relax_disp.exp_type(spectrum_id='500_266.67.in', exp_type='MQ CPMG')
Setting the '500_266.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_266.67.in', cpmg_frq=266.6666)
Setting the '500_266.67.in' spectrum CPMG frequency 266.6666 Hz.

relax> spectrometer.frequency(id='500_266.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_266.67.in', time=0.03)
Setting the '500_266.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/333.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_333.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/333.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         11262.601    
:2@N         35348.147    
:3@N         34604.677    
:4@N         49239.453    
:5@N         22913.341    
:6@N         5616.949     
:7@N         47354.657    
:8@N         32122.346    
:10@N        30481.41     
:11@N        46442.264    
:12@N        34655.558    
:13@N        45588.346    
:14@N        35155.624    
:15@N        29278.907    
:16@N        40587.178    
:17@N        34618.898    
:18@N        33313.172    
:19@N        35947.064    
:20@N        28064.838    
:21@N        25662.331    
:22@N        34322.769    
:23@N        33933.046    
:24@N        23506.048    
:25@N        34402.485    
:26@N        24601.355    
:29@N        31663.805    
:31@N        32060.725    
:32@N        34449.932    
:33@N        35015.362    
:34@N        31633.005    
:35@N        29978.616    
:36@N        30490.347    
:37@N        33874.394    
:38@N        31981.225    
:39@N        35803.832    
:40@N        27520.901    
:41@N        31202.877    
:42@N        36274.12     
:43@N        34985.652    
:44@N        47510.978    
:45@N        26757.426    
:46@N        32202.767    
:47@N        32633.932    
:48@N        32296.502    
:49@N        41271.478    
:50@N        33208.906    
:51@N        32784.318    
:52@N        23878.487    
:53@N        24888.333    
:55@N        28283.422    
:56@N        35173.784    
:57@N        32972.922    
:58@N        37690.995    
:59@N        33232.859    
:60@N        32505.288    
:61@N        24784.761    
:62@N        40733.399    
:63@N        37572.393    
:64@N        26280.771    
:65@N        30800.157    
:66@N        41696.482    
:67@N        17481.087    
:70@N        17741.116    
:71@N        32488.116    
:72@N        17577.352    
:73@N        15437.358    

relax> relax_disp.exp_type(spectrum_id='500_333.33.in', exp_type='MQ CPMG')
Setting the '500_333.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_333.33.in', cpmg_frq=333.3333)
Setting the '500_333.33.in' spectrum CPMG frequency 333.3333 Hz.

relax> spectrometer.frequency(id='500_333.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_333.33.in', time=0.03)
Setting the '500_333.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/400.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_400.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/400.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         12383.442    
:2@N         35336.594    
:3@N         34669.264    
:4@N         49382.8      
:5@N         23153.625    
:6@N         5665.7332    
:7@N         47430.833    
:8@N         32284.123    
:10@N        30376.968    
:11@N        46425.353    
:12@N        34760.99     
:13@N        45532.87     
:14@N        34981.831    
:15@N        29077.479    
:16@N        40553.402    
:17@N        34704.842    
:18@N        32976.012    
:19@N        35895.805    
:20@N        27956.62     
:21@N        25918.648    
:22@N        34019.792    
:23@N        34162.806    
:24@N        23964.747    
:25@N        34472.847    
:26@N        24931.742    
:29@N        31678.03     
:31@N        32257.304    
:32@N        34641.158    
:33@N        34920.995    
:34@N        31698.964    
:35@N        30094.224    
:36@N        30569.033    
:37@N        33789.928    
:38@N        32029.135    
:39@N        35660.421    
:40@N        27465.122    
:41@N        31334.874    
:42@N        36348.691    
:43@N        35184.559    
:44@N        47581.979    
:45@N        27061.032    
:46@N        32385.033    
:47@N        32726.104    
:48@N        32377.757    
:49@N        41070.994    
:50@N        33358.212    
:51@N        32699.334    
:52@N        24557.264    
:53@N        24739.011    
:55@N        28764.564    
:56@N        35137.972    
:57@N        33236.963    
:58@N        37882.509    
:59@N        33195.542    
:60@N        32597.454    
:61@N        25378.129    
:62@N        40911.669    
:63@N        38315.531    
:64@N        26241.066    
:65@N        30681.602    
:66@N        41759.708    
:67@N        18228.587    
:70@N        18430.466    
:71@N        32799.529    
:72@N        17979.475    
:73@N        15219.128    

relax> relax_disp.exp_type(spectrum_id='500_400.in', exp_type='MQ CPMG')
Setting the '500_400.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_400.in', cpmg_frq=400.0)
Setting the '500_400.in' spectrum CPMG frequency 400.0 Hz.

relax> spectrometer.frequency(id='500_400.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_400.in', time=0.03)
Setting the '500_400.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/466.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_466.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/466.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         12868.106    
:2@N         35562.12     
:3@N         34612.37     
:4@N         49356.864    
:5@N         23704.213    
:6@N         5836.0014    
:7@N         47234.342    
:8@N         32470.039    
:10@N        30454.05     
:11@N        46422.804    
:12@N        35025.756    
:13@N        45629.497    
:14@N        35170.803    
:15@N        29193.404    
:16@N        40506.252    
:17@N        34605.678    
:18@N        33344.466    
:19@N        36023.125    
:20@N        28067.372    
:21@N        26130.517    
:22@N        34232.159    
:23@N        33994.553    
:24@N        23771.052    
:25@N        34479.224    
:26@N        25496.801    
:29@N        31341.912    
:31@N        32275.286    
:32@N        34908.256    
:33@N        34953.008    
:34@N        31816.595    
:35@N        30018.187    
:36@N        30612.704    
:37@N        33677.06     
:38@N        32259.521    
:39@N        35805.162    
:40@N        27770.911    
:41@N        31583.583    
:42@N        36156.365    
:43@N        35264.379    
:44@N        47422.972    
:45@N        27017.903    
:46@N        32440.694    
:47@N        32607.873    
:48@N        32160.275    
:49@N        41191.962    
:50@N        33092.055    
:51@N        33039.612    
:52@N        25093.487    
:53@N        25003.674    
:55@N        29134.084    
:56@N        35168.62     
:57@N        33079.058    
:58@N        37605.257    
:59@N        33509.232    
:60@N        32550.723    
:61@N        25789.316    
:62@N        40761.413    
:63@N        38073.21     
:64@N        26478.705    
:65@N        30848.596    
:66@N        41693.697    
:67@N        18815.334    
:70@N        18723.854    
:71@N        33034.747    
:72@N        19245.661    
:73@N        15467.302    

relax> relax_disp.exp_type(spectrum_id='500_466.67.in', exp_type='MQ CPMG')
Setting the '500_466.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_466.67.in', cpmg_frq=466.6666)
Setting the '500_466.67.in' spectrum CPMG frequency 466.6666 Hz.

relax> spectrometer.frequency(id='500_466.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_466.67.in', time=0.03)
Setting the '500_466.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/533.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_533.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/533.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         13080.323    
:2@N         35456.811    
:3@N         34688.595    
:4@N         49171.379    
:5@N         24066.833    
:6@N         5600.9486    
:7@N         47201.877    
:8@N         32169.933    
:10@N        30384.884    
:11@N        46508.976    
:12@N        34909.926    
:13@N        45627.022    
:14@N        35197.382    
:15@N        29317.401    
:16@N        40629.263    
:17@N        34680.042    
:18@N        32911.329    
:19@N        35841.246    
:20@N        27979.913    
:21@N        26252.021    
:22@N        34282.392    
:23@N        34355.465    
:24@N        23645.647    
:25@N        34595.258    
:26@N        25597.138    
:29@N        31885.397    
:31@N        31931.509    
:32@N        35110.471    
:33@N        35384.239    
:34@N        31941.206    
:35@N        30082.748    
:36@N        30501.993    
:37@N        33945.871    
:38@N        32132.462    
:39@N        36085.601    
:40@N        27857.873    
:41@N        31222.146    
:42@N        36268.327    
:43@N        35229.742    
:44@N        47800.196    
:45@N        26897.353    
:46@N        32461.564    
:47@N        32843.75     
:48@N        32399.986    
:49@N        41129.903    
:50@N        32982.9      
:51@N        32822.08     
:52@N        25683.853    
:53@N        24724.873    
:55@N        29095.966    
:56@N        35066.173    
:57@N        33156.124    
:58@N        37694.623    
:59@N        33658.376    
:60@N        32588.541    
:61@N        25992.519    
:62@N        40994.838    
:63@N        38333.657    
:64@N        26787.812    
:65@N        30716.478    
:66@N        41813.354    
:67@N        19815.216    
:70@N        18880.359    
:71@N        33277.779    
:72@N        19755.821    
:73@N        15755.719    

relax> relax_disp.exp_type(spectrum_id='500_533.33.in', exp_type='MQ CPMG')
Setting the '500_533.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_533.33.in', cpmg_frq=533.3333)
Setting the '500_533.33.in' spectrum CPMG frequency 533.3333 Hz.

relax> spectrometer.frequency(id='500_533.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_533.33.in', time=0.03)
Setting the '500_533.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/533.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_533.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/533.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         13292.562    
:2@N         35650.332    
:3@N         34638.464    
:4@N         49149.552    
:5@N         24124.315    
:6@N         5694.6442    
:7@N         47350.588    
:8@N         32310.403    
:10@N        30624.342    
:11@N        46656.375    
:12@N        34888.032    
:13@N        45600.494    
:14@N        35064.236    
:15@N        29015.287    
:16@N        40558.47     
:17@N        34609.385    
:18@N        33340.601    
:19@N        35904.81     
:20@N        28069.712    
:21@N        26256.884    
:22@N        34090.154    
:23@N        34188.923    
:24@N        23418.548    
:25@N        34524.197    
:26@N        25406.999    
:29@N        31766.355    
:31@N        32133.122    
:32@N        35050.809    
:33@N        35179.854    
:34@N        31772.845    
:35@N        30081.661    
:36@N        30527.138    
:37@N        33821.041    
:38@N        31840.738    
:39@N        36261.44     
:40@N        27605.157    
:41@N        31600.921    
:42@N        36497.767    
:43@N        35345.825    
:44@N        47551.741    
:45@N        27032.853    
:46@N        32458.525    
:47@N        32941.406    
:48@N        32353.805    
:49@N        41226.532    
:50@N        33159.085    
:51@N        32807.049    
:52@N        25300.67     
:53@N        25164.569    
:55@N        29191.126    
:56@N        35161.375    
:57@N        33047.868    
:58@N        37628.273    
:59@N        33443.466    
:60@N        32777.945    
:61@N        25963.875    
:62@N        40750.009    
:63@N        38340.677    
:64@N        26720.288    
:65@N        30927.0      
:66@N        41703.185    
:67@N        19351.832    
:70@N        19431.29     
:71@N        33369.196    
:72@N        19454.139    
:73@N        15872.749    

relax> relax_disp.exp_type(spectrum_id='500_533.33.in.bis', exp_type='MQ CPMG')
Setting the '500_533.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_533.33.in.bis', cpmg_frq=533.3333)
Setting the '500_533.33.in.bis' spectrum CPMG frequency 533.3333 Hz.

relax> spectrometer.frequency(id='500_533.33.in.bis', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_533.33.in.bis', time=0.03)
Setting the '500_533.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/600.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_600.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/600.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         13912.1      
:2@N         35718.033    
:3@N         34672.242    
:4@N         49335.18     
:5@N         24177.867    
:6@N         5589.361     
:7@N         47427.565    
:8@N         32299.3      
:10@N        30482.386    
:11@N        46644.39     
:12@N        34933.374    
:13@N        45570.036    
:14@N        35130.378    
:15@N        29248.188    
:16@N        40658.401    
:17@N        34561.466    
:18@N        33123.536    
:19@N        35913.208    
:20@N        27897.294    
:21@N        26439.687    
:22@N        34077.453    
:23@N        34038.24     
:24@N        23779.766    
:25@N        34557.056    
:26@N        25827.879    
:29@N        31663.611    
:31@N        32163.682    
:32@N        35274.247    
:33@N        35199.108    
:34@N        31812.031    
:35@N        30176.671    
:36@N        30451.177    
:37@N        33694.452    
:38@N        32269.365    
:39@N        36009.048    
:40@N        27589.479    
:41@N        31245.266    
:42@N        36401.566    
:43@N        35049.957    
:44@N        47703.947    
:45@N        27006.38     
:46@N        32692.58     
:47@N        32942.431    
:48@N        32254.382    
:49@N        41244.497    
:50@N        33118.073    
:51@N        32913.837    
:52@N        25784.075    
:53@N        25058.667    
:55@N        29395.198    
:56@N        35109.315    
:57@N        33067.853    
:58@N        37473.237    
:59@N        33554.267    
:60@N        32622.472    
:61@N        26551.497    
:62@N        40805.415    
:63@N        38471.528    
:64@N        26966.205    
:65@N        30891.321    
:66@N        41713.683    
:67@N        19843.784    
:70@N        19295.116    
:71@N        33330.505    
:72@N        19942.905    
:73@N        15787.241    

relax> relax_disp.exp_type(spectrum_id='500_600.in', exp_type='MQ CPMG')
Setting the '500_600.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_600.in', cpmg_frq=600.0)
Setting the '500_600.in' spectrum CPMG frequency 600.0 Hz.

relax> spectrometer.frequency(id='500_600.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_600.in', time=0.03)
Setting the '500_600.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/666.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_666.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/666.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         14288.756    
:2@N         35584.558    
:3@N         34620.385    
:4@N         49247.787    
:5@N         24535.996    
:6@N         5746.7649    
:7@N         47315.793    
:8@N         32363.728    
:10@N        30543.031    
:11@N        46597.326    
:12@N        35022.677    
:13@N        45587.293    
:14@N        35187.979    
:15@N        29298.658    
:16@N        40565.389    
:17@N        34619.536    
:18@N        33070.39     
:19@N        35806.901    
:20@N        27911.742    
:21@N        26384.109    
:22@N        34147.312    
:23@N        34034.774    
:24@N        23595.508    
:25@N        34546.775    
:26@N        25749.158    
:29@N        31406.713    
:31@N        31975.356    
:32@N        35453.795    
:33@N        35114.798    
:34@N        31806.778    
:35@N        30044.435    
:36@N        30305.165    
:37@N        33854.818    
:38@N        31870.676    
:39@N        36245.743    
:40@N        27533.99     
:41@N        31419.365    
:42@N        36324.183    
:43@N        35402.431    
:44@N        47495.303    
:45@N        27036.604    
:46@N        32516.218    
:47@N        32620.515    
:48@N        32289.208    
:49@N        41119.696    
:50@N        33365.743    
:51@N        32798.792    
:52@N        26420.752    
:53@N        25063.476    
:55@N        29464.013    
:56@N        35068.269    
:57@N        33137.838    
:58@N        37655.524    
:59@N        33685.415    
:60@N        32649.679    
:61@N        26966.634    
:62@N        40616.46     
:63@N        38508.045    
:64@N        27458.225    
:65@N        30770.415    
:66@N        41737.588    
:67@N        20640.438    
:70@N        19615.342    
:71@N        33505.785    
:72@N        20695.265    
:73@N        15430.429    

relax> relax_disp.exp_type(spectrum_id='500_666.67.in', exp_type='MQ CPMG')
Setting the '500_666.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_666.67.in', cpmg_frq=666.6666)
Setting the '500_666.67.in' spectrum CPMG frequency 666.6666 Hz.

relax> spectrometer.frequency(id='500_666.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_666.67.in', time=0.03)
Setting the '500_666.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/733.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_733.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/733.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         14648.043    
:2@N         35683.965    
:3@N         34660.584    
:4@N         49321.326    
:5@N         24731.379    
:6@N         5772.7748    
:7@N         47357.751    
:8@N         32517.478    
:10@N        30551.093    
:11@N        46713.196    
:12@N        35256.763    
:13@N        45497.86     
:14@N        35104.934    
:15@N        29212.28     
:16@N        40586.311    
:17@N        34508.61     
:18@N        33216.401    
:19@N        35906.894    
:20@N        27928.602    
:21@N        26309.097    
:22@N        34205.764    
:23@N        34188.159    
:24@N        23634.873    
:25@N        34836.605    
:26@N        25869.89     
:29@N        31452.378    
:31@N        32331.365    
:32@N        35567.515    
:33@N        35132.199    
:34@N        32210.084    
:35@N        30067.048    
:36@N        30534.073    
:37@N        33921.965    
:38@N        32348.51     
:39@N        36371.342    
:40@N        27546.585    
:41@N        31373.148    
:42@N        36346.829    
:43@N        35532.438    
:44@N        47758.532    
:45@N        27039.211    
:46@N        32334.318    
:47@N        33045.956    
:48@N        32422.613    
:49@N        41166.494    
:50@N        32964.242    
:51@N        32798.223    
:52@N        26491.603    
:53@N        25091.76     
:55@N        29994.141    
:56@N        35270.147    
:57@N        33261.429    
:58@N        37978.538    
:59@N        33481.097    
:60@N        32737.814    
:61@N        26838.689    
:62@N        40917.813    
:63@N        38800.407    
:64@N        27382.747    
:65@N        30919.311    
:66@N        41866.636    
:67@N        20948.089    
:70@N        19856.831    
:71@N        33364.821    
:72@N        20610.17     
:73@N        15347.914    

relax> relax_disp.exp_type(spectrum_id='500_733.33.in', exp_type='MQ CPMG')
Setting the '500_733.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_733.33.in', cpmg_frq=733.3333)
Setting the '500_733.33.in' spectrum CPMG frequency 733.3333 Hz.

relax> spectrometer.frequency(id='500_733.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_733.33.in', time=0.03)
Setting the '500_733.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/800.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_800.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/800.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         14862.751    
:2@N         35585.882    
:3@N         34645.302    
:4@N         49272.485    
:5@N         24753.972    
:6@N         5684.3967    
:7@N         47417.168    
:8@N         32572.437    
:10@N        30492.265    
:11@N        46738.846    
:12@N        34925.041    
:13@N        45649.744    
:14@N        35183.435    
:15@N        29198.752    
:16@N        40481.55     
:17@N        34740.697    
:18@N        33165.331    
:19@N        35965.622    
:20@N        28175.782    
:21@N        26280.775    
:22@N        34015.135    
:23@N        34118.194    
:24@N        23750.68     
:25@N        34362.552    
:26@N        26043.71     
:29@N        31708.172    
:31@N        32469.882    
:32@N        35778.507    
:33@N        35133.099    
:34@N        32011.106    
:35@N        30194.357    
:36@N        30471.717    
:37@N        33984.533    
:38@N        31902.677    
:39@N        36577.61     
:40@N        27664.682    
:41@N        31317.994    
:42@N        36477.589    
:43@N        35602.425    
:44@N        47634.389    
:45@N        27072.862    
:46@N        32582.702    
:47@N        32737.528    
:48@N        32544.015    
:49@N        41187.081    
:50@N        33245.697    
:51@N        33017.969    
:52@N        26443.739    
:53@N        25114.104    
:55@N        30053.597    
:56@N        35171.821    
:57@N        33272.361    
:58@N        37729.843    
:59@N        33721.914    
:60@N        32819.816    
:61@N        26931.875    
:62@N        40778.459    
:63@N        38577.881    
:64@N        27398.616    
:65@N        31022.947    
:66@N        41783.735    
:67@N        21128.513    
:70@N        20053.047    
:71@N        33390.102    
:72@N        21181.203    
:73@N        15224.33     

relax> relax_disp.exp_type(spectrum_id='500_800.in', exp_type='MQ CPMG')
Setting the '500_800.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_800.in', cpmg_frq=800.0)
Setting the '500_800.in' spectrum CPMG frequency 800.0 Hz.

relax> spectrometer.frequency(id='500_800.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_800.in', time=0.03)
Setting the '500_800.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/866.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_866.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/866.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         14834.205    
:2@N         35498.799    
:3@N         34562.25     
:4@N         49239.025    
:5@N         24904.093    
:6@N         5621.8655    
:7@N         47339.79     
:8@N         32436.473    
:10@N        30561.977    
:11@N        46558.757    
:12@N        35072.63     
:13@N        45744.752    
:14@N        35384.598    
:15@N        29346.411    
:16@N        40550.178    
:17@N        34563.462    
:18@N        32945.763    
:19@N        35909.677    
:20@N        28179.519    
:21@N        26450.648    
:22@N        34269.449    
:23@N        34261.676    
:24@N        23834.739    
:25@N        34687.574    
:26@N        26136.174    
:29@N        31820.056    
:31@N        32476.232    
:32@N        35716.163    
:33@N        35091.264    
:34@N        31842.027    
:35@N        30252.405    
:36@N        30586.775    
:37@N        33821.475    
:38@N        31966.293    
:39@N        36550.38     
:40@N        27585.742    
:41@N        31397.202    
:42@N        36455.002    
:43@N        35331.788    
:44@N        47555.874    
:45@N        27036.087    
:46@N        32595.161    
:47@N        32803.227    
:48@N        32431.374    
:49@N        41321.843    
:50@N        33056.042    
:51@N        33001.726    
:52@N        26866.862    
:53@N        25191.474    
:55@N        30084.088    
:56@N        35134.855    
:57@N        33112.569    
:58@N        37723.766    
:59@N        33508.787    
:60@N        32796.988    
:61@N        27273.578    
:62@N        40971.652    
:63@N        38615.637    
:64@N        27761.342    
:65@N        31238.101    
:66@N        41712.681    
:67@N        21476.374    
:70@N        19936.355    
:71@N        33362.913    
:72@N        21504.577    
:73@N        15418.535    

relax> relax_disp.exp_type(spectrum_id='500_866.67.in', exp_type='MQ CPMG')
Setting the '500_866.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_866.67.in', cpmg_frq=866.6666)
Setting the '500_866.67.in' spectrum CPMG frequency 866.6666 Hz.

relax> spectrometer.frequency(id='500_866.67.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_866.67.in', time=0.03)
Setting the '500_866.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/933.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_933.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/933.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         14895.331    
:2@N         35558.6      
:3@N         34537.2      
:4@N         49294.717    
:5@N         24874.985    
:6@N         5723.1319    
:7@N         47207.529    
:8@N         32328.769    
:10@N        30461.063    
:11@N        46489.807    
:12@N        35191.454    
:13@N        45764.224    
:14@N        35497.281    
:15@N        29219.709    
:16@N        40589.924    
:17@N        34702.364    
:18@N        33290.11     
:19@N        35920.366    
:20@N        27992.753    
:21@N        26800.298    
:22@N        34161.92     
:23@N        34119.543    
:24@N        23868.983    
:25@N        34631.308    
:26@N        26133.906    
:29@N        31547.895    
:31@N        32403.592    
:32@N        35617.997    
:33@N        35109.75     
:34@N        32090.295    
:35@N        30302.147    
:36@N        30550.733    
:37@N        33872.826    
:38@N        32079.898    
:39@N        36455.548    
:40@N        27576.796    
:41@N        31474.554    
:42@N        36421.147    
:43@N        35539.076    
:44@N        47551.85     
:45@N        27259.748    
:46@N        32513.556    
:47@N        32961.585    
:48@N        32377.113    
:49@N        41291.014    
:50@N        33164.207    
:51@N        32969.653    
:52@N        26985.807    
:53@N        25056.988    
:55@N        30045.979    
:56@N        35325.281    
:57@N        33114.821    
:58@N        37912.568    
:59@N        33602.455    
:60@N        33003.711    
:61@N        27656.863    
:62@N        41155.803    
:63@N        38695.054    
:64@N        27894.602    
:65@N        30902.042    
:66@N        41719.71     
:67@N        21936.968    
:70@N        20182.933    
:71@N        33594.549    
:72@N        21420.534    
:73@N        15551.25     

relax> relax_disp.exp_type(spectrum_id='500_933.33.in', exp_type='MQ CPMG')
Setting the '500_933.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_933.33.in', cpmg_frq=933.3333)
Setting the '500_933.33.in' spectrum CPMG frequency 933.3333 Hz.

relax> spectrometer.frequency(id='500_933.33.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_933.33.in', time=0.03)
Setting the '500_933.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/933.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_933.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/933.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         15229.362    
:2@N         35613.376    
:3@N         34749.83     
:4@N         49229.692    
:5@N         24956.402    
:6@N         5643.1265    
:7@N         47131.601    
:8@N         32435.217    
:10@N        30422.563    
:11@N        46533.53     
:12@N        34942.655    
:13@N        45594.843    
:14@N        35069.502    
:15@N        29120.71     
:16@N        40614.679    
:17@N        34571.391    
:18@N        33167.946    
:19@N        35861.033    
:20@N        28017.402    
:21@N        26504.016    
:22@N        34266.075    
:23@N        34103.325    
:24@N        23736.228    
:25@N        34756.055    
:26@N        26045.027    
:29@N        31516.166    
:31@N        32446.023    
:32@N        35532.393    
:33@N        34915.682    
:34@N        31939.354    
:35@N        30223.588    
:36@N        30446.362    
:37@N        33963.351    
:38@N        32158.016    
:39@N        36331.365    
:40@N        27525.512    
:41@N        31327.511    
:42@N        36406.927    
:43@N        35176.551    
:44@N        47344.993    
:45@N        27016.338    
:46@N        32537.324    
:47@N        32865.426    
:48@N        32272.62     
:49@N        41379.769    
:50@N        33169.65     
:51@N        32884.827    
:52@N        27029.855    
:53@N        25049.972    
:55@N        30160.261    
:56@N        35247.235    
:57@N        33063.503    
:58@N        37803.247    
:59@N        33555.22     
:60@N        32926.579    
:61@N        27348.61     
:62@N        41026.941    
:63@N        38853.461    
:64@N        27898.98     
:65@N        31050.883    
:66@N        41857.417    
:67@N        21928.388    
:70@N        20069.04     
:71@N        33655.205    
:72@N        21097.418    
:73@N        15474.072    

relax> relax_disp.exp_type(spectrum_id='500_933.33.in.bis', exp_type='MQ CPMG')
Setting the '500_933.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_933.33.in.bis', cpmg_frq=933.3333)
Setting the '500_933.33.in.bis' spectrum CPMG frequency 933.3333 Hz.

relax> spectrometer.frequency(id='500_933.33.in.bis', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_933.33.in.bis', time=0.03)
Setting the '500_933.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='500_MHz/1000.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='500_1000.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/1000.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         15452.232    
:2@N         35656.747    
:3@N         34620.493    
:4@N         49310.788    
:5@N         25154.775    
:6@N         5683.8093    
:7@N         47286.883    
:8@N         32502.69     
:10@N        30457.495    
:11@N        46552.427    
:12@N        35111.286    
:13@N        45856.226    
:14@N        35217.464    
:15@N        29428.97     
:16@N        40510.311    
:17@N        34754.35     
:18@N        32922.56     
:19@N        35982.292    
:20@N        27959.017    
:21@N        26678.041    
:22@N        34017.798    
:23@N        34218.069    
:24@N        23783.367    
:25@N        34625.978    
:26@N        25904.439    
:29@N        31479.159    
:31@N        32501.4      
:32@N        35755.775    
:33@N        35196.513    
:34@N        31939.176    
:35@N        30083.413    
:36@N        30424.405    
:37@N        33967.504    
:38@N        32368.718    
:39@N        36545.499    
:40@N        27614.82     
:41@N        31255.557    
:42@N        36462.22     
:43@N        35131.589    
:44@N        47525.409    
:45@N        27222.561    
:46@N        32578.358    
:47@N        32818.585    
:48@N        32299.115    
:49@N        41330.568    
:50@N        33128.863    
:51@N        32855.971    
:52@N        27106.846    
:53@N        24939.166    
:55@N        30061.23     
:56@N        35006.044    
:57@N        33003.75     
:58@N        37491.939    
:59@N        33776.944    
:60@N        33021.396    
:61@N        27553.74     
:62@N        40742.053    
:63@N        38820.878    
:64@N        27900.325    
:65@N        30993.752    
:66@N        41943.503    
:67@N        22301.77     
:70@N        20229.099    
:71@N        33574.087    
:72@N        21461.571    
:73@N        15689.319    

relax> relax_disp.exp_type(spectrum_id='500_1000.in', exp_type='MQ CPMG')
Setting the '500_1000.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='500_1000.in', cpmg_frq=1000.0)
Setting the '500_1000.in' spectrum CPMG frequency 1000.0 Hz.

relax> spectrometer.frequency(id='500_1000.in', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='500_1000.in', time=0.03)
Setting the '500_1000.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/reference.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_reference.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/reference.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         55016.173     
:2@N         115841.42     
:3@N         111197.35     
:4@N         179861.72     
:5@N         87519.036     
:6@N         20670.274     
:7@N         172408.51     
:8@N         121952.51     
:10@N        107929.48     
:11@N        166994.27     
:12@N        116038.93     
:13@N        164314.74     
:14@N        131304.78     
:15@N        103341.21     
:16@N        153385.51     
:17@N        136442.29     
:18@N        118075.05     
:19@N        136547.8      
:20@N        96849.544     
:21@N        92449.456     
:22@N        132427.8      
:23@N        140639.77     
:24@N        92224.557     
:25@N        121067.54     
:26@N        95661.471     
:27@N        -20489.532    
:28@N        175932.89     
:29@N        116387.38     
:30@N        21519.171     
:31@N        126093.85     
:32@N        127022.63     
:33@N        133429.74     
:34@N        113965.83     
:35@N        108784.45     
:36@N        102854.35     
:37@N        136612.98     
:38@N        113315.55     
:39@N        134821.31     
:40@N        96946.32      
:41@N        117257.33     
:42@N        142016.32     
:43@N        118345.49     
:44@N        161349.18     
:45@N        94491.618     
:46@N        121918.87     
:47@N        126527.54     
:48@N        129155.52     
:49@N        148777.46     
:50@N        133566.63     
:51@N        121382.62     
:52@N        94240.554     
:53@N        83242.764     
:55@N        115334.6      
:56@N        132426.71     
:57@N        129314.32     
:58@N        140510.83     
:59@N        133253.5      
:60@N        134839.44     
:61@N        100740.64     
:62@N        131741.32     
:63@N        121281.79     
:64@N        96457.533     
:65@N        110857.49     
:66@N        152672.04     
:67@N        89722.502     
:70@N        75506.418     

relax> relax_disp.exp_type(spectrum_id='800_reference.in', exp_type='MQ CPMG')
Setting the '800_reference.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_reference.in', cpmg_frq=None)
Setting the '800_reference.in' spectrum CPMG frequency None Hz.

relax> spectrometer.frequency(id='800_reference.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_reference.in', time=0.03)
Setting the '800_reference.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/66.667.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_66.667.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/66.667.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         23035.747    
:2@N         99629.762    
:3@N         95663.137    
:4@N         170898.93    
:5@N         47323.876    
:6@N         20199.122    
:7@N         166554.88    
:8@N         90061.074    
:10@N        84726.204    
:11@N        150502.33    
:12@N        92998.531    
:13@N        163435.07    
:14@N        101373.01    
:15@N        83407.837    
:16@N        138191.26    
:17@N        110104.9     
:18@N        94324.035    
:19@N        111351.79    
:20@N        76339.41     
:21@N        62008.453    
:22@N        105904.04    
:23@N        106301.98    
:24@N        72996.32     
:25@N        95486.742    
:26@N        58067.989    
:27@N        -17168.51    
:28@N        168914.73    
:29@N        94038.555    
:30@N        21386.951    
:31@N        93982.899    
:32@N        86097.484    
:33@N        101943.37    
:34@N        85683.111    
:35@N        86985.768    
:36@N        86011.237    
:37@N        109840.97    
:38@N        87017.879    
:39@N        91682.649    
:40@N        76370.44     
:41@N        91393.531    
:42@N        110171.11    
:43@N        94552.366    
:44@N        128582.81    
:45@N        74583.525    
:46@N        92087.49     
:47@N        97507.255    
:48@N        100338.42    
:49@N        130483.05    
:50@N        105467.96    
:51@N        93099.697    
:52@N        46863.758    
:53@N        61055.806    
:55@N        68629.994    
:56@N        110055.52    
:57@N        105727.6     
:58@N        111769.5     
:59@N        98758.603    
:60@N        99517.201    
:61@N        54357.946    
:62@N        108999.78    
:63@N        84549.759    
:64@N        55014.55     
:65@N        80569.666    
:66@N        129366.1     
:67@N        36438.01     
:70@N        38763.157    

relax> relax_disp.exp_type(spectrum_id='800_66.667.in', exp_type='MQ CPMG')
Setting the '800_66.667.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_66.667.in', cpmg_frq=66.6666)
Setting the '800_66.667.in' spectrum CPMG frequency 66.6666 Hz.

relax> spectrometer.frequency(id='800_66.667.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_66.667.in', time=0.03)
Setting the '800_66.667.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/133.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_133.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/133.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         22894.885     
:2@N         100150.36     
:3@N         95906.834     
:4@N         170990.52     
:5@N         48550.561     
:6@N         19898.236     
:7@N         166298.89     
:8@N         91244.165     
:10@N        85721.984     
:11@N        151202.09     
:12@N        94337.569     
:13@N        163296.13     
:14@N        101879.73     
:15@N        83945.257     
:16@N        138192.78     
:17@N        109974.13     
:18@N        93946.229     
:19@N        111401.15     
:20@N        77037.149     
:21@N        63472.065     
:22@N        105859.41     
:23@N        106508.83     
:24@N        72641.885     
:25@N        95683.889     
:26@N        58919.208     
:27@N        -17210.185    
:28@N        168579.02     
:29@N        93901.156     
:30@N        21317.613     
:31@N        95517.758     
:32@N        88204.327     
:33@N        102713.88     
:34@N        86747.649     
:35@N        87721.413     
:36@N        85637.601     
:37@N        109727.03     
:38@N        87964.796     
:39@N        93475.606     
:40@N        76675.768     
:41@N        91354.427     
:42@N        111921.49     
:43@N        94210.77      
:44@N        128343.66     
:45@N        74354.332     
:46@N        93600.352     
:47@N        98760.693     
:48@N        101691.93     
:49@N        131138.24     
:50@N        105732.17     
:51@N        93887.296     
:52@N        48643.794     
:53@N        62448.011     
:55@N        70455.248     
:56@N        110516.43     
:57@N        106801.74     
:58@N        112022.84     
:59@N        99435.891     
:60@N        100341.33     
:61@N        53892.161     
:62@N        110187.73     
:63@N        85411.032     
:64@N        56560.609     
:65@N        81326.701     
:66@N        130469.89     
:67@N        37089.041     
:70@N        40007.044     

relax> relax_disp.exp_type(spectrum_id='800_133.33.in', exp_type='MQ CPMG')
Setting the '800_133.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_133.33.in', cpmg_frq=133.3333)
Setting the '800_133.33.in' spectrum CPMG frequency 133.3333 Hz.

relax> spectrometer.frequency(id='800_133.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_133.33.in', time=0.03)
Setting the '800_133.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/133.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_133.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/133.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         23431.581     
:2@N         100306.27     
:3@N         96166.008     
:4@N         170997.76     
:5@N         48956.05      
:6@N         20112.967     
:7@N         166406.37     
:8@N         91117.831     
:10@N        85470.791     
:11@N        151426.7      
:12@N        93685.309     
:13@N        163557.77     
:14@N        101814.42     
:15@N        83901.731     
:16@N        138482.51     
:17@N        109968.57     
:18@N        94318.243     
:19@N        111288.77     
:20@N        76842.26      
:21@N        63195.203     
:22@N        105997.25     
:23@N        106389.21     
:24@N        73205.203     
:25@N        95375.334     
:26@N        58665.233     
:27@N        -17215.423    
:28@N        168776.86     
:29@N        93770.941     
:30@N        21340.061     
:31@N        95648.306     
:32@N        88354.911     
:33@N        102912.83     
:34@N        86994.371     
:35@N        87097.668     
:36@N        85683.082     
:37@N        109997.53     
:38@N        87610.416     
:39@N        93572.559     
:40@N        76349.028     
:41@N        91096.708     
:42@N        111332.49     
:43@N        94558.52      
:44@N        128645.46     
:45@N        74991.508     
:46@N        93892.141     
:47@N        98662.815     
:48@N        102051.97     
:49@N        131442.13     
:50@N        105835.44     
:51@N        93808.334     
:52@N        49097.536     
:53@N        61882.84      
:55@N        70387.353     
:56@N        110595.3      
:57@N        105983.39     
:58@N        112222.9      
:59@N        99377.886     
:60@N        99936.482     
:61@N        54511.855     
:62@N        109820.57     
:63@N        85926.192     
:64@N        56397.873     
:65@N        80923.209     
:66@N        130290.37     
:67@N        37042.346     
:70@N        39866.015     

relax> relax_disp.exp_type(spectrum_id='800_133.33.in.bis', exp_type='MQ CPMG')
Setting the '800_133.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_133.33.in.bis', cpmg_frq=133.3333)
Setting the '800_133.33.in.bis' spectrum CPMG frequency 133.3333 Hz.

relax> spectrometer.frequency(id='800_133.33.in.bis', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_133.33.in.bis', time=0.03)
Setting the '800_133.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/200.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_200.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/200.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:1@N         24305.555    
:2@N         99866.425    
:3@N         95727.109    
:4@N         171598.73    
:5@N         50690.63     
:6@N         20134.273    
:7@N         166388.02    
:8@N         92489.917    
:10@N        85010.984    
:11@N        151105.36    
:12@N        94246.363    
:13@N        163528.06    
:14@N        102179.68    
:15@N        83736.305    
:16@N        138350.69    
:17@N        110684.1     
:18@N        94496.827    
:19@N        111801.77    
:20@N        76986.83     
:21@N        64522.053    
:22@N        106682.08    
:23@N        107776.2     
:24@N        73895.599    
:25@N        96000.368    
:26@N        60936.634    
:27@N        -17447.21    
:28@N        169370.69    
:29@N        94890.171    
:30@N        21929.152    
:31@N        96731.077    
:32@N        89485.573    
:33@N        103114.27    
:34@N        87345.273    
:35@N        88048.949    
:36@N        86028.338    
:37@N        110225.21    
:38@N        87611.186    
:39@N        95052.975    
:40@N        76612.649    
:41@N        91281.875    
:42@N        112257.56    
:43@N        94900.696    
:44@N        129586.77    
:45@N        75161.984    
:46@N        94990.178    
:47@N        99579.078    
:48@N        102634.31    
:49@N        131310.56    
:50@N        106535.97    
:51@N        94911.332    
:52@N        50486.848    
:53@N        63198.159    
:55@N        73151.964    
:56@N        111612.51    
:57@N        106992.73    
:58@N        112964.38    
:59@N        100205.98    
:60@N        101995.85    
:61@N        56149.345    
:62@N        110838.65    
:63@N        87055.23     
:64@N        58198.039    
:65@N        82127.959    
:66@N        130889.09    
:67@N        37463.24     
:70@N        40695.053    

relax> relax_disp.exp_type(spectrum_id='800_200.in', exp_type='MQ CPMG')
Setting the '800_200.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_200.in', cpmg_frq=200.0)
Setting the '800_200.in' spectrum CPMG frequency 200.0 Hz.

relax> spectrometer.frequency(id='800_200.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_200.in', time=0.03)
Setting the '800_200.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/266.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_266.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/266.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         24289.212     
:2@N         100591.42     
:3@N         96624.163     
:4@N         170741.44     
:5@N         52640.882     
:6@N         20084.813     
:7@N         166314.8      
:8@N         92743.312     
:10@N        85533.016     
:11@N        151407.64     
:12@N        95125.653     
:13@N        163617.94     
:14@N        103206.36     
:15@N        84391.168     
:16@N        138304.63     
:17@N        110797.63     
:18@N        95519.429     
:19@N        112303.08     
:20@N        77840.932     
:21@N        65538.096     
:22@N        106612.05     
:23@N        108479.74     
:24@N        73773.567     
:25@N        96382.989     
:26@N        62705.659     
:27@N        -17009.835    
:28@N        168507.43     
:29@N        94322.124     
:30@N        21536.032     
:31@N        97318.461     
:32@N        91602.642     
:33@N        103084.79     
:34@N        88259.59      
:35@N        87735.126     
:36@N        86131.115     
:37@N        109801.65     
:38@N        88219.192     
:39@N        96406.682     
:40@N        77046.214     
:41@N        92155.078     
:42@N        112264.21     
:43@N        94942.41      
:44@N        128748.1      
:45@N        75489.702     
:46@N        95245.605     
:47@N        99821.317     
:48@N        102636.08     
:49@N        131852.08     
:50@N        106020.96     
:51@N        95192.679     
:52@N        52427.773     
:53@N        64145.683     
:55@N        75767.739     
:56@N        111250.61     
:57@N        107758.48     
:58@N        113702.97     
:59@N        102250.57     
:60@N        104222.54     
:61@N        57804.811     
:62@N        111108.97     
:63@N        88602.166     
:64@N        60810.348     
:65@N        83698.895     
:66@N        131927.44     
:67@N        38957.75      
:70@N        41033.292     

relax> relax_disp.exp_type(spectrum_id='800_266.67.in', exp_type='MQ CPMG')
Setting the '800_266.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_266.67.in', cpmg_frq=266.6666)
Setting the '800_266.67.in' spectrum CPMG frequency 266.6666 Hz.

relax> spectrometer.frequency(id='800_266.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_266.67.in', time=0.03)
Setting the '800_266.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/333.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_333.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/333.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         25259.402     
:2@N         100770.35     
:3@N         96160.677     
:4@N         170855.52     
:5@N         54673.995     
:6@N         20101.939     
:7@N         166620.68     
:8@N         94852.414     
:10@N        85756.065     
:11@N        152104.65     
:12@N        95612.312     
:13@N        163711.53     
:14@N        103973.9      
:15@N        84380.946     
:16@N        138684.84     
:17@N        110866.7      
:18@N        95542.612     
:19@N        111618.16     
:20@N        77943.16      
:21@N        67208.122     
:22@N        107102.2      
:23@N        109659.66     
:24@N        73165.914     
:25@N        96587.68      
:26@N        64802.155     
:27@N        -17155.466    
:28@N        168997.54     
:29@N        94840.257     
:30@N        21672.704     
:31@N        98894.846     
:32@N        94053.515     
:33@N        103466.35     
:34@N        88719.561     
:35@N        88247.805     
:36@N        85687.442     
:37@N        110223.18     
:38@N        88971.811     
:39@N        97827.689     
:40@N        76123.679     
:41@N        92060.761     
:42@N        113234.62     
:43@N        94661.936     
:44@N        128829.38     
:45@N        75242.347     
:46@N        96212.27      
:47@N        99831.443     
:48@N        103234.9      
:49@N        132645.42     
:50@N        105901.72     
:51@N        95506.868     
:52@N        54418.174     
:53@N        64727.711     
:55@N        78076.094     
:56@N        111065.73     
:57@N        107474.14     
:58@N        114030.99     
:59@N        102440.83     
:60@N        104555.66     
:61@N        59072.272     
:62@N        112436.15     
:63@N        91614.185     
:64@N        63225.493     
:65@N        85388.161     
:66@N        132947.07     
:67@N        39630.564     
:70@N        42886.468     

relax> relax_disp.exp_type(spectrum_id='800_333.33.in', exp_type='MQ CPMG')
Setting the '800_333.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_333.33.in', cpmg_frq=333.3333)
Setting the '800_333.33.in' spectrum CPMG frequency 333.3333 Hz.

relax> spectrometer.frequency(id='800_333.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_333.33.in', time=0.03)
Setting the '800_333.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/400.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_400.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/400.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         26719.629     
:2@N         100851.91     
:3@N         95626.166     
:4@N         171184.09     
:5@N         56817.207     
:6@N         20069.164     
:7@N         166820.99     
:8@N         95197.147     
:10@N        86179.253     
:11@N        151917.21     
:12@N        96541.287     
:13@N        163407.81     
:14@N        104243.05     
:15@N        84587.694     
:16@N        138692.62     
:17@N        110569.22     
:18@N        95351.033     
:19@N        111991.74     
:20@N        78080.173     
:21@N        67849.967     
:22@N        107528.73     
:23@N        109901.03     
:24@N        73630.447     
:25@N        97054.414     
:26@N        66818.796     
:27@N        -17013.568    
:28@N        169154.4      
:29@N        94578.359     
:30@N        21502.985     
:31@N        99572.069     
:32@N        95105.722     
:33@N        103704.16     
:34@N        89259.675     
:35@N        88004.6       
:36@N        85827.151     
:37@N        110659.29     
:38@N        89374.073     
:39@N        98984.552     
:40@N        76626.79      
:41@N        92384.251     
:42@N        113581.06     
:43@N        95028.423     
:44@N        129055.05     
:45@N        75559.772     
:46@N        96701.777     
:47@N        100806.79     
:48@N        103199.14     
:49@N        132562.79     
:50@N        106526.61     
:51@N        96154.768     
:52@N        56424.46      
:53@N        65139.092     
:55@N        79367.202     
:56@N        111283.12     
:57@N        107629.8      
:58@N        114179.3      
:59@N        103393.31     
:60@N        105380.87     
:61@N        62234.568     
:62@N        113324.91     
:63@N        92947.406     
:64@N        65361.837     
:65@N        86325.701     
:66@N        133703.87     
:67@N        40183.814     
:70@N        43297.363     

relax> relax_disp.exp_type(spectrum_id='800_400.in', exp_type='MQ CPMG')
Setting the '800_400.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_400.in', cpmg_frq=400.0)
Setting the '800_400.in' spectrum CPMG frequency 400.0 Hz.

relax> spectrometer.frequency(id='800_400.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_400.in', time=0.03)
Setting the '800_400.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/466.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_466.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/466.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         27003.014     
:2@N         100905.9      
:3@N         96459.171     
:4@N         171251.59     
:5@N         59703.86      
:6@N         20322.452     
:7@N         166653.8      
:8@N         95689.59      
:10@N        86294.5       
:11@N        151799.56     
:12@N        96598.447     
:13@N        163641.15     
:14@N        104385.1      
:15@N        84583.503     
:16@N        138460.69     
:17@N        110571.6      
:18@N        95556.02      
:19@N        111914.37     
:20@N        78384.516     
:21@N        69167.308     
:22@N        107007.78     
:23@N        110425.23     
:24@N        73643.284     
:25@N        97125.674     
:26@N        68404.064     
:27@N        -17545.488    
:28@N        169098.12     
:29@N        95039.953     
:30@N        21506.447     
:31@N        100230.99     
:32@N        96780.416     
:33@N        103696.11     
:34@N        89992.531     
:35@N        87893.742     
:36@N        85851.373     
:37@N        110154.38     
:38@N        88875.864     
:39@N        99958.714     
:40@N        76670.552     
:41@N        92924.934     
:42@N        113879.51     
:43@N        94357.127     
:44@N        129346.92     
:45@N        75809.948     
:46@N        96859.188     
:47@N        101095.68     
:48@N        103869.88     
:49@N        133550.88     
:50@N        106336.79     
:51@N        96081.664     
:52@N        59800.1       
:53@N        65931.692     
:55@N        81465.831     
:56@N        111083.77     
:57@N        106866.28     
:58@N        114253.85     
:59@N        103317.59     
:60@N        105606.99     
:61@N        62828.977     
:62@N        113192.69     
:63@N        93478.73      
:64@N        67078.602     
:65@N        86904.584     
:66@N        134045.44     
:67@N        42248.407     
:70@N        44655.415     

relax> relax_disp.exp_type(spectrum_id='800_466.67.in', exp_type='MQ CPMG')
Setting the '800_466.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_466.67.in', cpmg_frq=466.6666)
Setting the '800_466.67.in' spectrum CPMG frequency 466.6666 Hz.

relax> spectrometer.frequency(id='800_466.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_466.67.in', time=0.03)
Setting the '800_466.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/533.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_533.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/533.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         29266.27      
:2@N         100721.68     
:3@N         96503.304     
:4@N         171507.2      
:5@N         61073.487     
:6@N         19933.56      
:7@N         166283.08     
:8@N         96075.588     
:10@N        86299.793     
:11@N        152036.24     
:12@N        96835.874     
:13@N        163568.22     
:14@N        104818.52     
:15@N        84676.468     
:16@N        138684.56     
:17@N        110662.64     
:18@N        96081.339     
:19@N        111830.94     
:20@N        78288.388     
:21@N        69283.278     
:22@N        107161.82     
:23@N        110547.99     
:24@N        74152.953     
:25@N        97344.153     
:26@N        69160.279     
:27@N        -17537.434    
:28@N        169061.19     
:29@N        94215.466     
:30@N        21496.752     
:31@N        100145.14     
:32@N        97823.625     
:33@N        103953.36     
:34@N        89674.759     
:35@N        88456.638     
:36@N        86577.259     
:37@N        110738.91     
:38@N        89530.576     
:39@N        100404.69     
:40@N        76869.96      
:41@N        92840.07      
:42@N        114052.91     
:43@N        94583.787     
:44@N        129167.4      
:45@N        75595.989     
:46@N        97502.23      
:47@N        101473.6      
:48@N        103997.64     
:49@N        133215.99     
:50@N        105808.07     
:51@N        96336.095     
:52@N        61196.991     
:53@N        65936.633     
:55@N        83415.155     
:56@N        110920.76     
:57@N        107254.57     
:58@N        114521.79     
:59@N        104470.58     
:60@N        106292.29     
:61@N        65094.634     
:62@N        113364.21     
:63@N        94335.839     
:64@N        68730.658     
:65@N        87054.383     
:66@N        134535.27     
:67@N        44126.852     
:70@N        46303.662     

relax> relax_disp.exp_type(spectrum_id='800_533.33.in', exp_type='MQ CPMG')
Setting the '800_533.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_533.33.in', cpmg_frq=533.3333)
Setting the '800_533.33.in' spectrum CPMG frequency 533.3333 Hz.

relax> spectrometer.frequency(id='800_533.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_533.33.in', time=0.03)
Setting the '800_533.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/533.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_533.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/533.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         28591.099     
:2@N         100998.15     
:3@N         96502.101     
:4@N         171584.43     
:5@N         62627.776     
:6@N         19925.142     
:7@N         166496.53     
:8@N         96735.096     
:10@N        86060.241     
:11@N        152052.79     
:12@N        97153.241     
:13@N        163634.94     
:14@N        104075.65     
:15@N        84571.417     
:16@N        138314.62     
:17@N        110612.79     
:18@N        95663.825     
:19@N        112023.6      
:20@N        78772.837     
:21@N        70120.022     
:22@N        106911.01     
:23@N        111207.0      
:24@N        73593.6       
:25@N        96695.458     
:26@N        69173.661     
:27@N        -17736.507    
:28@N        169196.37     
:29@N        94807.578     
:30@N        21555.453     
:31@N        100596.16     
:32@N        98756.097     
:33@N        104004.92     
:34@N        89897.601     
:35@N        88103.714     
:36@N        86237.686     
:37@N        110591.16     
:38@N        89905.492     
:39@N        101014.18     
:40@N        76691.85      
:41@N        92727.785     
:42@N        114070.74     
:43@N        95426.182     
:44@N        128820.93     
:45@N        75267.027     
:46@N        97064.311     
:47@N        101283.65     
:48@N        103817.37     
:49@N        133571.18     
:50@N        106329.47     
:51@N        95863.356     
:52@N        61228.776     
:53@N        65901.862     
:55@N        83313.832     
:56@N        111053.41     
:57@N        107549.04     
:58@N        114348.22     
:59@N        104449.04     
:60@N        106660.07     
:61@N        65571.583     
:62@N        113136.56     
:63@N        94361.474     
:64@N        68157.129     
:65@N        87085.891     
:66@N        134273.94     
:67@N        44030.662     
:70@N        47040.817     

relax> relax_disp.exp_type(spectrum_id='800_533.33.in.bis', exp_type='MQ CPMG')
Setting the '800_533.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_533.33.in.bis', cpmg_frq=533.3333)
Setting the '800_533.33.in.bis' spectrum CPMG frequency 533.3333 Hz.

relax> spectrometer.frequency(id='800_533.33.in.bis', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_533.33.in.bis', time=0.03)
Setting the '800_533.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/600.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_600.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/600.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         30802.391     
:2@N         100885.81     
:3@N         96437.96      
:4@N         170836.57     
:5@N         63928.673     
:6@N         19883.118     
:7@N         166377.19     
:8@N         97147.344     
:10@N        86424.112     
:11@N        151931.25     
:12@N        97029.574     
:13@N        163521.0      
:14@N        104767.3      
:15@N        84603.781     
:16@N        138606.78     
:17@N        110646.34     
:18@N        96040.13      
:19@N        112163.33     
:20@N        78466.856     
:21@N        69784.742     
:22@N        107039.64     
:23@N        111168.06     
:24@N        74032.19      
:25@N        97332.266     
:26@N        70909.404     
:27@N        -17412.791    
:28@N        169194.03     
:29@N        94494.847     
:30@N        21569.985     
:31@N        100694.08     
:32@N        99135.54      
:33@N        103976.67     
:34@N        90362.657     
:35@N        87951.445     
:36@N        85988.348     
:37@N        110380.5      
:38@N        89810.192     
:39@N        101590.27     
:40@N        76489.453     
:41@N        92987.85      
:42@N        114320.48     
:43@N        94523.698     
:44@N        129076.74     
:45@N        76069.495     
:46@N        97635.605     
:47@N        101495.85     
:48@N        103805.14     
:49@N        133192.6      
:50@N        106252.83     
:51@N        96509.258     
:52@N        63165.034     
:53@N        66369.554     
:55@N        84109.163     
:56@N        110512.08     
:57@N        106931.83     
:58@N        114376.0      
:59@N        104238.5      
:60@N        107315.39     
:61@N        66529.401     
:62@N        113134.71     
:63@N        94798.359     
:64@N        69467.908     
:65@N        87739.054     
:66@N        134608.19     
:67@N        45397.324     
:70@N        47902.702     

relax> relax_disp.exp_type(spectrum_id='800_600.in', exp_type='MQ CPMG')
Setting the '800_600.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_600.in', cpmg_frq=600.0)
Setting the '800_600.in' spectrum CPMG frequency 600.0 Hz.

relax> spectrometer.frequency(id='800_600.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_600.in', time=0.03)
Setting the '800_600.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/666.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_666.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/666.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         32227.062     
:2@N         101156.76     
:3@N         97026.979     
:4@N         171439.44     
:5@N         64604.267     
:6@N         20183.45      
:7@N         166581.3      
:8@N         97399.907     
:10@N        86203.026     
:11@N        151930.25     
:12@N        96829.484     
:13@N        163692.31     
:14@N        104557.99     
:15@N        84570.019     
:16@N        138476.38     
:17@N        110490.61     
:18@N        95563.948     
:19@N        112224.81     
:20@N        78566.021     
:21@N        70270.162     
:22@N        107176.93     
:23@N        111519.31     
:24@N        73966.113     
:25@N        97327.804     
:26@N        70860.81      
:27@N        -17321.528    
:28@N        169040.92     
:29@N        94370.82      
:30@N        21633.203     
:31@N        101746.81     
:32@N        100127.51     
:33@N        104134.93     
:34@N        90561.969     
:35@N        88254.435     
:36@N        85632.416     
:37@N        110272.8      
:38@N        89468.971     
:39@N        102231.73     
:40@N        76449.969     
:41@N        92686.384     
:42@N        114667.63     
:43@N        94716.971     
:44@N        129199.53     
:45@N        75282.058     
:46@N        98094.283     
:47@N        101664.6      
:48@N        103990.56     
:49@N        133771.05     
:50@N        106497.77     
:51@N        96296.232     
:52@N        65009.126     
:53@N        66630.449     
:55@N        85325.258     
:56@N        110834.05     
:57@N        107209.02     
:58@N        114757.07     
:59@N        104684.46     
:60@N        107508.0      
:61@N        68070.647     
:62@N        113762.71     
:63@N        95170.811     
:64@N        70748.035     
:65@N        87818.653     
:66@N        134348.02     
:67@N        47226.167     
:70@N        48972.729     

relax> relax_disp.exp_type(spectrum_id='800_666.67.in', exp_type='MQ CPMG')
Setting the '800_666.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_666.67.in', cpmg_frq=666.6666)
Setting the '800_666.67.in' spectrum CPMG frequency 666.6666 Hz.

relax> spectrometer.frequency(id='800_666.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_666.67.in', time=0.03)
Setting the '800_666.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/733.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_733.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/733.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         33403.914     
:2@N         101279.08     
:3@N         96884.706     
:4@N         171718.72     
:5@N         66621.889     
:6@N         20163.282     
:7@N         166543.59     
:8@N         97685.848     
:10@N        86644.692     
:11@N        151785.26     
:12@N        97253.257     
:13@N        163466.64     
:14@N        104836.9      
:15@N        85252.268     
:16@N        138309.52     
:17@N        110316.37     
:18@N        95764.368     
:19@N        111676.48     
:20@N        78550.748     
:21@N        70497.455     
:22@N        106951.45     
:23@N        111305.65     
:24@N        74212.606     
:25@N        96905.016     
:26@N        71679.019     
:27@N        -17503.659    
:28@N        169094.72     
:29@N        94466.606     
:30@N        21609.116     
:31@N        101693.67     
:32@N        100786.72     
:33@N        103825.26     
:34@N        90664.528     
:35@N        88233.258     
:36@N        85772.939     
:37@N        110543.71     
:38@N        89463.73      
:39@N        102249.34     
:40@N        76574.462     
:41@N        92987.44      
:42@N        114963.69     
:43@N        94662.558     
:44@N        128901.12     
:45@N        75819.394     
:46@N        98083.693     
:47@N        101223.68     
:48@N        104264.56     
:49@N        133520.58     
:50@N        106123.19     
:51@N        96697.272     
:52@N        66204.216     
:53@N        66828.483     
:55@N        85693.435     
:56@N        110709.33     
:57@N        107258.65     
:58@N        114647.7      
:59@N        104692.21     
:60@N        107831.26     
:61@N        68854.998     
:62@N        113833.08     
:63@N        95507.705     
:64@N        71842.427     
:65@N        87548.487     
:66@N        134840.54     
:67@N        48428.822     
:70@N        49560.47      

relax> relax_disp.exp_type(spectrum_id='800_733.33.in', exp_type='MQ CPMG')
Setting the '800_733.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_733.33.in', cpmg_frq=733.3333)
Setting the '800_733.33.in' spectrum CPMG frequency 733.3333 Hz.

relax> spectrometer.frequency(id='800_733.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_733.33.in', time=0.03)
Setting the '800_733.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/800.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_800.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/800.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         35769.45      
:2@N         101965.73     
:3@N         97133.544     
:4@N         171807.79     
:5@N         66694.061     
:6@N         20055.22      
:7@N         166358.59     
:8@N         97416.842     
:10@N        86370.127     
:11@N        152194.55     
:12@N        97224.315     
:13@N        163562.84     
:14@N        105150.03     
:15@N        84721.16      
:16@N        138091.88     
:17@N        110342.69     
:18@N        96067.809     
:19@N        112248.05     
:20@N        78625.762     
:21@N        70941.229     
:22@N        106857.08     
:23@N        111706.79     
:24@N        73697.676     
:25@N        96854.189     
:26@N        72038.068     
:27@N        -17456.997    
:28@N        169088.4      
:29@N        94577.741     
:30@N        21533.635     
:31@N        101393.33     
:32@N        100821.94     
:33@N        104162.93     
:34@N        90706.324     
:35@N        88148.948     
:36@N        86381.367     
:37@N        110606.71     
:38@N        90400.543     
:39@N        102823.43     
:40@N        76992.613     
:41@N        92800.19      
:42@N        114668.69     
:43@N        94153.077     
:44@N        129235.43     
:45@N        76735.032     
:46@N        97828.456     
:47@N        101600.59     
:48@N        104145.14     
:49@N        133163.11     
:50@N        106143.77     
:51@N        96524.738     
:52@N        67681.209     
:53@N        66221.377     
:55@N        86592.328     
:56@N        110676.94     
:57@N        107232.15     
:58@N        114508.07     
:59@N        105337.86     
:60@N        107728.36     
:61@N        69957.79      
:62@N        113699.32     
:63@N        95414.456     
:64@N        71915.44      
:65@N        88281.806     
:66@N        134560.46     
:67@N        49726.057     
:70@N        51244.752     

relax> relax_disp.exp_type(spectrum_id='800_800.in', exp_type='MQ CPMG')
Setting the '800_800.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_800.in', cpmg_frq=800.0)
Setting the '800_800.in' spectrum CPMG frequency 800.0 Hz.

relax> spectrometer.frequency(id='800_800.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_800.in', time=0.03)
Setting the '800_800.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/866.67.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_866.67.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/866.67.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         36732.29      
:2@N         101932.33     
:3@N         96846.259     
:4@N         171243.18     
:5@N         68334.54      
:6@N         19992.465     
:7@N         166199.8      
:8@N         97655.11      
:10@N        86130.443     
:11@N        151847.57     
:12@N        97278.054     
:13@N        163561.73     
:14@N        104736.5      
:15@N        84900.519     
:16@N        138274.83     
:17@N        110517.03     
:18@N        95549.771     
:19@N        111726.04     
:20@N        78416.552     
:21@N        71534.523     
:22@N        106426.96     
:23@N        111290.24     
:24@N        74265.739     
:25@N        97026.607     
:26@N        73034.4       
:27@N        -17953.528    
:28@N        168959.56     
:29@N        94581.365     
:30@N        21724.856     
:31@N        101412.28     
:32@N        101777.52     
:33@N        103835.54     
:34@N        90877.776     
:35@N        88869.04      
:36@N        85711.769     
:37@N        110221.52     
:38@N        90369.64      
:39@N        103348.58     
:40@N        76474.521     
:41@N        93163.04      
:42@N        114402.6      
:43@N        95101.625     
:44@N        128798.44     
:45@N        75871.028     
:46@N        97995.036     
:47@N        101421.57     
:48@N        104105.38     
:49@N        133943.12     
:50@N        106365.42     
:51@N        96328.724     
:52@N        68196.427     
:53@N        67459.866     
:55@N        87807.234     
:56@N        110484.04     
:57@N        107016.79     
:58@N        114756.53     
:59@N        105506.08     
:60@N        107813.95     
:61@N        70926.809     
:62@N        113671.78     
:63@N        96100.032     
:64@N        72655.89      
:65@N        88726.662     
:66@N        134836.63     
:67@N        50940.835     
:70@N        51656.057     

relax> relax_disp.exp_type(spectrum_id='800_866.67.in', exp_type='MQ CPMG')
Setting the '800_866.67.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_866.67.in', cpmg_frq=866.6666)
Setting the '800_866.67.in' spectrum CPMG frequency 866.6666 Hz.

relax> spectrometer.frequency(id='800_866.67.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_866.67.in', time=0.03)
Setting the '800_866.67.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/933.33.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_933.33.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/933.33.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         37352.107     
:2@N         101838.61     
:3@N         97262.363     
:4@N         171060.7      
:5@N         68222.732     
:6@N         20088.537     
:7@N         166355.51     
:8@N         97676.938     
:10@N        86660.169     
:11@N        152109.7      
:12@N        97436.125     
:13@N        163660.18     
:14@N        105466.26     
:15@N        85150.422     
:16@N        138511.09     
:17@N        110684.56     
:18@N        96062.157     
:19@N        111818.41     
:20@N        78711.9       
:21@N        71510.106     
:22@N        107233.29     
:23@N        111662.98     
:24@N        74340.412     
:25@N        97347.572     
:26@N        72862.516     
:27@N        -17619.079    
:28@N        169118.7      
:29@N        94498.223     
:30@N        21270.593     
:31@N        101917.78     
:32@N        101829.27     
:33@N        104549.45     
:34@N        90954.056     
:35@N        88224.733     
:36@N        85913.559     
:37@N        110333.33     
:38@N        90167.703     
:39@N        103414.21     
:40@N        76686.597     
:41@N        93485.345     
:42@N        114966.64     
:43@N        94737.239     
:44@N        128869.43     
:45@N        76347.827     
:46@N        98545.539     
:47@N        102004.24     
:48@N        104512.27     
:49@N        134048.56     
:50@N        106310.79     
:51@N        96641.586     
:52@N        68978.026     
:53@N        67069.548     
:55@N        88405.135     
:56@N        110638.23     
:57@N        107389.06     
:58@N        114968.93     
:59@N        105256.93     
:60@N        108336.76     
:61@N        71200.721     
:62@N        113746.75     
:63@N        96652.783     
:64@N        73245.215     
:65@N        89046.351     
:66@N        134784.98     
:67@N        52397.977     
:70@N        51189.967     

relax> relax_disp.exp_type(spectrum_id='800_933.33.in', exp_type='MQ CPMG')
Setting the '800_933.33.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_933.33.in', cpmg_frq=933.3333)
Setting the '800_933.33.in' spectrum CPMG frequency 933.3333 Hz.

relax> spectrometer.frequency(id='800_933.33.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_933.33.in', time=0.03)
Setting the '800_933.33.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/933.33.in.bis_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_933.33.in.bis', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/933.33.in.bis_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         36472.306     
:2@N         101971.18     
:3@N         97304.184     
:4@N         171275.37     
:5@N         68376.479     
:6@N         20274.779     
:7@N         166284.12     
:8@N         97865.185     
:10@N        86344.88      
:11@N        152173.14     
:12@N        97337.27      
:13@N        163829.54     
:14@N        105100.2      
:15@N        85430.264     
:16@N        138420.99     
:17@N        110479.21     
:18@N        96317.914     
:19@N        111991.61     
:20@N        78391.994     
:21@N        71222.633     
:22@N        106994.18     
:23@N        111652.24     
:24@N        74342.65      
:25@N        96755.951     
:26@N        73652.165     
:27@N        -17236.668    
:28@N        169276.79     
:29@N        94679.506     
:30@N        21581.121     
:31@N        101978.64     
:32@N        102126.23     
:33@N        104309.82     
:34@N        90830.978     
:35@N        88574.97      
:36@N        86177.138     
:37@N        110783.13     
:38@N        90542.095     
:39@N        103704.42     
:40@N        76803.343     
:41@N        92692.069     
:42@N        114917.9      
:43@N        94831.133     
:44@N        128916.93     
:45@N        76338.028     
:46@N        98569.965     
:47@N        101516.67     
:48@N        104431.68     
:49@N        133543.94     
:50@N        105956.67     
:51@N        96336.905     
:52@N        68526.764     
:53@N        66968.694     
:55@N        87857.057     
:56@N        110981.69     
:57@N        106948.0      
:58@N        115054.04     
:59@N        105662.04     
:60@N        108468.61     
:61@N        70975.442     
:62@N        114396.45     
:63@N        96601.462     
:64@N        73202.381     
:65@N        88584.552     
:66@N        135045.56     
:67@N        52383.105     
:70@N        52254.914     

relax> relax_disp.exp_type(spectrum_id='800_933.33.in.bis', exp_type='MQ CPMG')
Setting the '800_933.33.in.bis' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_933.33.in.bis', cpmg_frq=933.3333)
Setting the '800_933.33.in.bis' spectrum CPMG frequency 933.3333 Hz.

relax> spectrometer.frequency(id='800_933.33.in.bis', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_933.33.in.bis', time=0.03)
Setting the '800_933.33.in.bis' spectrum relaxation time period to 0.03 s.

relax> spectrum.read_intensities(file='800_MHz/1000.in_sparky', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen', spectrum_id='800_1000.in', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/1000.in_sparky' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         37940.861     
:2@N         101823.6      
:3@N         96963.681     
:4@N         171198.06     
:5@N         69560.678     
:6@N         20136.298     
:7@N         165964.18     
:8@N         97567.34      
:10@N        86358.552     
:11@N        151683.52     
:12@N        97128.786     
:13@N        163119.07     
:14@N        104893.27     
:15@N        84841.741     
:16@N        138139.88     
:17@N        110103.1      
:18@N        95557.729     
:19@N        111635.93     
:20@N        78545.039     
:21@N        71815.958     
:22@N        106590.94     
:23@N        111543.8      
:24@N        74312.504     
:25@N        96468.295     
:26@N        73500.144     
:27@N        -17383.767    
:28@N        168511.68     
:29@N        93831.803     
:30@N        21459.529     
:31@N        101803.65     
:32@N        102836.68     
:33@N        104488.9      
:34@N        90594.906     
:35@N        88639.484     
:36@N        85506.897     
:37@N        110550.11     
:38@N        90662.286     
:39@N        103826.26     
:40@N        76427.289     
:41@N        93457.325     
:42@N        114415.55     
:43@N        95065.867     
:44@N        128326.98     
:45@N        76056.732     
:46@N        97626.449     
:47@N        101722.71     
:48@N        104343.86     
:49@N        133504.99     
:50@N        105803.2      
:51@N        96253.587     
:52@N        70152.557     
:53@N        66816.081     
:55@N        88771.278     
:56@N        110373.6      
:57@N        106636.75     
:58@N        114424.37     
:59@N        105406.04     
:60@N        108733.15     
:61@N        72179.713     
:62@N        113829.53     
:63@N        96976.905     
:64@N        73992.686     
:65@N        88811.831     
:66@N        134954.84     
:67@N        54060.722     
:70@N        52727.575     

relax> relax_disp.exp_type(spectrum_id='800_1000.in', exp_type='MQ CPMG')
Setting the '800_1000.in' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_1000.in', cpmg_frq=1000.0)
Setting the '800_1000.in' spectrum CPMG frequency 1000.0 Hz.

relax> spectrometer.frequency(id='800_1000.in', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_1000.in', time=0.03)
Setting the '800_1000.in' spectrum relaxation time period to 0.03 s.

relax> spectrum.replicated(spectrum_ids=['500_133.33.in', '500_133.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['500_533.33.in', '500_533.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['500_933.33.in', '500_933.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['800_133.33.in', '800_133.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['800_533.33.in', '800_533.33.in.bis'])

relax> spectrum.replicated(spectrum_ids=['800_933.33.in', '800_933.33.in.bis'])

relax> spectrum.error_analysis(subset=['500_reference.in', '500_66.667.in', '500_133.33.in', '500_133.33.in.bis', '500_200.in', '500_266.67.in', '500_333.33.in', '500_400.in', '500_466.67.in', '500_533.33.in', '500_533.33.in.bis', '500_600.in', '500_666.67.in', '500_733.33.in', '500_800.in', '500_866.67.in', '500_933.33.in', '500_933.33.in.bis', '500_1000.in'])
Intensity measure:  Peak heights.
Replicated spectra:  Yes.
All spectra replicated:  No.

Replicated spectra:  ['500_133.33.in', '500_133.33.in.bis']
Standard deviation:  132.165166899

Replicated spectra:  ['500_533.33.in', '500_533.33.in.bis']
Standard deviation:  139.49874291

Replicated spectra:  ['500_933.33.in', '500_933.33.in.bis']
Standard deviation:  103.633969846

Variance averaging over all spectra.
Standard deviation for all spins:  126.05227793927868

relax> spectrum.error_analysis(subset=['800_reference.in', '800_66.667.in', '800_133.33.in', '800_133.33.in.bis', '800_200.in', '800_266.67.in', '800_333.33.in', '800_400.in', '800_466.67.in', '800_533.33.in', '800_533.33.in.bis', '800_600.in', '800_666.67.in', '800_733.33.in', '800_800.in', '800_866.67.in', '800_933.33.in', '800_933.33.in.bis', '800_1000.in'])
Intensity measure:  Peak heights.
Replicated spectra:  Yes.
All spectra replicated:  No.

Replicated spectra:  ['800_133.33.in', '800_133.33.in.bis']
Standard deviation:  226.967929887

Replicated spectra:  ['800_533.33.in', '800_533.33.in.bis']
Standard deviation:  306.07281816

Replicated spectra:  ['800_933.33.in', '800_933.33.in.bis']
Standard deviation:  246.494959217

Variance averaging over all spectra.
Standard deviation for all spins:  168.97383359147142

relax> deselect.read(file='unresolved', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz', spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, boolean='AND', change_all=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/500_MHz/unresolved' for reading.
The following spins were deselected:
:9@N
:27@N
:28@N
:30@N
:54@N
:68@N
:69@N

relax> deselect.read(file='unresolved', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz', spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, boolean='AND', change_all=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/800_MHz/unresolved' for reading.
The following spins were deselected:
:9@N
:54@N
:68@N
:69@N

relax> select.spin(spin_id=':70-71', boolean='OR', change_all=True)

relax> pipe.copy(pipe_from='base pipe', pipe_to='R2eff', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='R2eff')

relax> relax_disp.select_model(model='R2eff')
R2eff/R1rho value and error determination.

relax> calc(verbosity=1)
Calculating the R2eff/R1rho values for fixed relaxation time period data.
Spin ':70@N'.
Spin ':71@N'.

relax> pipe.copy(pipe_from='base pipe', pipe_to='MQ CR72', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='MQ CR72')

relax> relax_disp.select_model(model='MQ CR72')
The Carver and Richards (1972) 2-site model for all time scales expanded for MQ CPMG data by Korzhnev et al., 2004.

relax> value.copy(pipe_from='R2eff', pipe_to='MQ CR72', param='r2eff')

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.6972410747,    0.9404991116,     5.607897282,               0,     0.989863341,    0.1758043421]    fk: 65.3966157769       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~
RelaxWarning: invalid value encountered in sqrt
RelaxWarning: invalid value encountered in sqrt

	k: 0        xk: [   0.6972410747,    0.9404991116,     5.607897282,         0.00025,     0.989863341,    0.1758043421]    fk: 65.4249131197       
	k: 100      xk: [   0.6945712032,    0.9407515417,     5.637751613, 0.0003605466605,    0.9897230054,    0.1743468991]    fk: 54.5294845613       
	k: 200      xk: [     0.69373595,    0.9353176913,     5.679813859, 0.0003998714908,    0.9897294029,     0.173738635]    fk: 54.1515105826       
	k: 300      xk: [   0.6941191618,    0.9352544608,     5.680658642, 0.0003743680954,    0.9897424854,    0.1741607461]    fk: 54.1422090175       
	k: 400      xk: [   0.6948801016,    0.9385940354,     5.678371754, 0.0004537350174,    0.9897198212,    0.1721778926]    fk: 54.1014417037       

	Parameter values: [0.69617017069035492, 0.9395084710526892, 5.6724705263572002, 0.00043919322142537537, 0.98971796150904046, 0.17202573032179883]
	Function value:   54.085635237080616
	Iterations:       500
	Function calls:   789
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.6961701707,    0.9395084711,     5.672470526, 0.0004391932214,    0.9897179615,    0.1720257303]    fk: 54.0629800222       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6961701707,    0.9395084711,     5.672470526, 0.0004611528825,    0.9897179615,    0.1720257303]    fk: 54.063201401        
	k: 100      xk: [   0.6961705977,    0.9394546236,     5.672334465, 0.0005068605453,    0.9897188124,    0.1720855899]    fk: 54.0631705766       
	k: 200      xk: [   0.6936192543,    0.9338721323,     5.676549973,    0.1816656459,    0.9896688029,     0.172729449]    fk: 53.8569279699       
	k: 300      xk: [   0.6930014316,    0.9356773296,     5.658574771,    0.1970435686,    0.9896553543,    0.1725508744]    fk: 53.7378272734       
	k: 400      xk: [   0.6952839866,    0.9387270399,       5.6324111,    0.2162507605,    0.9896020534,    0.1710326788]    fk: 53.6597667463       

	Parameter values: [0.68241432912385624, 0.92197086620560298, 5.6263826681638633, 0.40996655983061736, 0.9893063969545185, 0.16704712303352776]
	Function value:   52.406896945256058
	Iterations:       500
	Function calls:   817
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.6824143291,    0.9219708662,     5.626382668,    0.4099665598,     0.989306397,     0.167047123]    fk: 52.4247014898       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6824143291,    0.9219708662,     5.626382668,    0.4099665598,     0.989306397,     0.167047123]    fk: 52.4073461188       
	k: 100      xk: [   0.6832229034,    0.9152304665,     5.647183763,    0.4096896568,    0.9894249754,    0.1712447405]    fk: 51.7095264627       
	k: 200      xk: [   0.6834598064,    0.9153025634,     5.642536643,    0.4096417042,    0.9894231699,    0.1714733385]    fk: 51.7069484551       
	k: 300      xk: [   0.6832238413,    0.9149284235,     5.645374226,    0.4100886754,    0.9894223981,    0.1714149939]    fk: 51.7037224          
	k: 400      xk: [   0.6834314847,    0.9153107604,     5.641664299,    0.4100918201,    0.9894196487,    0.1713965569]    fk: 51.7023337345       

	Parameter values: [0.68347275869310442, 0.91530490887892602, 5.6414553948590314, 0.41009608324340807, 0.98942190692053966, 0.17150398914845333]
	Function value:   51.701966495825722
	Iterations:       500
	Function calls:   811
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.6834727587,    0.9153049089,     5.641455395,    0.4100960832,    0.9894219069,    0.1715039891]    fk: 51.7019743807       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834727587,    0.9153049089,     5.641455395,    0.4100960832,    0.9894219069,    0.1715039891]    fk: 51.7019710007       
	k: 100      xk: [   0.6834682322,     0.915324867,      5.64145464,    0.4100960709,    0.9894221547,    0.1714993179]    fk: 51.7019506052       
	k: 200      xk: [    0.683458741,    0.9153256175,     5.641454301,     0.410096131,    0.9894221458,    0.1714992587]    fk: 51.7019481393       
	k: 300      xk: [   0.6834584925,    0.9153250585,     5.641454262,    0.4100961308,    0.9894221326,    0.1714992556]    fk: 51.7019481063       

	Parameter values: [0.68345849254212587, 0.91532505854906288, 5.6414542622812149, 0.41009613082671059, 0.98942213256523193, 0.17149925558389129]
	Function value:   51.701948106278955
	Iterations:       373
	Function calls:   799
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.6834584925,    0.9153250585,     5.641454262,    0.4100961308,    0.9894221326,    0.1714992556]    fk: 51.7019481518       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834584925,    0.9153250585,     5.641454262,    0.4100961308,    0.9894221326,    0.1714992556]    fk: 51.7019481513       
	k: 100      xk: [   0.6834584925,    0.9153250585,     5.641454262,    0.4100961308,    0.9894221326,    0.1714992556]    fk: 51.7019481513       
	k: 200      xk: [   0.6834618276,    0.9153307226,      5.64145422,    0.4100961187,     0.989422111,    0.1714960417]    fk: 51.7019479001       
	k: 300      xk: [   0.6834618413,    0.9153308474,     5.641454205,    0.4100961153,    0.9894220947,    0.1714954119]    fk: 51.701947869        
	k: 400      xk: [   0.6834605115,    0.9153345523,     5.641453688,    0.4100961028,    0.9894220509,     0.171492645]    fk: 51.7019477084       

	Parameter values: [0.68346057065207888, 0.91533474758810729, 5.6414536775916044, 0.41009610199585106, 0.98942204798684896, 0.1714924419647546]
	Function value:   51.701947707153799
	Iterations:       500
	Function calls:   888
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 5        xk: [   0.6834605707,    0.9153347476,     5.641453678,     0.410096102,     0.989422048,     0.171492442]    fk: 51.7019477076       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834605707,    0.9153347476,     5.641453678,     0.410096102,     0.989422048,     0.171492442]    fk: 51.7019477076       
	k: 100      xk: [   0.6834605707,    0.9153347476,     5.641453678,     0.410096102,     0.989422048,     0.171492442]    fk: 51.7019477076       
	k: 200      xk: [   0.6834605707,    0.9153347476,     5.641453678,     0.410096102,     0.989422048,     0.171492442]    fk: 51.7019477076       
	k: 300      xk: [   0.6834605018,    0.9153345576,       5.6414537,    0.4100961027,      0.98942205,    0.1714926163]    fk: 51.701947707        

	Parameter values: [0.68346050182266938, 0.91533455758420379, 5.6414536999716933, 0.41009610272138908, 0.98942205001404404, 0.1714926163418754]
	Function value:   51.701947707042244
	Iterations:       351
	Function calls:   736
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6834605018,    0.9153345576,       5.6414537,    0.4100961027,      0.98942205,    0.1714926163]    fk: 51.7019477071       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834605018,    0.9153345576,       5.6414537,    0.4100961027,      0.98942205,    0.1714926163]    fk: 51.701947707        
	k: 100      xk: [   0.6834605018,    0.9153345576,       5.6414537,    0.4100961027,      0.98942205,    0.1714926163]    fk: 51.701947707        
	k: 200      xk: [   0.6834604963,    0.9153344828,     5.641453707,    0.4100961027,    0.9894220496,    0.1714926275]    fk: 51.701947707        
	k: 300      xk: [   0.6834604806,    0.9153344445,      5.64145371,    0.4100961029,    0.9894220503,    0.1714926585]    fk: 51.7019477069       

	Parameter values: [0.68346048059544029, 0.91533444445540213, 5.641453710130504, 0.41009610288376319, 0.98942205034663222, 0.17149265845937217]
	Function value:   51.701947706887999
	Iterations:       365
	Function calls:   773
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6834604806,    0.9153344445,      5.64145371,    0.4100961029,    0.9894220503,    0.1714926585]    fk: 51.7019477069       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834604806,    0.9153344445,      5.64145371,    0.4100961029,    0.9894220503,    0.1714926585]    fk: 51.7019477069       
	k: 100      xk: [   0.6834604806,    0.9153344445,      5.64145371,    0.4100961029,    0.9894220503,    0.1714926585]    fk: 51.7019477069       
	k: 200      xk: [   0.6834604806,    0.9153344445,      5.64145371,    0.4100961029,    0.9894220503,    0.1714926585]    fk: 51.7019477069       
	k: 300      xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       

	Parameter values: [0.68346047457127246, 0.9153344330650236, 5.6414537114463901, 0.4100961029484208, 0.98942205058839627, 0.17149267247915609]
	Function value:   51.701947706871422
	Iterations:       322
	Function calls:   697
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       
	k: 100      xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       
	k: 200      xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       
	k: 300      xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       

	Parameter values: [0.68346047457126946, 0.91533443306502416, 5.6414537114463901, 0.4100961029484208, 0.98942205058839616, 0.17149267247915692]
	Function value:   51.701947706866413
	Iterations:       322
	Function calls:   710
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       
	k: 100      xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       
	k: 200      xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       
	k: 300      xk: [   0.6834604746,    0.9153344331,     5.641453711,    0.4100961029,    0.9894220506,    0.1714926725]    fk: 51.7019477069       

	Parameter values: [0.68346047457126946, 0.91533443306502416, 5.6414537114463901, 0.4100961029484208, 0.98942205058839616, 0.17149267247915692]
	Function value:   51.701947706866413
	Iterations:       317
	Function calls:   706
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.68346047457126946, 0.91533443306502416, 5.6414537114463901, 0.4100961029484208, 0.98942205058839616, 0.17149267247915692]
Function value:   51.701947706866413
Iterations:       4050
Function calls:   7726
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.834604745712695
r2 (800.000 MHz):            9.153344330650242
dw:                          5.641453711446390
dwH:                         0.410096102948421
pA:                          0.989422050588396
kex:                      1714.926724791569313


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4981350616,               1,     4.347174101,               0,    0.9966122837,    0.1935650259]    fk: 5.87377619743       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4981350616,               1,     4.347174101,         0.00025,    0.9966122837,    0.1935650259]    fk: 5.91716406039       
	k: 100      xk: [   0.4983633128,     1.014228266,     4.404407321,  0.000213911717,    0.9966025181,    0.1887883756]    fk: 5.53074544384       
	k: 200      xk: [   0.4976163668,     1.181463407,     4.205624877,  0.001382648401,    0.9963099791,     0.196386406]    fk: 5.51769294085       
	k: 300      xk: [   0.4984841075,     6.085850287,     4.524715213,   0.02453017835,    0.9967528796,    0.1864252903]    fk: 5.4684977436        
	k: 400      xk: [   0.4981970276,     13.81927014,     4.575196791,   0.06182102803,     0.996798909,     0.184910185]    fk: 5.4578268367        

	Parameter values: [0.49820677559122606, 13.571199609923685, 4.5111711715921921, 0.060688965043100535, 0.9967270826766349, 0.18666037123045445]
	Function value:   5.4572613921208477
	Iterations:       500
	Function calls:   777
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4982067756,     13.57119961,     4.511171172,   0.06068896504,    0.9967270827,    0.1866603712]    fk: 5.48370421124       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4982067756,     13.57119961,     4.511171172,    0.0637234133,    0.9967270827,    0.1866603712]    fk: 5.4834189615        
	k: 100      xk: [   0.4973639019,     7.434642544,     4.634465386,    0.2955540407,    0.9968538166,    0.1808625695]    fk: 5.48104393032       
	k: 200      xk: [   0.4915930785,     1.307423175,     4.588985169,    0.6527560408,     0.996726872,    0.1782172287]    fk: 5.46403077769       
	k: 300      xk: [   0.4914586604,     2.080902989,     4.600104378,    0.6583581588,    0.9967346677,    0.1781322029]    fk: 5.46321127358       
	k: 400      xk: [   0.4914118409,     1.078797082,     4.610313592,    0.6582493256,    0.9967432175,    0.1778191586]    fk: 5.46303997701       

	Parameter values: [0.49138339959085142, 1.1206144320742624, 4.6098208802982512, 0.65834745165967035, 0.99674195142303668, 0.17793757961142076]
	Function value:   5.4630280939209976
	Iterations:       500
	Function calls:   802
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4913833996,     1.120614432,      4.60982088,    0.6583474517,    0.9967419514,    0.1779375796]    fk: 5.46338415284       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4913833996,     1.176645154,      4.60982088,    0.6583474517,    0.9967419514,    0.1779375796]    fk: 5.4633812042        
	k: 100      xk: [   0.4913581601,     1.142813928,     4.609821446,    0.6583451784,    0.9967390487,    0.1777566385]    fk: 5.46312896067       
	k: 200      xk: [   0.4913523152,     1.145263667,      4.60982117,    0.6583453579,    0.9967392931,    0.1777493776]    fk: 5.46311377931       
	k: 300      xk: [     0.49145411,     8.756582754,     4.609878395,    0.6583353711,    0.9967416763,    0.1773190299]    fk: 5.46305132051       
	k: 400      xk: [   0.4914575508,     8.849755124,      4.60987904,    0.6583353574,    0.9967418357,    0.1773231433]    fk: 5.46305075705       

	Parameter values: [0.49145755084508858, 8.8497551245171735, 4.6098790400498775, 0.65833535743327243, 0.99674183565350971, 0.17732314332733154]
	Function value:   5.4630507570504188
	Iterations:       500
	Function calls:   997
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.4914575508,     8.849755125,      4.60987904,    0.6583353574,    0.9967418357,    0.1773231433]    fk: 5.46305586091       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4914575508,     9.292242881,      4.60987904,    0.6583353574,    0.9967418357,    0.1773231433]    fk: 5.46305580979       
	k: 100      xk: [   0.4914575508,     9.292242881,      4.60987904,    0.6583353574,    0.9967418357,    0.1773231433]    fk: 5.46305580979       
	k: 200      xk: [   0.4914595606,     11.75268268,     4.609878767,    0.6583354661,    0.9967418821,    0.1773156132]    fk: 5.46305579154       
	k: 300      xk: [   0.4914588865,     16.77151407,     4.609878011,    0.6583356524,    0.9967418679,    0.1773191258]    fk: 5.46305577116       
	k: 400      xk: [   0.4914580509,     15.23872463,     4.609868228,    0.6583382505,    0.9967418335,    0.1773214723]    fk: 5.46305542323       

	Parameter values: [0.49145785271004133, 14.071471501593834, 4.6098681871950973, 0.65833826265647932, 0.99674183403361138, 0.17732184802523909]
	Function value:   5.4630554201973744
	Iterations:       500
	Function calls:   868
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [   0.4914578527,      14.0714715,     4.609868187,    0.6583382627,     0.996741834,     0.177321848]    fk: 5.46305546956       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4914578527,      14.0714715,     4.609868187,    0.6583382627,     0.996741834,     0.177321848]    fk: 5.46305546906       
	k: 100      xk: [   0.4914578527,      14.0714715,     4.609868187,    0.6583382627,     0.996741834,     0.177321848]    fk: 5.46305546906       
	k: 200      xk: [   0.4914578418,     14.19145144,     4.609868187,    0.6583382617,    0.9967418327,      0.17732177]    fk: 5.46305546894       
	k: 300      xk: [   0.4914578695,     13.61937832,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546884       

	Parameter values: [0.49145786951908454, 13.61937831600212, 4.6098681872921157, 0.65833826158369235, 0.99674183256224724, 0.17732174772649462]
	Function value:   5.4630554688445576
	Iterations:       372
	Function calls:   913
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.4914578695,     13.61937832,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4914578695,     13.61937832,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 100      xk: [   0.4914578695,     13.61937832,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 200      xk: [   0.4914578695,     13.61937832,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 300      xk: [   0.4914578695,     13.61937832,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       

	Parameter values: [0.49145786951908454, 13.61937831600212, 4.6098681872921157, 0.65833826158369235, 0.99674183256224724, 0.17732174772649462]
	Function value:   5.4630554693372568
	Iterations:       312
	Function calls:   692
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.4914578695,     13.61937832,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546935       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4914578695,     13.61937832,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 100      xk: [   0.4914578695,     13.61937832,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 200      xk: [   0.4914578695,     13.61937832,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 300      xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       

	Parameter values: [0.49145786951908454, 13.789620544952147, 4.6098681872921157, 0.65833826158369235, 0.99674183256224724, 0.17732174772649462]
	Function value:   5.4630554693421818
	Iterations:       312
	Function calls:   692
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546935       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 100      xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 200      xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 300      xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       

	Parameter values: [0.49145786951908454, 13.789620544952147, 4.6098681872921157, 0.65833826158369235, 0.99674183256224724, 0.17732174772649462]
	Function value:   5.4630554693422324
	Iterations:       312
	Function calls:   692
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546935       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 100      xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 200      xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       
	k: 300      xk: [   0.4914578695,     13.78962054,     4.609868187,    0.6583382616,    0.9967418326,    0.1773217477]    fk: 5.46305546934       

	Parameter values: [0.49145786951908454, 13.789620544952147, 4.6098681872921157, 0.65833826158369235, 0.99674183256224724, 0.17732174772649462]
	Function value:   5.4630554693422324
	Iterations:       312
	Function calls:   692
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.49145786951908454, 13.789620544952147, 4.6098681872921157, 0.65833826158369235, 0.99674183256224724, 0.17732174772649462]
Function value:   5.4630554693422324
Iterations:       3620
Function calls:   7125
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.914578695190846
r2 (800.000 MHz):          137.896205449521460
dw:                          4.609868187292116
dwH:                         0.658338261583692
pA:                          0.996741832562247
kex:                      1773.217477264946183

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':70@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.6834604746,    0.9153344331,     5.641453711,               0,    0.9894220506,    0.1714926725]    fk: 69.4509990583       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834604746,    0.9153344331,     5.641453711,         0.00025,    0.9894220506,    0.1714926725]    fk: 69.4795103647       
	k: 100      xk: [   0.6738793397,    0.9167219817,     5.752266073, 0.0006447331161,    0.9894121586,    0.1665252323]    fk: 64.9162517346       
	k: 200      xk: [    0.688499607,    0.9299388673,     5.691579777,  6.28467916e-06,    0.9897633944,    0.1766778739]    fk: 54.7239096725       
	k: 300      xk: [   0.6922161843,    0.9290321102,     5.691763278, 2.470153865e-05,    0.9897829725,    0.1775847723]    fk: 54.4233349333       
	k: 400      xk: [   0.6926654956,    0.9294435562,     5.694782243, 5.606427615e-05,    0.9897905172,    0.1773971837]    fk: 54.3929114836       

	Parameter values: [0.69640774765320135, 0.93965260470145462, 5.670669663008769, 0.00050559850375943044, 0.98971869595128292, 0.17212240565272779]
	Function value:   54.084840286390644
	Iterations:       500
	Function calls:   789
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.6964077477,    0.9396526047,     5.670669663, 0.0005055985038,     0.989718696,    0.1721224057]    fk: 54.063599592        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6964077477,    0.9396526047,     5.670669663, 0.0005308784289,     0.989718696,    0.1721224057]    fk: 54.0638067496       
	k: 100      xk: [   0.6961840036,    0.9394570117,     5.672309683, 0.0005004639645,    0.9897183374,    0.1720719044]    fk: 54.0631685988       
	k: 200      xk: [   0.6964691126,    0.9398222587,     5.670476523,   0.01058112083,    0.9897149497,    0.1719414981]    fk: 54.062151983        
	k: 300      xk: [   0.6912224152,    0.9281266661,     5.686496129,    0.2379395517,    0.9897270454,    0.1751360196]    fk: 53.5810610348       
	k: 400      xk: [   0.6831768818,    0.9206732063,     5.714070838,    0.3183266056,    0.9896244108,    0.1728500574]    fk: 53.1620018914       

	Parameter values: [0.68356162144931742, 0.92425187896660033, 5.6990199297785082, 0.32403176981087212, 0.98959406964125973, 0.17113814804983962]
	Function value:   53.085300975687723
	Iterations:       500
	Function calls:   789
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.6835616214,     0.924251879,      5.69901993,    0.3240317698,    0.9895940696,     0.171138148]    fk: 53.0857325922       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6835616214,     0.924251879,      5.69901993,    0.3240317698,    0.9895940696,     0.171138148]    fk: 53.085728276        
	k: 100      xk: [   0.6875874744,    0.9237711443,     5.614305426,    0.4083575182,    0.9893386261,    0.1670801026]    fk: 51.9854921604       
	k: 200      xk: [   0.6845323345,    0.9203203547,     5.640149732,    0.4100685211,    0.9893932603,    0.1686550735]    fk: 51.8079308381       
	k: 300      xk: [   0.6835801575,    0.9184034229,     5.639293366,    0.4097225629,    0.9893959775,    0.1695778763]    fk: 51.7518966982       
	k: 400      xk: [   0.6839385464,    0.9165167453,     5.636878492,    0.4091242596,    0.9894133215,    0.1710668411]    fk: 51.7167624759       

	Parameter values: [0.68308486033335925, 0.91501902493976672, 5.6463621101552164, 0.41008069301905692, 0.98942555887329275, 0.17140143879545844]
	Function value:   51.704127423902982
	Iterations:       500
	Function calls:   803
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.6830848603,    0.9150190249,      5.64636211,     0.410080693,    0.9894255589,    0.1714014388]    fk: 51.7041319733       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6830848603,    0.9150190249,      5.64636211,     0.410080693,    0.9894255589,    0.1714014388]    fk: 51.7041319278       
	k: 100      xk: [    0.683447563,    0.9153758875,     5.641583291,    0.4100890957,    0.9894211857,    0.1714367544]    fk: 51.7020524213       
	k: 200      xk: [   0.6834447271,    0.9153151206,      5.64172193,    0.4100960685,    0.9894222562,    0.1714897899]    fk: 51.7019425568       
	k: 300      xk: [   0.6834436687,    0.9153142325,     5.641726563,    0.4100960699,    0.9894222527,    0.1714897688]    fk: 51.7019425086       
	k: 400      xk: [   0.6834435804,    0.9153141929,     5.641726502,    0.4100960699,    0.9894222521,    0.1714897868]    fk: 51.7019425084       

	Parameter values: [0.68344358041928266, 0.91531419294046135, 5.6417265021303669, 0.41009606994948522, 0.98942225211837509, 0.17148978677012686]
	Function value:   51.701942508368518
	Iterations:       451
	Function calls:   898
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [   0.6834435804,    0.9153141929,     5.641726502,    0.4100960699,    0.9894222521,    0.1714897868]    fk: 51.7019425539       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834435804,    0.9153141929,     5.641726502,    0.4100960699,    0.9894222521,    0.1714897868]    fk: 51.7019425534       
	k: 100      xk: [   0.6834435804,    0.9153141929,     5.641726502,    0.4100960699,    0.9894222521,    0.1714897868]    fk: 51.7019425534       
	k: 200      xk: [   0.6834409342,    0.9153116029,     5.641726374,    0.4100960747,    0.9894222595,    0.1714910764]    fk: 51.7019424216       
	k: 300      xk: [   0.6834412635,     0.915308259,     5.641726887,    0.4100960847,    0.9894222919,    0.1714933719]    fk: 51.7019423211       
	k: 400      xk: [   0.6834412044,    0.9153076874,     5.641726957,    0.4100960864,    0.9894222974,    0.1714937718]    fk: 51.7019423183       

	Parameter values: [0.68344120436433031, 0.91530768734531964, 5.6417269569076245, 0.41009608644829088, 0.98942229739264187, 0.17149377181681821]
	Function value:   51.701942318339512
	Iterations:       478
	Function calls:   972
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.6834412044,    0.9153076873,     5.641726957,    0.4100960864,    0.9894222974,    0.1714937718]    fk: 51.7019423188       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834412044,    0.9153076873,     5.641726957,    0.4100960864,    0.9894222974,    0.1714937718]    fk: 51.7019423188       
	k: 100      xk: [   0.6834412044,    0.9153076873,     5.641726957,    0.4100960864,    0.9894222974,    0.1714937718]    fk: 51.7019423188       
	k: 200      xk: [   0.6834412476,    0.9153077985,      5.64172693,     0.410096085,    0.9894222929,     0.171493477]    fk: 51.7019423142       
	k: 300      xk: [   0.6834411399,    0.9153074919,     5.641726952,    0.4100960859,    0.9894222956,     0.171493662]    fk: 51.7019423121       

	Parameter values: [0.68344113994619948, 0.91530749186158167, 5.6417269518129221, 0.41009608594426927, 0.98942229555120287, 0.17149366200103613]
	Function value:   51.701942312064389
	Iterations:       395
	Function calls:   809
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.6834411399,    0.9153074919,     5.641726952,    0.4100960859,    0.9894222956,     0.171493662]    fk: 51.7019423121       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834411399,    0.9153074919,     5.641726952,    0.4100960859,    0.9894222956,     0.171493662]    fk: 51.7019423121       
	k: 100      xk: [   0.6834411399,    0.9153074919,     5.641726952,    0.4100960859,    0.9894222956,     0.171493662]    fk: 51.7019423121       
	k: 200      xk: [   0.6834412639,    0.9153085258,      5.64172687,    0.4100960846,    0.9894222961,    0.1714932246]    fk: 51.7019423022       
	k: 300      xk: [   0.6834413362,    0.9153087943,     5.641726853,    0.4100960842,    0.9894222962,      0.17149309]    fk: 51.7019423014       

	Parameter values: [0.68344133619293967, 0.91530879430240986, 5.6417268534596303, 0.41009608415691523, 0.98942229620439592, 0.17149308998006701]
	Function value:   51.701942301417965
	Iterations:       344
	Function calls:   726
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.6834413362,    0.9153087943,     5.641726853,    0.4100960842,    0.9894222962,      0.17149309]    fk: 51.7019423014       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834413362,    0.9153087943,     5.641726853,    0.4100960842,    0.9894222962,      0.17149309]    fk: 51.7019423014       
	k: 100      xk: [   0.6834413362,    0.9153087943,     5.641726853,    0.4100960842,    0.9894222962,      0.17149309]    fk: 51.7019423014       
	k: 200      xk: [   0.6834413492,    0.9153088314,     5.641726863,    0.4100960848,    0.9894223003,    0.1714931782]    fk: 51.7019423003       
	k: 300      xk: [   0.6834413722,    0.9153088451,     5.641726867,    0.4100960848,     0.989422301,    0.1714931858]    fk: 51.7019423          

	Parameter values: [0.68344137219777634, 0.91530884509187649, 5.6417268670595533, 0.41009608484906224, 0.98942230097160055, 0.17149318576106382]
	Function value:   51.701942299978967
	Iterations:       335
	Function calls:   718
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.6834413722,    0.9153088451,     5.641726867,    0.4100960848,     0.989422301,    0.1714931858]    fk: 51.7019423          
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834413722,    0.9153088451,     5.641726867,    0.4100960848,     0.989422301,    0.1714931858]    fk: 51.7019423          
	k: 100      xk: [   0.6834413722,    0.9153088451,     5.641726867,    0.4100960848,     0.989422301,    0.1714931858]    fk: 51.7019423          
	k: 200      xk: [   0.6834413722,    0.9153088451,     5.641726867,    0.4100960848,     0.989422301,    0.1714931858]    fk: 51.7019423          
	k: 300      xk: [   0.6834413567,     0.915308863,     5.641726866,    0.4100960851,    0.9894223023,    0.1714932228]    fk: 51.7019422999       

	Parameter values: [0.68344135666540429, 0.91530886298940495, 5.641726866158244, 0.41009608507544815, 0.98942230228518357, 0.17149322277116608]
	Function value:   51.701942299880393
	Iterations:       337
	Function calls:   741
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.6834413567,     0.915308863,     5.641726866,    0.4100960851,    0.9894223023,    0.1714932228]    fk: 51.7019422999       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834413567,     0.915308863,     5.641726866,    0.4100960851,    0.9894223023,    0.1714932228]    fk: 51.7019422999       
	k: 100      xk: [   0.6834413567,     0.915308863,     5.641726866,    0.4100960851,    0.9894223023,    0.1714932228]    fk: 51.7019422999       
	k: 200      xk: [   0.6834413567,     0.915308863,     5.641726866,    0.4100960851,    0.9894223023,    0.1714932228]    fk: 51.7019422999       
	k: 300      xk: [    0.683441335,    0.9153088403,     5.641726865,    0.4100960851,    0.9894223021,    0.1714932311]    fk: 51.7019422998       

	Parameter values: [0.68344133498071269, 0.91530884031109805, 5.6417268651973682, 0.41009608508524081, 0.98942230207088611, 0.17149323113595463]
	Function value:   51.701942299825497
	Iterations:       338
	Function calls:   739
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    0.683441335,    0.9153088403,     5.641726865,    0.4100960851,    0.9894223021,    0.1714932311]    fk: 51.7019422998       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.683441335,    0.9153088403,     5.641726865,    0.4100960851,    0.9894223021,    0.1714932311]    fk: 51.7019422998       
	k: 100      xk: [    0.683441335,    0.9153088403,     5.641726865,    0.4100960851,    0.9894223021,    0.1714932311]    fk: 51.7019422998       
	k: 200      xk: [   0.6834414251,    0.9153085778,      5.64172691,    0.4100960856,     0.989422303,    0.1714933831]    fk: 51.7019422987       
	k: 300      xk: [   0.6834414436,    0.9153085724,     5.641726914,    0.4100960857,    0.9894223031,    0.1714933893]    fk: 51.7019422986       

	Parameter values: [0.68344144356685299, 0.91530857236519481, 5.6417269138872541, 0.41009608567494549, 0.98942230313733481, 0.17149338934048891]
	Function value:   51.701942298633341
	Iterations:       335
	Function calls:   732
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [   0.6834414436,    0.9153085724,     5.641726914,    0.4100960857,    0.9894223031,    0.1714933893]    fk: 51.7019422986       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834414436,    0.9153085724,     5.641726914,    0.4100960857,    0.9894223031,    0.1714933893]    fk: 51.7019422986       
	k: 100      xk: [   0.6834414436,    0.9153085724,     5.641726914,    0.4100960857,    0.9894223031,    0.1714933893]    fk: 51.7019422986       
	k: 200      xk: [   0.6834414436,    0.9153085724,     5.641726914,    0.4100960857,    0.9894223031,    0.1714933893]    fk: 51.7019422986       
	k: 300      xk: [   0.6834414826,    0.9153086362,     5.641726915,    0.4100960857,    0.9894223036,    0.1714933757]    fk: 51.7019422986       

	Parameter values: [0.68344148255069004, 0.91530863618114555, 5.6417269150326028, 0.41009608566702271, 0.98942230358236083, 0.17149337567715844]
	Function value:   51.701942298548246
	Iterations:       328
	Function calls:   708
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [   0.6834414826,    0.9153086362,     5.641726915,    0.4100960857,    0.9894223036,    0.1714933757]    fk: 51.7019422986       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834414826,    0.9153086362,     5.641726915,    0.4100960857,    0.9894223036,    0.1714933757]    fk: 51.7019422985       
	k: 100      xk: [   0.6834414826,    0.9153086362,     5.641726915,    0.4100960857,    0.9894223036,    0.1714933757]    fk: 51.7019422985       
	k: 200      xk: [   0.6834414826,    0.9153086362,     5.641726915,    0.4100960857,    0.9894223036,    0.1714933757]    fk: 51.7019422985       
	k: 300      xk: [    0.683441474,    0.9153086631,     5.641726913,    0.4100960857,    0.9894223041,    0.1714933799]    fk: 51.7019422985       

	Parameter values: [0.68344147400545308, 0.91530866312231918, 5.6417269125088225, 0.4100960857212575, 0.98942230406004483, 0.17149337994882363]
	Function value:   51.701942298486209
	Iterations:       345
	Function calls:   752
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    0.683441474,    0.9153086631,     5.641726913,    0.4100960857,    0.9894223041,    0.1714933799]    fk: 51.7019422985       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.683441474,    0.9153086631,     5.641726913,    0.4100960857,    0.9894223041,    0.1714933799]    fk: 51.7019422985       
	k: 100      xk: [    0.683441474,    0.9153086631,     5.641726913,    0.4100960857,    0.9894223041,    0.1714933799]    fk: 51.7019422985       
	k: 200      xk: [    0.683441474,    0.9153086631,     5.641726913,    0.4100960857,    0.9894223041,    0.1714933799]    fk: 51.7019422985       
	k: 300      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       

	Parameter values: [0.68344146676148054, 0.9153086381855049, 5.6417269140899577, 0.41009608575396411, 0.98942230397240039, 0.17149339223378013]
	Function value:   51.701942298453794
	Iterations:       333
	Function calls:   724
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       
	k: 100      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       
	k: 200      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       
	k: 300      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       

	Parameter values: [0.68344146676148498, 0.91530863818550268, 5.6417269140899586, 0.41009608575396406, 0.98942230397240039, 0.17149339223378013]
	Function value:   51.701942298452892
	Iterations:       326
	Function calls:   706
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 15       xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       
	k: 100      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       
	k: 200      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       
	k: 300      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422984       

	Parameter values: [0.68344146675757922, 0.9153086381933434, 5.6417269140892188, 0.41009608575399192, 0.98942230397260655, 0.17149339223711929]
	Function value:   51.701942298449374
	Iterations:       308
	Function calls:   689
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 16       xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422984       
	k: 100      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422984       
	k: 200      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422984       
	k: 300      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422984       

	Parameter values: [0.68344146675756157, 0.91530863819334174, 5.641726914089217, 0.41009608575399192, 0.98942230397260655, 0.17149339223712307]
	Function value:   51.701942298446646
	Iterations:       334
	Function calls:   715
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 17       xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422985       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422984       
	k: 100      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422984       
	k: 200      xk: [   0.6834414668,    0.9153086382,     5.641726914,    0.4100960858,     0.989422304,    0.1714933922]    fk: 51.7019422984       
	k: 300      xk: [   0.6834414763,     0.915308642,     5.641726915,    0.4100960858,     0.989422304,    0.1714933915]    fk: 51.7019422984       

	Parameter values: [0.68344147634129304, 0.91530864202702256, 5.641726915352633, 0.4100960857550181, 0.98942230401686748, 0.17149339147136822]
	Function value:   51.701942298443349
	Iterations:       330
	Function calls:   731
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 18       xk: [   0.6834414763,     0.915308642,     5.641726915,    0.4100960858,     0.989422304,    0.1714933915]    fk: 51.7019422984       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.6834414763,     0.915308642,     5.641726915,    0.4100960858,     0.989422304,    0.1714933915]    fk: 51.7019422984       
	k: 100      xk: [   0.6834414763,     0.915308642,     5.641726915,    0.4100960858,     0.989422304,    0.1714933915]    fk: 51.7019422984       
	k: 200      xk: [   0.6834414763,     0.915308642,     5.641726915,    0.4100960858,     0.989422304,    0.1714933915]    fk: 51.7019422984       
	k: 300      xk: [   0.6834414763,     0.915308642,     5.641726915,    0.4100960858,     0.989422304,    0.1714933915]    fk: 51.7019422984       

	Parameter values: [0.68344147634129304, 0.91530864202702256, 5.641726915352633, 0.4100960857550181, 0.98942230401686748, 0.17149339147136822]
	Function value:   51.701942298443349
	Iterations:       338
	Function calls:   740
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.68344147634129304, 0.91530864202702256, 5.641726915352633, 0.4100960857550181, 0.98942230401686748, 0.17149339147136822]
Function value:   51.701942298443349
Iterations:       7155
Function calls:   14481
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            6.834414763412930
r2 (800.000 MHz):            9.153086420270226
dw:                          5.641726915352633
dwH:                         0.410096085755018
pA:                          0.989422304016867
kex:                      1714.933914713682270


Fitting to the spin block [':71@N']
-----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [   0.4914578695,     13.78962054,     4.609868187,               0,    0.9967418326,    0.1773217477]    fk: 7.15198345787       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4914578695,     13.78962054,     4.609868187,         0.00025,    0.9967418326,    0.1773217477]    fk: 7.1811216991        
	k: 100      xk: [   0.4985298585,     13.80593386,     4.561362804, 0.0002239565366,     0.996787872,    0.1845645061]    fk: 5.51454353161       
	k: 200      xk: [   0.4980149427,     12.65432392,     4.379840702, 0.0005533483556,    0.9965619821,    0.1904251166]    fk: 5.50577209438       
	k: 300      xk: [   0.4980805667,     6.515802934,     4.500936779,  0.001981611886,    0.9967129124,    0.1875707929]    fk: 5.49184953212       
	k: 400      xk: [   0.4982295332,     5.647386293,     4.505976167,  0.002175424284,    0.9967210137,    0.1869811763]    fk: 5.49145132092       

	Parameter values: [0.49805889181302909, 6.0428804317901132, 4.5073048846894395, 0.0022156735701433731, 0.9967175096797507, 0.18771946097930892]
	Function value:   5.4911539234329529
	Iterations:       500
	Function calls:   781
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.4980588918,     6.042880432,     4.507304885,   0.00221567357,    0.9967175097,     0.187719461]    fk: 5.48422925452       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4980588918,     6.042880432,     4.507304885,  0.002326457249,    0.9967175097,     0.187719461]    fk: 5.48429361743       
	k: 100      xk: [   0.4983392625,     6.805175115,     4.528321282,  0.003585313474,    0.9967495185,     0.186017138]    fk: 5.48385770159       
	k: 200      xk: [   0.4983140212,     12.18242735,     4.530401058,  0.005185603502,    0.9967509862,    0.1860467682]    fk: 5.48381372721       
	k: 300      xk: [   0.4981838346,     10.72104256,     4.510510075,    0.0783569531,    0.9967255104,    0.1867051133]    fk: 5.48334382462       
	k: 400      xk: [   0.4974126783,     6.822492454,     4.604602188,     0.274469757,    0.9968231575,    0.1826258082]    fk: 5.48105230312       

	Parameter values: [0.49179108014812134, 9.7697709742595826, 4.4594438875520055, 0.64299855183926624, 0.99658576896050688, 0.18165322171883147]
	Function value:   5.4655072263404492
	Iterations:       500
	Function calls:   765
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [   0.4917910801,     9.769770974,     4.459443888,    0.6429985518,     0.996585769,    0.1816532217]    fk: 5.46797684972       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4917910801,     9.769770974,     4.459443888,    0.6429985518,     0.996585769,    0.1816532217]    fk: 5.46601520882       
	k: 100      xk: [   0.4915025353,     9.755252447,     4.495102793,    0.6430353061,    0.9966174533,    0.1808697117]    fk: 5.4639626257        
	k: 200      xk: [   0.4916026816,     8.714827816,     4.542542701,    0.6430995879,    0.9966713054,    0.1797306617]    fk: 5.46360653513       
	k: 300      xk: [   0.4916076084,      4.42385728,     4.543483506,    0.6431222733,    0.9966724329,    0.1796812009]    fk: 5.46360568298       
	k: 400      xk: [   0.4916019397,     2.462183267,      4.54247201,    0.6431307482,    0.9966712188,    0.1797319128]    fk: 5.463605176         

	Parameter values: [0.49160197330170285, 2.4649127597446743, 4.5424738074888129, 0.64313073766219853, 0.99667122163589461, 0.17973179219383473]
	Function value:   5.4636051759944353
	Iterations:       500
	Function calls:   901
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.4916019733,      2.46491276,     4.542473807,    0.6431307377,    0.9966712216,    0.1797317922]    fk: 5.46360945134       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4916019733,     2.588158398,     4.542473807,    0.6431307377,    0.9966712216,    0.1797317922]    fk: 5.46360940816       
	k: 100      xk: [   0.4916040716,     2.647619647,     4.542937035,    0.6431321169,    0.9966717723,    0.1797151012]    fk: 5.4636093809        
	k: 200      xk: [   0.4916026785,     19.68817346,     4.542452208,    0.6431379059,    0.9966712121,    0.1797271438]    fk: 5.46360893778       
	k: 300      xk: [   0.4916019652,     19.52543424,     4.543658614,    0.6431447317,    0.9966725032,     0.179700619]    fk: 5.46360876727       
	k: 400      xk: [   0.4916223974,     3.750600314,      4.54554046,    0.6432799617,    0.9966750442,    0.1795631137]    fk: 5.4636019513        

	Parameter values: [0.49163866931693812, 19.452216731039826, 4.5481919441167253, 0.64345193227542063, 0.99667820355504988, 0.17943384366513193]
	Function value:   5.4635965599031486
	Iterations:       500
	Function calls:   801
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [   0.4916386693,     19.45221673,     4.548191944,    0.6434519323,    0.9966782036,    0.1794338437]    fk: 5.46359711048       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4916386693,     19.45221673,     4.548191944,    0.6434519323,    0.9966782036,    0.1794338437]    fk: 5.46359658835       
	k: 100      xk: [   0.4915931225,     19.45211337,       4.5422122,    0.6434612063,    0.9966708077,    0.1797276719]    fk: 5.46358645096       
	k: 200      xk: [    0.491573298,     19.44762301,      4.54004902,    0.6435341425,    0.9966679786,    0.1798303268]    fk: 5.46358255081       
	k: 300      xk: [   0.4911729739,     18.49904731,     4.541910892,    0.6584104768,    0.9966629681,    0.1795807131]    fk: 5.46259818193       
	k: 400      xk: [     0.49128438,     18.49739192,     4.546424253,    0.6584288701,    0.9966709581,    0.1792396363]    fk: 5.46252874425       

	Parameter values: [0.49127588930007904, 18.497328528108419, 4.5458540082251506, 0.65843126098353855, 0.99667012711023295, 0.17931874699670158]
	Function value:   5.4625270803766606
	Iterations:       500
	Function calls:   810
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 5        xk: [   0.4912758893,     18.49732853,     4.545854008,     0.658431261,    0.9966701271,     0.179318747]    fk: 5.46252714246       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912758893,     18.49732853,     4.545854008,     0.658431261,    0.9966701271,     0.179318747]    fk: 5.46252708076       
	k: 100      xk: [   0.4912725962,     18.95929812,     4.545854048,    0.6584312296,     0.996670117,    0.1793289468]    fk: 5.46252537095       
	k: 200      xk: [   0.4912709355,     18.95868925,     4.545854053,    0.6584313131,    0.9966702376,    0.1793300119]    fk: 5.46252380381       
	k: 300      xk: [   0.4912709591,     19.99357428,     4.545854019,    0.6584313335,     0.996670239,    0.1793298941]    fk: 5.46252380238       
	k: 400      xk: [   0.4912709591,     19.99357364,     4.545854019,    0.6584313335,     0.996670239,    0.1793298941]    fk: 5.46252380238       

	Parameter values: [0.4912709591479007, 19.993573643095516, 4.5458540190012631, 0.65843133354918093, 0.99667023901849239, 0.17932989411350481]
	Function value:   5.4625238023794358
	Iterations:       403
	Function calls:   903
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.4912709591,     19.99357364,     4.545854019,    0.6584313335,     0.996670239,    0.1793298941]    fk: 5.46252380238       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912709591,     19.99357364,     4.545854019,    0.6584313335,     0.996670239,    0.1793298941]    fk: 5.46252380238       
	k: 100      xk: [   0.4912705498,     19.99368577,     4.545853557,    0.6584315479,     0.996670228,    0.1793313811]    fk: 5.46252378662       
	k: 200      xk: [    0.491270339,      19.9931643,     4.545853504,    0.6584315629,    0.9966702218,    0.1793322115]    fk: 5.46252378624       

	Parameter values: [0.49127033897946737, 19.993164300384215, 4.5458535039023715, 0.65843156294557392, 0.99667022183496501, 0.17933221152109535]
	Function value:   5.4625237862372362
	Iterations:       259
	Function calls:   651
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    0.491270339,      19.9931643,     4.545853504,    0.6584315629,    0.9966702218,    0.1793322115]    fk: 5.46252378625       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    0.491270339,      19.9931643,     4.545853504,    0.6584315629,    0.9966702218,    0.1793322115]    fk: 5.46252378624       
	k: 100      xk: [    0.491270339,      19.9931643,     4.545853504,    0.6584315629,    0.9966702218,    0.1793322115]    fk: 5.46252378624       
	k: 200      xk: [   0.4912703121,     19.99309294,       4.5458535,    0.6584315649,    0.9966702216,    0.1793323317]    fk: 5.4625237862        

	Parameter values: [0.49127031207132082, 19.993092938037066, 4.5458535001063716, 0.65843156493034027, 0.99667022159589558, 0.17933233168843946]
	Function value:   5.4625237862009888
	Iterations:       263
	Function calls:   738
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.4912703121,     19.99309294,       4.5458535,    0.6584315649,    0.9966702216,    0.1793323317]    fk: 5.4625237862        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912703121,     19.99309294,       4.5458535,    0.6584315649,    0.9966702216,    0.1793323317]    fk: 5.4625237862        
	k: 100      xk: [   0.4912703121,     19.99309294,       4.5458535,    0.6584315649,    0.9966702216,    0.1793323317]    fk: 5.4625237862        
	k: 200      xk: [   0.4912703121,     19.99309294,       4.5458535,    0.6584315649,    0.9966702216,    0.1793323317]    fk: 5.4625237862        

	Parameter values: [0.49127031207132082, 19.993092938037066, 4.5458535001063716, 0.65843156493034027, 0.99667022159589558, 0.17933233168843946]
	Function value:   5.4625237862009879
	Iterations:       235
	Function calls:   606
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [   0.4912703121,     19.99309294,       4.5458535,    0.6584315649,    0.9966702216,    0.1793323317]    fk: 5.46252378621       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.4912703121,     19.99309294,       4.5458535,    0.6584315649,    0.9966702216,    0.1793323317]    fk: 5.4625237862        
	k: 100      xk: [   0.4912703121,     19.99309294,       4.5458535,    0.6584315649,    0.9966702216,    0.1793323317]    fk: 5.4625237862        
	k: 200      xk: [   0.4912703121,     19.99309294,       4.5458535,    0.6584315649,    0.9966702216,    0.1793323317]    fk: 5.4625237862        

	Parameter values: [0.49127031207132082, 19.993092938037066, 4.5458535001063716, 0.65843156493034027, 0.99667022159589558, 0.17933233168843946]
	Function value:   5.4625237862009879
	Iterations:       235
	Function calls:   606
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.49127031207132082, 19.993092938037066, 4.5458535001063716, 0.65843156493034027, 0.99667022159589558, 0.17933233168843946]
Function value:   5.4625237862009879
Iterations:       3895
Function calls:   7562
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (500.000 MHz):            4.912703120713208
r2 (800.000 MHz):          199.930929380370657
dw:                          4.545853500106372
dwH:                         0.658431564930340
pA:                          0.996670221595896
kex:                      1793.323316884394671

relax> relax_disp.plot_disp_curves(dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/disp_70_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/disp_71_N.agr' for writing.
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/dw.agr' for writing.

relax> value.write(param='dwH', file='dwH.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/dwH.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dwH', spin_id=None, plot_data='value', file='dwH.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/dwH.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/k_AB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', force=True, norm=False)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/chi2.agr' for writing.

relax> results.write(file='results', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72', compress_type=1, force=True)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Hansen/relax_results/MQ CR72/results.bz2' for writing.

