


                                  relax repository checkout r26130
                            svn+ssh://bugman@svn.gna.org/svn/relax/trunk

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2014 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'base_system.py'
----------------------------------------------------------------------------------------------------
# Python module imports.
from numpy import array, cross, float64, transpose
from numpy.linalg import inv, norm
import sys

# relax module imports.
from lib.text.sectioning import title


# The paramagnetic centre in the 1J7O_1st_NH.pdb file.
centre = array([35.934, 12.194, -4.206], float64)

# Calculate and store the C-domain centre of mass.
pipe.create('C-dom', 'N-state')
structure.read_pdb('1J7P_1st_NH.pdb', dir='../cam')
structure.com()
c_com = cdp.com

# Create a new data pipe for building the base system.
pipe.create('base system', 'N-state')

# Load both domains.
structure.read_pdb('1J7O_1st_NH.pdb', dir='../cam', set_mol_name='N-dom')
structure.read_pdb('1J7P_1st_NH.pdb', dir='../cam', set_mol_name='C-dom')

# The paramagnetic centre-CoM distance.
dist = norm(c_com - centre)

# The frame of the CoM system.
z_ax = (c_com - centre) / dist
x_ax = array([1, 0, 0], float64)
y_ax = cross(z_ax, x_ax)
y_ax /= norm(y_ax)
R = transpose(array([x_ax, y_ax, z_ax], float64))

# Translate the paramagnetic centre to the origin.
structure.translate(T=-centre)

# Inverted frame rotation.
structure.rotate(R=inv(R))

# Add atoms for the CoMs.
structure.add_atom(atom_name='N', res_name='COM', res_num=1, chain_id='A', pos=[0., 0., 0.], element='Ti', pdb_record='HETATM')
structure.add_atom(atom_name='C', res_name='COM', res_num=1, chain_id='B', pos=[0., 0., dist], element='Ti', pdb_record='HETATM')

# Write out the final structure.
structure.write_pdb('base_system.pdb', force=True)

# The new CoM.
structure.com(atom_id="#C-dom")
c_com_new = cdp.com

# The new paramagnetic centre.
structure.load_spins(spin_id="#N-dom:1001")
centre_new = cdp.mol[0].res[0].spin[0].pos

# Printout.
title(file=sys.stdout, text="The base system")
print("The original system:\n")
print("%-25s %-70s" % ("Paramagnetic centre:", centre))
print("%-25s %-70s" % ("C-domain CoM:", c_com))
print("%-25s %-70s" % ("Inter-CoM distance:", dist))
print("%s\n%s" % ("R:", R))
print("\nThe new system:\n")
print("%-25s %-70s" % ("Paramagnetic centre:", centre_new))
print("%-25s %-70s" % ("C-domain CoM:", c_com_new))
print("%-25s %-70s" % ("Inter-CoM distance:", norm(c_com_new - centre_new)))
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='C-dom', pipe_type='N-state', bundle=None)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='../cam', read_mol=None, set_mol_name=None, read_model=None, set_model_num=None, alt_loc=None, verbosity=1, merge=False)

Internal relax PDB parser.
Opening the file '../cam/1J7P_1st_NH.pdb' for reading.
Adding molecule '1J7P_1st_NH_mol1' to model None (from the original molecule number 1 of model None)

relax> structure.com(model=None, atom_id=None)
Calculating the centre of mass.
    Total mass:      M = 1085.1416349999979
    Centre of mass:  R = array([ 26.836780092125995, -12.379059385266354,  28.341544813714616])

relax> pipe.create(pipe_name='base system', pipe_type='N-state', bundle=None)

relax> structure.read_pdb(file='1J7O_1st_NH.pdb', dir='../cam', read_mol=None, set_mol_name='N-dom', read_model=None, set_model_num=None, alt_loc=None, verbosity=1, merge=False)

Internal relax PDB parser.
Opening the file '../cam/1J7O_1st_NH.pdb' for reading.
Adding molecule 'N-dom' to model None (from the original molecule number 1 of model None)

relax> structure.read_pdb(file='1J7P_1st_NH.pdb', dir='../cam', read_mol=None, set_mol_name='C-dom', read_model=None, set_model_num=None, alt_loc=None, verbosity=1, merge=False)

Internal relax PDB parser.
Opening the file '../cam/1J7P_1st_NH.pdb' for reading.
Adding molecule 'C-dom' to model None (from the original molecule number 1 of model None)

relax> structure.translate(T=array([-35.933999999999997, -12.194000000000001,   4.206            ]), model=None, atom_id=None)

relax> structure.rotate(R=array([[ 1.               , -0.134409266874454,  0.178027960148821],
       [ 0.               ,  0.79808450348444 ,  0.60254553794547 ],
       [ 0.               , -0.617354822059181,  0.817699718293185]]), origin=None, model=None, atom_id=None)

relax> structure.add_atom(atom_name='N', res_name='COM', res_num=1, pos=[0.0, 0.0, 0.0], element='Ti', atom_num=None, chain_id='A', segment_id=None, pdb_record='HETATM')

relax> structure.add_atom(atom_name='C', res_name='COM', res_num=1, pos=[0.0, 0.0, 41.784414929550074], element='Ti', atom_num=None, chain_id='B', segment_id=None, pdb_record='HETATM')

relax> structure.write_pdb(file='base_system.pdb', dir=None, model_num=None, compress_type=0, force=True)
Opening the file 'base_system.pdb' for writing.

Creating the PDB records

REMARK
HET
HETNAM
FORMUL
ATOM, HETATM, TER
ATOM, HETATM, TER
ATOM, HETATM, TER
CONECT

MASTER
END

relax> structure.com(model=None, atom_id='#C-dom')
Calculating the centre of mass.
    Total mass:      M = 1085.1416349999979
    Centre of mass:  R = array([ -6.016234605323030e-14,  -7.647977817824663e-15,
         4.178441492955009e+01])

relax> structure.load_spins(spin_id='#N-dom:1001', mol_name_target=None, ave_pos=True)
Adding the following spins to the relax data store.

# mol_name    res_num    res_name    spin_num    spin_name    
N-dom         1001       CA          153         CA           


===================
= The base system =
===================

The original system:

Paramagnetic centre:      [ 35.933999999999997  12.194000000000001  -4.206            ]         
C-domain CoM:             [ 26.836780092125995 -12.379059385266354  28.341544813714616]         
Inter-CoM distance:       41.7844149296                                                         
R:
[[ 1.                -0.                -0.217718015753295]
 [ 0.                 0.79808450348444  -0.58809150317642 ]
 [ 0.                 0.60254553794547   0.778939824060978]]

The new system:

Paramagnetic centre:      [ 0.  0.  0.]                                                         
C-domain CoM:             [ -6.016234605323030e-14  -7.647977817824663e-15   4.178441492955009e+01]
Inter-CoM distance:       41.7844149296                                                         

