


                                  relax repository checkout r21156
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'r2eff_calc.py'
----------------------------------------------------------------------------------------------------
# Script for generating a save file of the R2eff fitted model.

# Python module imports.
from os import sep

# relax module imports.
from auto_analyses.relax_disp import Relax_disp
from data_store import Relax_data_store; ds = Relax_data_store()
from status import Status; status = Status()


# Analysis variables.
#####################

# The dispersion models.
MODELS = ['R2eff']

# The grid search size (the number of increments per dimension).
GRID_INC = 10

# The number of Monte Carlo simulations to be used for error analysis at the end of the analysis.
MC_NUM = 500


# Set up the data pipe.
#######################

# Create the data pipe.
pipe_name = 'base pipe'
pipe_bundle = 'relax_disp'
pipe.create(pipe_name=pipe_name, bundle=pipe_bundle, pipe_type='relax_disp')

# The path to the data files.
data_path = status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'r1rho_on_res_m61'

# Create the sequence data.
spin.create(res_name='Trp', res_num=1, spin_name='N')
spin.create(res_name='Trp', res_num=2, spin_name='N')

# Set the isotope information.
spin.isotope(isotope='15N')

# The spectral data - spectrum ID, peak lists, offset frequency (Hz), relaxation time period (s), baseplane RMSD estimate.
data = []
times = [0.00, 0.01, 0.02, 0.04, 0.06, 0.08, 0.1, 0.12, 0.15]
ncyc = [1, 2, 3, 4, 5, 6, 7, 8, 9]
spin_lock = [1000, 1500, 2000, 2500, 3000, 3500, 4000, 4500, 5000, 5500, 6000]
for spin_lock_index in range(len(spin_lock)):
    for time_index in range(len(times)):
        data.append(["nu_%s_ncyc%s" % (spin_lock[spin_lock_index], ncyc[time_index]), "nu_%s_ncyc%s.list" % (spin_lock[spin_lock_index], ncyc[time_index]), spin_lock[spin_lock_index], times[time_index], 200000.0])


# Loop over the spectral data, loading it and setting the metadata.
for i in range(len(data)):
    # Load the peak intensities and set the errors.
    spectrum.read_intensities(file=data[i][1], dir=data_path, spectrum_id=data[i][0], int_method='height')
    spectrum.baseplane_rmsd(spectrum_id=data[i][0], error=data[i][4])

    # Set the relaxation dispersion experiment type.
    relax_disp.exp_type(spectrum_id=data[i][0], exp_type='R1rho')

    # Set the relaxation dispersion spin-lock field strength (nu1).
    relax_disp.spin_lock_field(spectrum_id=data[i][0], field=data[i][2])

    # Set the spin-lock offset.
    relax_disp.spin_lock_offset(spectrum_id=data[i][0], offset=115.0)

    # Set the relaxation times.
    relax_disp.relax_time(spectrum_id=data[i][0], time=data[i][3])

    # Set the spectrometer frequency.
    spectrometer.frequency(id=data[i][0], frq=800, units='MHz')

# Read the chemical shift data.
chemical_shift.read(file="nu_%s_ncyc1.list" % spin_lock[0], dir=data_path)



# Auto-analysis execution.
##########################

# Do not change!
Relax_disp(pipe_name=pipe_name, pipe_bundle=pipe_bundle, results_dir='.', models=MODELS, grid_inc=GRID_INC, mc_sim_num=MC_NUM)

# Save the program state.
state.save('r2eff_values', force=True)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='base pipe', pipe_type='relax_disp', bundle='relax_disp')

relax> spin.create(spin_name='N', spin_num=None, res_name='Trp', res_num=1, mol_name=None)

relax> spin.create(spin_name='N', spin_num=None, res_name='Trp', res_num=2, mol_name=None)

relax> spin.isotope(isotope='15N', spin_id=None, force=False)

relax> spectrum.read_intensities(file='nu_1000_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1000_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1000_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1000_ncyc1', exp_type='R1rho')
Setting the 'nu_1000_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1000_ncyc1', field=1000)
Setting the 'nu_1000_ncyc1' spectrum spin-lock field strength to 1.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1000_ncyc1', offset=115.0)
Setting the 'nu_1000_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1000_ncyc1', time=0.0)
Setting the 'nu_1000_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_1000_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1000_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1000_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         96466265.0    
:2@N         14906912.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1000_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1000_ncyc2', exp_type='R1rho')
Setting the 'nu_1000_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1000_ncyc2', field=1000)
Setting the 'nu_1000_ncyc2' spectrum spin-lock field strength to 1.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1000_ncyc2', offset=115.0)
Setting the 'nu_1000_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1000_ncyc2', time=0.01)
Setting the 'nu_1000_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_1000_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1000_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1000_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         93057404.0    
:2@N         11110801.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1000_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1000_ncyc3', exp_type='R1rho')
Setting the 'nu_1000_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1000_ncyc3', field=1000)
Setting the 'nu_1000_ncyc3' spectrum spin-lock field strength to 1.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1000_ncyc3', offset=115.0)
Setting the 'nu_1000_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1000_ncyc3', time=0.02)
Setting the 'nu_1000_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_1000_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1000_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1000_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         86596805.0    
:2@N         6172495.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1000_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1000_ncyc4', exp_type='R1rho')
Setting the 'nu_1000_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1000_ncyc4', field=1000)
Setting the 'nu_1000_ncyc4' spectrum spin-lock field strength to 1.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1000_ncyc4', offset=115.0)
Setting the 'nu_1000_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1000_ncyc4', time=0.04)
Setting the 'nu_1000_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_1000_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1000_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1000_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         80584739.0    
:2@N         3429068.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1000_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1000_ncyc5', exp_type='R1rho')
Setting the 'nu_1000_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1000_ncyc5', field=1000)
Setting the 'nu_1000_ncyc5' spectrum spin-lock field strength to 1.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1000_ncyc5', offset=115.0)
Setting the 'nu_1000_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1000_ncyc5', time=0.06)
Setting the 'nu_1000_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_1000_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1000_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1000_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         74990066.0    
:2@N         1904985.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1000_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1000_ncyc6', exp_type='R1rho')
Setting the 'nu_1000_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1000_ncyc6', field=1000)
Setting the 'nu_1000_ncyc6' spectrum spin-lock field strength to 1.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1000_ncyc6', offset=115.0)
Setting the 'nu_1000_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1000_ncyc6', time=0.08)
Setting the 'nu_1000_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_1000_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1000_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1000_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         69783809.0    
:2@N         1058295.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1000_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1000_ncyc7', exp_type='R1rho')
Setting the 'nu_1000_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1000_ncyc7', field=1000)
Setting the 'nu_1000_ncyc7' spectrum spin-lock field strength to 1.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1000_ncyc7', offset=115.0)
Setting the 'nu_1000_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1000_ncyc7', time=0.1)
Setting the 'nu_1000_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_1000_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1000_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1000_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         64939001.0    
:2@N         587925.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1000_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1000_ncyc8', exp_type='R1rho')
Setting the 'nu_1000_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1000_ncyc8', field=1000)
Setting the 'nu_1000_ncyc8' spectrum spin-lock field strength to 1.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1000_ncyc8', offset=115.0)
Setting the 'nu_1000_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1000_ncyc8', time=0.12)
Setting the 'nu_1000_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_1000_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         58295094.0    
:2@N         243441.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1000_ncyc9', exp_type='R1rho')
Setting the 'nu_1000_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1000_ncyc9', field=1000)
Setting the 'nu_1000_ncyc9' spectrum spin-lock field strength to 1.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1000_ncyc9', offset=115.0)
Setting the 'nu_1000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1000_ncyc9', time=0.15)
Setting the 'nu_1000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_1000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1500_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1500_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1500_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1500_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1500_ncyc1', exp_type='R1rho')
Setting the 'nu_1500_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1500_ncyc1', field=1500)
Setting the 'nu_1500_ncyc1' spectrum spin-lock field strength to 1.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1500_ncyc1', offset=115.0)
Setting the 'nu_1500_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1500_ncyc1', time=0.0)
Setting the 'nu_1500_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_1500_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1500_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1500_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1500_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         97183130.0    
:2@N         15354983.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1500_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1500_ncyc2', exp_type='R1rho')
Setting the 'nu_1500_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1500_ncyc2', field=1500)
Setting the 'nu_1500_ncyc2' spectrum spin-lock field strength to 1.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1500_ncyc2', offset=115.0)
Setting the 'nu_1500_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1500_ncyc2', time=0.01)
Setting the 'nu_1500_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_1500_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1500_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1500_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1500_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         94445607.0    
:2@N         11788776.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1500_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1500_ncyc3', exp_type='R1rho')
Setting the 'nu_1500_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1500_ncyc3', field=1500)
Setting the 'nu_1500_ncyc3' spectrum spin-lock field strength to 1.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1500_ncyc3', offset=115.0)
Setting the 'nu_1500_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1500_ncyc3', time=0.02)
Setting the 'nu_1500_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_1500_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1500_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1500_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1500_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         89199728.0    
:2@N         6948762.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1500_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1500_ncyc4', exp_type='R1rho')
Setting the 'nu_1500_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1500_ncyc4', field=1500)
Setting the 'nu_1500_ncyc4' spectrum spin-lock field strength to 1.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1500_ncyc4', offset=115.0)
Setting the 'nu_1500_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1500_ncyc4', time=0.04)
Setting the 'nu_1500_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_1500_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1500_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1500_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1500_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         84245226.0    
:2@N         4095869.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1500_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1500_ncyc5', exp_type='R1rho')
Setting the 'nu_1500_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1500_ncyc5', field=1500)
Setting the 'nu_1500_ncyc5' spectrum spin-lock field strength to 1.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1500_ncyc5', offset=115.0)
Setting the 'nu_1500_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1500_ncyc5', time=0.06)
Setting the 'nu_1500_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_1500_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1500_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1500_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1500_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         79565915.0    
:2@N         2414264.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1500_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1500_ncyc6', exp_type='R1rho')
Setting the 'nu_1500_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1500_ncyc6', field=1500)
Setting the 'nu_1500_ncyc6' spectrum spin-lock field strength to 1.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1500_ncyc6', offset=115.0)
Setting the 'nu_1500_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1500_ncyc6', time=0.08)
Setting the 'nu_1500_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_1500_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1500_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1500_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1500_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         75146513.0    
:2@N         1423061.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1500_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1500_ncyc7', exp_type='R1rho')
Setting the 'nu_1500_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1500_ncyc7', field=1500)
Setting the 'nu_1500_ncyc7' spectrum spin-lock field strength to 1.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1500_ncyc7', offset=115.0)
Setting the 'nu_1500_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1500_ncyc7', time=0.1)
Setting the 'nu_1500_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_1500_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1500_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1500_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1500_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70972581.0    
:2@N         838807.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1500_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1500_ncyc8', exp_type='R1rho')
Setting the 'nu_1500_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1500_ncyc8', field=1500)
Setting the 'nu_1500_ncyc8' spectrum spin-lock field strength to 1.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1500_ncyc8', offset=115.0)
Setting the 'nu_1500_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1500_ncyc8', time=0.12)
Setting the 'nu_1500_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_1500_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_1500_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_1500_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1500_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         65142324.0    
:2@N         379594.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_1500_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_1500_ncyc9', exp_type='R1rho')
Setting the 'nu_1500_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_1500_ncyc9', field=1500)
Setting the 'nu_1500_ncyc9' spectrum spin-lock field strength to 1.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_1500_ncyc9', offset=115.0)
Setting the 'nu_1500_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_1500_ncyc9', time=0.15)
Setting the 'nu_1500_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_1500_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2000_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2000_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2000_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2000_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2000_ncyc1', exp_type='R1rho')
Setting the 'nu_2000_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2000_ncyc1', field=2000)
Setting the 'nu_2000_ncyc1' spectrum spin-lock field strength to 2.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2000_ncyc1', offset=115.0)
Setting the 'nu_2000_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2000_ncyc1', time=0.0)
Setting the 'nu_2000_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_2000_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2000_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2000_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2000_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         97440055.0    
:2@N         15518006.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2000_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2000_ncyc2', exp_type='R1rho')
Setting the 'nu_2000_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2000_ncyc2', field=2000)
Setting the 'nu_2000_ncyc2' spectrum spin-lock field strength to 2.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2000_ncyc2', offset=115.0)
Setting the 'nu_2000_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2000_ncyc2', time=0.01)
Setting the 'nu_2000_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_2000_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2000_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2000_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2000_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         94945644.0    
:2@N         12040425.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2000_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2000_ncyc3', exp_type='R1rho')
Setting the 'nu_2000_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2000_ncyc3', field=2000)
Setting the 'nu_2000_ncyc3' spectrum spin-lock field strength to 2.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2000_ncyc3', offset=115.0)
Setting the 'nu_2000_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2000_ncyc3', time=0.02)
Setting the 'nu_2000_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_2000_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2000_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2000_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2000_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         90146754.0    
:2@N         7248592.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2000_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2000_ncyc4', exp_type='R1rho')
Setting the 'nu_2000_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2000_ncyc4', field=2000)
Setting the 'nu_2000_ncyc4' spectrum spin-lock field strength to 2.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2000_ncyc4', offset=115.0)
Setting the 'nu_2000_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2000_ncyc4', time=0.04)
Setting the 'nu_2000_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_2000_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2000_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2000_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2000_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         85590417.0    
:2@N         4363807.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2000_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2000_ncyc5', exp_type='R1rho')
Setting the 'nu_2000_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2000_ncyc5', field=2000)
Setting the 'nu_2000_ncyc5' spectrum spin-lock field strength to 2.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2000_ncyc5', offset=115.0)
Setting the 'nu_2000_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2000_ncyc5', time=0.06)
Setting the 'nu_2000_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_2000_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2000_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2000_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2000_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         81264374.0    
:2@N         2627104.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2000_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2000_ncyc6', exp_type='R1rho')
Setting the 'nu_2000_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2000_ncyc6', field=2000)
Setting the 'nu_2000_ncyc6' spectrum spin-lock field strength to 2.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2000_ncyc6', offset=115.0)
Setting the 'nu_2000_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2000_ncyc6', time=0.08)
Setting the 'nu_2000_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_2000_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2000_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2000_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2000_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         77156984.0    
:2@N         1581573.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2000_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2000_ncyc7', exp_type='R1rho')
Setting the 'nu_2000_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2000_ncyc7', field=2000)
Setting the 'nu_2000_ncyc7' spectrum spin-lock field strength to 2.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2000_ncyc7', offset=115.0)
Setting the 'nu_2000_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2000_ncyc7', time=0.1)
Setting the 'nu_2000_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_2000_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2000_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2000_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2000_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         73257196.0    
:2@N         952140.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2000_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2000_ncyc8', exp_type='R1rho')
Setting the 'nu_2000_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2000_ncyc8', field=2000)
Setting the 'nu_2000_ncyc8' spectrum spin-lock field strength to 2.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2000_ncyc8', offset=115.0)
Setting the 'nu_2000_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2000_ncyc8', time=0.12)
Setting the 'nu_2000_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_2000_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         67773960.0    
:2@N         444752.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2000_ncyc9', exp_type='R1rho')
Setting the 'nu_2000_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2000_ncyc9', field=2000)
Setting the 'nu_2000_ncyc9' spectrum spin-lock field strength to 2.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2000_ncyc9', offset=115.0)
Setting the 'nu_2000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2000_ncyc9', time=0.15)
Setting the 'nu_2000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_2000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2500_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2500_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2500_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2500_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2500_ncyc1', exp_type='R1rho')
Setting the 'nu_2500_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2500_ncyc1', field=2500)
Setting the 'nu_2500_ncyc1' spectrum spin-lock field strength to 2.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2500_ncyc1', offset=115.0)
Setting the 'nu_2500_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2500_ncyc1', time=0.0)
Setting the 'nu_2500_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_2500_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2500_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2500_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2500_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         97560061.0    
:2@N         15594594.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2500_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2500_ncyc2', exp_type='R1rho')
Setting the 'nu_2500_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2500_ncyc2', field=2500)
Setting the 'nu_2500_ncyc2' spectrum spin-lock field strength to 2.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2500_ncyc2', offset=115.0)
Setting the 'nu_2500_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2500_ncyc2', time=0.01)
Setting the 'nu_2500_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_2500_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2500_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2500_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2500_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         95179655.0    
:2@N         12159568.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2500_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2500_ncyc3', exp_type='R1rho')
Setting the 'nu_2500_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2500_ncyc3', field=2500)
Setting the 'nu_2500_ncyc3' spectrum spin-lock field strength to 2.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2500_ncyc3', offset=115.0)
Setting the 'nu_2500_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2500_ncyc3', time=0.02)
Setting the 'nu_2500_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_2500_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2500_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2500_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2500_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         90591667.0    
:2@N         7392755.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2500_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2500_ncyc4', exp_type='R1rho')
Setting the 'nu_2500_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2500_ncyc4', field=2500)
Setting the 'nu_2500_ncyc4' spectrum spin-lock field strength to 2.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2500_ncyc4', offset=115.0)
Setting the 'nu_2500_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2500_ncyc4', time=0.04)
Setting the 'nu_2500_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_2500_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2500_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2500_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2500_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         86224837.0    
:2@N         4494635.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2500_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2500_ncyc5', exp_type='R1rho')
Setting the 'nu_2500_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2500_ncyc5', field=2500)
Setting the 'nu_2500_ncyc5' spectrum spin-lock field strength to 2.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2500_ncyc5', offset=115.0)
Setting the 'nu_2500_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2500_ncyc5', time=0.06)
Setting the 'nu_2500_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_2500_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2500_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2500_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2500_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         82068502.0    
:2@N         2732641.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2500_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2500_ncyc6', exp_type='R1rho')
Setting the 'nu_2500_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2500_ncyc6', field=2500)
Setting the 'nu_2500_ncyc6' spectrum spin-lock field strength to 2.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2500_ncyc6', offset=115.0)
Setting the 'nu_2500_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2500_ncyc6', time=0.08)
Setting the 'nu_2500_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_2500_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2500_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2500_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2500_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         78112518.0    
:2@N         1661387.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2500_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2500_ncyc7', exp_type='R1rho')
Setting the 'nu_2500_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2500_ncyc7', field=2500)
Setting the 'nu_2500_ncyc7' spectrum spin-lock field strength to 2.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2500_ncyc7', offset=115.0)
Setting the 'nu_2500_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2500_ncyc7', time=0.1)
Setting the 'nu_2500_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_2500_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2500_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2500_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2500_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         74347225.0    
:2@N         1010087.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2500_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2500_ncyc8', exp_type='R1rho')
Setting the 'nu_2500_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2500_ncyc8', field=2500)
Setting the 'nu_2500_ncyc8' spectrum spin-lock field strength to 2.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2500_ncyc8', offset=115.0)
Setting the 'nu_2500_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2500_ncyc8', time=0.12)
Setting the 'nu_2500_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_2500_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_2500_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_2500_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_2500_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         69036848.0    
:2@N         478840.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_2500_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_2500_ncyc9', exp_type='R1rho')
Setting the 'nu_2500_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_2500_ncyc9', field=2500)
Setting the 'nu_2500_ncyc9' spectrum spin-lock field strength to 2.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_2500_ncyc9', offset=115.0)
Setting the 'nu_2500_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_2500_ncyc9', time=0.15)
Setting the 'nu_2500_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_2500_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3000_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3000_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3000_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3000_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3000_ncyc1', exp_type='R1rho')
Setting the 'nu_3000_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3000_ncyc1', field=3000)
Setting the 'nu_3000_ncyc1' spectrum spin-lock field strength to 3.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3000_ncyc1', offset=115.0)
Setting the 'nu_3000_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3000_ncyc1', time=0.0)
Setting the 'nu_3000_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_3000_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3000_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3000_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3000_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         97625540.0    
:2@N         15636502.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3000_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3000_ncyc2', exp_type='R1rho')
Setting the 'nu_3000_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3000_ncyc2', field=3000)
Setting the 'nu_3000_ncyc2' spectrum spin-lock field strength to 3.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3000_ncyc2', offset=115.0)
Setting the 'nu_3000_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3000_ncyc2', time=0.01)
Setting the 'nu_3000_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_3000_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3000_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3000_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3000_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         95307460.0    
:2@N         12225010.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3000_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3000_ncyc3', exp_type='R1rho')
Setting the 'nu_3000_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3000_ncyc3', field=3000)
Setting the 'nu_3000_ncyc3' spectrum spin-lock field strength to 3.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3000_ncyc3', offset=115.0)
Setting the 'nu_3000_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3000_ncyc3', time=0.02)
Setting the 'nu_3000_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_3000_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3000_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3000_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3000_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         90835120.0    
:2@N         7472544.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3000_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3000_ncyc4', exp_type='R1rho')
Setting the 'nu_3000_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3000_ncyc4', field=3000)
Setting the 'nu_3000_ncyc4' spectrum spin-lock field strength to 3.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3000_ncyc4', offset=115.0)
Setting the 'nu_3000_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3000_ncyc4', time=0.04)
Setting the 'nu_3000_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_3000_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3000_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3000_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3000_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         86572647.0    
:2@N         4567596.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3000_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3000_ncyc5', exp_type='R1rho')
Setting the 'nu_3000_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3000_ncyc5', field=3000)
Setting the 'nu_3000_ncyc5' spectrum spin-lock field strength to 3.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3000_ncyc5', offset=115.0)
Setting the 'nu_3000_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3000_ncyc5', time=0.06)
Setting the 'nu_3000_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_3000_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3000_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3000_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3000_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         82510192.0    
:2@N         2791945.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3000_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3000_ncyc6', exp_type='R1rho')
Setting the 'nu_3000_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3000_ncyc6', field=3000)
Setting the 'nu_3000_ncyc6' spectrum spin-lock field strength to 3.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3000_ncyc6', offset=115.0)
Setting the 'nu_3000_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3000_ncyc6', time=0.08)
Setting the 'nu_3000_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_3000_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3000_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3000_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3000_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         78638368.0    
:2@N         1706578.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3000_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3000_ncyc7', exp_type='R1rho')
Setting the 'nu_3000_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3000_ncyc7', field=3000)
Setting the 'nu_3000_ncyc7' spectrum spin-lock field strength to 3.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3000_ncyc7', offset=115.0)
Setting the 'nu_3000_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3000_ncyc7', time=0.1)
Setting the 'nu_3000_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_3000_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3000_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3000_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3000_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         74948232.0    
:2@N         1043147.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3000_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3000_ncyc8', exp_type='R1rho')
Setting the 'nu_3000_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3000_ncyc8', field=3000)
Setting the 'nu_3000_ncyc8' spectrum spin-lock field strength to 3.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3000_ncyc8', offset=115.0)
Setting the 'nu_3000_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3000_ncyc8', time=0.12)
Setting the 'nu_3000_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_3000_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         69735151.0    
:2@N         498510.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3000_ncyc9', exp_type='R1rho')
Setting the 'nu_3000_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3000_ncyc9', field=3000)
Setting the 'nu_3000_ncyc9' spectrum spin-lock field strength to 3.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3000_ncyc9', offset=115.0)
Setting the 'nu_3000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3000_ncyc9', time=0.15)
Setting the 'nu_3000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_3000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3500_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3500_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3500_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3500_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3500_ncyc1', exp_type='R1rho')
Setting the 'nu_3500_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3500_ncyc1', field=3500)
Setting the 'nu_3500_ncyc1' spectrum spin-lock field strength to 3.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3500_ncyc1', offset=115.0)
Setting the 'nu_3500_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3500_ncyc1', time=0.0)
Setting the 'nu_3500_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_3500_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3500_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3500_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3500_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         97665121.0    
:2@N         15661876.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3500_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3500_ncyc2', exp_type='R1rho')
Setting the 'nu_3500_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3500_ncyc2', field=3500)
Setting the 'nu_3500_ncyc2' spectrum spin-lock field strength to 3.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3500_ncyc2', offset=115.0)
Setting the 'nu_3500_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3500_ncyc2', time=0.01)
Setting the 'nu_3500_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_3500_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3500_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3500_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3500_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         95384759.0    
:2@N         12264719.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3500_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3500_ncyc3', exp_type='R1rho')
Setting the 'nu_3500_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3500_ncyc3', field=3500)
Setting the 'nu_3500_ncyc3' spectrum spin-lock field strength to 3.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3500_ncyc3', offset=115.0)
Setting the 'nu_3500_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3500_ncyc3', time=0.02)
Setting the 'nu_3500_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_3500_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3500_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3500_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3500_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         90982523.0    
:2@N         7521166.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3500_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3500_ncyc4', exp_type='R1rho')
Setting the 'nu_3500_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3500_ncyc4', field=3500)
Setting the 'nu_3500_ncyc4' spectrum spin-lock field strength to 3.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3500_ncyc4', offset=115.0)
Setting the 'nu_3500_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3500_ncyc4', time=0.04)
Setting the 'nu_3500_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_3500_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3500_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3500_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3500_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         86783460.0    
:2@N         4612249.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3500_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3500_ncyc5', exp_type='R1rho')
Setting the 'nu_3500_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3500_ncyc5', field=3500)
Setting the 'nu_3500_ncyc5' spectrum spin-lock field strength to 3.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3500_ncyc5', offset=115.0)
Setting the 'nu_3500_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3500_ncyc5', time=0.06)
Setting the 'nu_3500_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_3500_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3500_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3500_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3500_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         82778195.0    
:2@N         2828397.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3500_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3500_ncyc6', exp_type='R1rho')
Setting the 'nu_3500_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3500_ncyc6', field=3500)
Setting the 'nu_3500_ncyc6' spectrum spin-lock field strength to 3.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3500_ncyc6', offset=115.0)
Setting the 'nu_3500_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3500_ncyc6', time=0.08)
Setting the 'nu_3500_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_3500_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3500_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3500_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3500_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         78957782.0    
:2@N         1734474.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3500_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3500_ncyc7', exp_type='R1rho')
Setting the 'nu_3500_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3500_ncyc7', field=3500)
Setting the 'nu_3500_ncyc7' spectrum spin-lock field strength to 3.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3500_ncyc7', offset=115.0)
Setting the 'nu_3500_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3500_ncyc7', time=0.1)
Setting the 'nu_3500_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_3500_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3500_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3500_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3500_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         75313690.0    
:2@N         1063642.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3500_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3500_ncyc8', exp_type='R1rho')
Setting the 'nu_3500_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3500_ncyc8', field=3500)
Setting the 'nu_3500_ncyc8' spectrum spin-lock field strength to 3.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3500_ncyc8', offset=115.0)
Setting the 'nu_3500_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3500_ncyc8', time=0.12)
Setting the 'nu_3500_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_3500_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_3500_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_3500_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_3500_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70160457.0    
:2@N         510783.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_3500_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_3500_ncyc9', exp_type='R1rho')
Setting the 'nu_3500_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_3500_ncyc9', field=3500)
Setting the 'nu_3500_ncyc9' spectrum spin-lock field strength to 3.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_3500_ncyc9', offset=115.0)
Setting the 'nu_3500_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_3500_ncyc9', time=0.15)
Setting the 'nu_3500_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_3500_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4000_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4000_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4000_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4000_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4000_ncyc1', exp_type='R1rho')
Setting the 'nu_4000_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4000_ncyc1', field=4000)
Setting the 'nu_4000_ncyc1' spectrum spin-lock field strength to 4.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4000_ncyc1', offset=115.0)
Setting the 'nu_4000_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4000_ncyc1', time=0.0)
Setting the 'nu_4000_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_4000_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4000_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4000_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4000_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         97690851.0    
:2@N         15678387.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4000_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4000_ncyc2', exp_type='R1rho')
Setting the 'nu_4000_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4000_ncyc2', field=4000)
Setting the 'nu_4000_ncyc2' spectrum spin-lock field strength to 4.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4000_ncyc2', offset=115.0)
Setting the 'nu_4000_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4000_ncyc2', time=0.01)
Setting the 'nu_4000_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_4000_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4000_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4000_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4000_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         95435024.0    
:2@N         12290592.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4000_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4000_ncyc3', exp_type='R1rho')
Setting the 'nu_4000_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4000_ncyc3', field=4000)
Setting the 'nu_4000_ncyc3' spectrum spin-lock field strength to 4.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4000_ncyc3', offset=115.0)
Setting the 'nu_4000_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4000_ncyc3', time=0.02)
Setting the 'nu_4000_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_4000_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4000_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4000_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4000_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         91078438.0    
:2@N         7552932.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4000_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4000_ncyc4', exp_type='R1rho')
Setting the 'nu_4000_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4000_ncyc4', field=4000)
Setting the 'nu_4000_ncyc4' spectrum spin-lock field strength to 4.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4000_ncyc4', offset=115.0)
Setting the 'nu_4000_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4000_ncyc4', time=0.04)
Setting the 'nu_4000_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_4000_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4000_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4000_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4000_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         86920730.0    
:2@N         4641500.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4000_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4000_ncyc5', exp_type='R1rho')
Setting the 'nu_4000_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4000_ncyc5', field=4000)
Setting the 'nu_4000_ncyc5' spectrum spin-lock field strength to 4.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4000_ncyc5', offset=115.0)
Setting the 'nu_4000_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4000_ncyc5', time=0.06)
Setting the 'nu_4000_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_4000_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4000_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4000_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4000_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         82952820.0    
:2@N         2852339.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4000_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4000_ncyc6', exp_type='R1rho')
Setting the 'nu_4000_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4000_ncyc6', field=4000)
Setting the 'nu_4000_ncyc6' spectrum spin-lock field strength to 4.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4000_ncyc6', offset=115.0)
Setting the 'nu_4000_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4000_ncyc6', time=0.08)
Setting the 'nu_4000_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_4000_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4000_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4000_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4000_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         79166044.0    
:2@N         1752847.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4000_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4000_ncyc7', exp_type='R1rho')
Setting the 'nu_4000_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4000_ncyc7', field=4000)
Setting the 'nu_4000_ncyc7' spectrum spin-lock field strength to 4.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4000_ncyc7', offset=115.0)
Setting the 'nu_4000_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4000_ncyc7', time=0.1)
Setting the 'nu_4000_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_4000_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4000_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4000_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4000_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         75552133.0    
:2@N         1077176.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4000_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4000_ncyc8', exp_type='R1rho')
Setting the 'nu_4000_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4000_ncyc8', field=4000)
Setting the 'nu_4000_ncyc8' spectrum spin-lock field strength to 4.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4000_ncyc8', offset=115.0)
Setting the 'nu_4000_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4000_ncyc8', time=0.12)
Setting the 'nu_4000_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_4000_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70438226.0    
:2@N         518920.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4000_ncyc9', exp_type='R1rho')
Setting the 'nu_4000_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4000_ncyc9', field=4000)
Setting the 'nu_4000_ncyc9' spectrum spin-lock field strength to 4.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4000_ncyc9', offset=115.0)
Setting the 'nu_4000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4000_ncyc9', time=0.15)
Setting the 'nu_4000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_4000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4500_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4500_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4500_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4500_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4500_ncyc1', exp_type='R1rho')
Setting the 'nu_4500_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4500_ncyc1', field=4500)
Setting the 'nu_4500_ncyc1' spectrum spin-lock field strength to 4.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4500_ncyc1', offset=115.0)
Setting the 'nu_4500_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4500_ncyc1', time=0.0)
Setting the 'nu_4500_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_4500_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4500_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4500_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4500_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         97708510.0    
:2@N         15689726.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4500_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4500_ncyc2', exp_type='R1rho')
Setting the 'nu_4500_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4500_ncyc2', field=4500)
Setting the 'nu_4500_ncyc2' spectrum spin-lock field strength to 4.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4500_ncyc2', offset=115.0)
Setting the 'nu_4500_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4500_ncyc2', time=0.01)
Setting the 'nu_4500_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_4500_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4500_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4500_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4500_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         95469529.0    
:2@N         12308376.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4500_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4500_ncyc3', exp_type='R1rho')
Setting the 'nu_4500_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4500_ncyc3', field=4500)
Setting the 'nu_4500_ncyc3' spectrum spin-lock field strength to 4.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4500_ncyc3', offset=115.0)
Setting the 'nu_4500_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4500_ncyc3', time=0.02)
Setting the 'nu_4500_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_4500_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4500_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4500_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4500_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         91144310.0    
:2@N         7574806.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4500_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4500_ncyc4', exp_type='R1rho')
Setting the 'nu_4500_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4500_ncyc4', field=4500)
Setting the 'nu_4500_ncyc4' spectrum spin-lock field strength to 4.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4500_ncyc4', offset=115.0)
Setting the 'nu_4500_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4500_ncyc4', time=0.04)
Setting the 'nu_4500_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_4500_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4500_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4500_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4500_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         87015043.0    
:2@N         4661678.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4500_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4500_ncyc5', exp_type='R1rho')
Setting the 'nu_4500_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4500_ncyc5', field=4500)
Setting the 'nu_4500_ncyc5' spectrum spin-lock field strength to 4.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4500_ncyc5', offset=115.0)
Setting the 'nu_4500_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4500_ncyc5', time=0.06)
Setting the 'nu_4500_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_4500_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4500_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4500_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4500_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         83072852.0    
:2@N         2868884.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4500_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4500_ncyc6', exp_type='R1rho')
Setting the 'nu_4500_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4500_ncyc6', field=4500)
Setting the 'nu_4500_ncyc6' spectrum spin-lock field strength to 4.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4500_ncyc6', offset=115.0)
Setting the 'nu_4500_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4500_ncyc6', time=0.08)
Setting the 'nu_4500_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_4500_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4500_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4500_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4500_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         79309261.0    
:2@N         1765565.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4500_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4500_ncyc7', exp_type='R1rho')
Setting the 'nu_4500_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4500_ncyc7', field=4500)
Setting the 'nu_4500_ncyc7' spectrum spin-lock field strength to 4.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4500_ncyc7', offset=115.0)
Setting the 'nu_4500_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4500_ncyc7', time=0.1)
Setting the 'nu_4500_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_4500_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4500_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4500_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4500_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         75716178.0    
:2@N         1086562.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4500_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4500_ncyc8', exp_type='R1rho')
Setting the 'nu_4500_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4500_ncyc8', field=4500)
Setting the 'nu_4500_ncyc8' spectrum spin-lock field strength to 4.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4500_ncyc8', offset=115.0)
Setting the 'nu_4500_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4500_ncyc8', time=0.12)
Setting the 'nu_4500_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_4500_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_4500_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_4500_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_4500_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70629455.0    
:2@N         524578.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_4500_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_4500_ncyc9', exp_type='R1rho')
Setting the 'nu_4500_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_4500_ncyc9', field=4500)
Setting the 'nu_4500_ncyc9' spectrum spin-lock field strength to 4.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_4500_ncyc9', offset=115.0)
Setting the 'nu_4500_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_4500_ncyc9', time=0.15)
Setting the 'nu_4500_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_4500_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5000_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5000_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5000_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5000_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5000_ncyc1', exp_type='R1rho')
Setting the 'nu_5000_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5000_ncyc1', field=5000)
Setting the 'nu_5000_ncyc1' spectrum spin-lock field strength to 5.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5000_ncyc1', offset=115.0)
Setting the 'nu_5000_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5000_ncyc1', time=0.0)
Setting the 'nu_5000_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_5000_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5000_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5000_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5000_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         97721150.0    
:2@N         15697847.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5000_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5000_ncyc2', exp_type='R1rho')
Setting the 'nu_5000_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5000_ncyc2', field=5000)
Setting the 'nu_5000_ncyc2' spectrum spin-lock field strength to 5.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5000_ncyc2', offset=115.0)
Setting the 'nu_5000_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5000_ncyc2', time=0.01)
Setting the 'nu_5000_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_5000_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5000_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5000_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5000_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         95494232.0    
:2@N         12321120.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5000_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5000_ncyc3', exp_type='R1rho')
Setting the 'nu_5000_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5000_ncyc3', field=5000)
Setting the 'nu_5000_ncyc3' spectrum spin-lock field strength to 5.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5000_ncyc3', offset=115.0)
Setting the 'nu_5000_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5000_ncyc3', time=0.02)
Setting the 'nu_5000_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_5000_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5000_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5000_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5000_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         91191483.0    
:2@N         7590500.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5000_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5000_ncyc4', exp_type='R1rho')
Setting the 'nu_5000_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5000_ncyc4', field=5000)
Setting the 'nu_5000_ncyc4' spectrum spin-lock field strength to 5.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5000_ncyc4', offset=115.0)
Setting the 'nu_5000_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5000_ncyc4', time=0.04)
Setting the 'nu_5000_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_5000_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5000_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5000_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5000_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         87082607.0    
:2@N         4676173.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5000_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5000_ncyc5', exp_type='R1rho')
Setting the 'nu_5000_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5000_ncyc5', field=5000)
Setting the 'nu_5000_ncyc5' spectrum spin-lock field strength to 5.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5000_ncyc5', offset=115.0)
Setting the 'nu_5000_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5000_ncyc5', time=0.06)
Setting the 'nu_5000_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_5000_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5000_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5000_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5000_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         83158867.0    
:2@N         2880785.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5000_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5000_ncyc6', exp_type='R1rho')
Setting the 'nu_5000_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5000_ncyc6', field=5000)
Setting the 'nu_5000_ncyc6' spectrum spin-lock field strength to 5.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5000_ncyc6', offset=115.0)
Setting the 'nu_5000_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5000_ncyc6', time=0.08)
Setting the 'nu_5000_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_5000_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5000_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5000_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5000_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         79411921.0    
:2@N         1774725.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5000_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5000_ncyc7', exp_type='R1rho')
Setting the 'nu_5000_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5000_ncyc7', field=5000)
Setting the 'nu_5000_ncyc7' spectrum spin-lock field strength to 5.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5000_ncyc7', offset=115.0)
Setting the 'nu_5000_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5000_ncyc7', time=0.1)
Setting the 'nu_5000_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_5000_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5000_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5000_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5000_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         75833804.0    
:2@N         1093330.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5000_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5000_ncyc8', exp_type='R1rho')
Setting the 'nu_5000_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5000_ncyc8', field=5000)
Setting the 'nu_5000_ncyc8' spectrum spin-lock field strength to 5.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5000_ncyc8', offset=115.0)
Setting the 'nu_5000_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5000_ncyc8', time=0.12)
Setting the 'nu_5000_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_5000_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70766637.0    
:2@N         528666.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5000_ncyc9', exp_type='R1rho')
Setting the 'nu_5000_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5000_ncyc9', field=5000)
Setting the 'nu_5000_ncyc9' spectrum spin-lock field strength to 5.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5000_ncyc9', offset=115.0)
Setting the 'nu_5000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5000_ncyc9', time=0.15)
Setting the 'nu_5000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_5000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5500_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5500_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5500_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5500_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5500_ncyc1', exp_type='R1rho')
Setting the 'nu_5500_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5500_ncyc1', field=5500)
Setting the 'nu_5500_ncyc1' spectrum spin-lock field strength to 5.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5500_ncyc1', offset=115.0)
Setting the 'nu_5500_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5500_ncyc1', time=0.0)
Setting the 'nu_5500_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_5500_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5500_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5500_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5500_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         97730507.0    
:2@N         15703860.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5500_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5500_ncyc2', exp_type='R1rho')
Setting the 'nu_5500_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5500_ncyc2', field=5500)
Setting the 'nu_5500_ncyc2' spectrum spin-lock field strength to 5.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5500_ncyc2', offset=115.0)
Setting the 'nu_5500_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5500_ncyc2', time=0.01)
Setting the 'nu_5500_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_5500_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5500_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5500_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5500_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         95512521.0    
:2@N         12330562.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5500_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5500_ncyc3', exp_type='R1rho')
Setting the 'nu_5500_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5500_ncyc3', field=5500)
Setting the 'nu_5500_ncyc3' spectrum spin-lock field strength to 5.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5500_ncyc3', offset=115.0)
Setting the 'nu_5500_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5500_ncyc3', time=0.02)
Setting the 'nu_5500_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_5500_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5500_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5500_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5500_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         91226417.0    
:2@N         7602138.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5500_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5500_ncyc4', exp_type='R1rho')
Setting the 'nu_5500_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5500_ncyc4', field=5500)
Setting the 'nu_5500_ncyc4' spectrum spin-lock field strength to 5.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5500_ncyc4', offset=115.0)
Setting the 'nu_5500_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5500_ncyc4', time=0.04)
Setting the 'nu_5500_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_5500_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5500_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5500_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5500_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         87132650.0    
:2@N         4686932.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5500_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5500_ncyc5', exp_type='R1rho')
Setting the 'nu_5500_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5500_ncyc5', field=5500)
Setting the 'nu_5500_ncyc5' spectrum spin-lock field strength to 5.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5500_ncyc5', offset=115.0)
Setting the 'nu_5500_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5500_ncyc5', time=0.06)
Setting the 'nu_5500_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_5500_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5500_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5500_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5500_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         83222591.0    
:2@N         2889625.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5500_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5500_ncyc6', exp_type='R1rho')
Setting the 'nu_5500_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5500_ncyc6', field=5500)
Setting the 'nu_5500_ncyc6' spectrum spin-lock field strength to 5.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5500_ncyc6', offset=115.0)
Setting the 'nu_5500_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5500_ncyc6', time=0.08)
Setting the 'nu_5500_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_5500_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5500_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5500_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5500_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         79487995.0    
:2@N         1781535.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5500_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5500_ncyc7', exp_type='R1rho')
Setting the 'nu_5500_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5500_ncyc7', field=5500)
Setting the 'nu_5500_ncyc7' spectrum spin-lock field strength to 5.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5500_ncyc7', offset=115.0)
Setting the 'nu_5500_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5500_ncyc7', time=0.1)
Setting the 'nu_5500_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_5500_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5500_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5500_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5500_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         75920988.0    
:2@N         1098366.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5500_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5500_ncyc8', exp_type='R1rho')
Setting the 'nu_5500_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5500_ncyc8', field=5500)
Setting the 'nu_5500_ncyc8' spectrum spin-lock field strength to 5.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5500_ncyc8', offset=115.0)
Setting the 'nu_5500_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5500_ncyc8', time=0.12)
Setting the 'nu_5500_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_5500_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_5500_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_5500_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_5500_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70868349.0    
:2@N         531712.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_5500_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_5500_ncyc9', exp_type='R1rho')
Setting the 'nu_5500_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_5500_ncyc9', field=5500)
Setting the 'nu_5500_ncyc9' spectrum spin-lock field strength to 5.5 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_5500_ncyc9', offset=115.0)
Setting the 'nu_5500_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_5500_ncyc9', time=0.15)
Setting the 'nu_5500_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_5500_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_6000_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_6000_ncyc1', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_6000_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:1@N         100000000.0    
:2@N         20000000.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_6000_ncyc1', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_6000_ncyc1', exp_type='R1rho')
Setting the 'nu_6000_ncyc1' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_6000_ncyc1', field=6000)
Setting the 'nu_6000_ncyc1' spectrum spin-lock field strength to 6.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_6000_ncyc1', offset=115.0)
Setting the 'nu_6000_ncyc1' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_6000_ncyc1', time=0.0)
Setting the 'nu_6000_ncyc1' spectrum relaxation time period to 0.0 s.

relax> spectrometer.frequency(id='nu_6000_ncyc1', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_6000_ncyc2.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_6000_ncyc2', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_6000_ncyc2.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         97737627.0    
:2@N         15708437.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_6000_ncyc2', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_6000_ncyc2', exp_type='R1rho')
Setting the 'nu_6000_ncyc2' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_6000_ncyc2', field=6000)
Setting the 'nu_6000_ncyc2' spectrum spin-lock field strength to 6.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_6000_ncyc2', offset=115.0)
Setting the 'nu_6000_ncyc2' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_6000_ncyc2', time=0.01)
Setting the 'nu_6000_ncyc2' spectrum relaxation time period to 0.01 s.

relax> spectrometer.frequency(id='nu_6000_ncyc2', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_6000_ncyc3.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_6000_ncyc3', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_6000_ncyc3.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         95526438.0    
:2@N         12337750.0    

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_6000_ncyc3', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_6000_ncyc3', exp_type='R1rho')
Setting the 'nu_6000_ncyc3' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_6000_ncyc3', field=6000)
Setting the 'nu_6000_ncyc3' spectrum spin-lock field strength to 6.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_6000_ncyc3', offset=115.0)
Setting the 'nu_6000_ncyc3' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_6000_ncyc3', time=0.02)
Setting the 'nu_6000_ncyc3' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='nu_6000_ncyc3', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_6000_ncyc4.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_6000_ncyc4', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_6000_ncyc4.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         91253003.0    
:2@N         7611004.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_6000_ncyc4', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_6000_ncyc4', exp_type='R1rho')
Setting the 'nu_6000_ncyc4' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_6000_ncyc4', field=6000)
Setting the 'nu_6000_ncyc4' spectrum spin-lock field strength to 6.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_6000_ncyc4', offset=115.0)
Setting the 'nu_6000_ncyc4' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_6000_ncyc4', time=0.04)
Setting the 'nu_6000_ncyc4' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='nu_6000_ncyc4', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_6000_ncyc5.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_6000_ncyc5', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_6000_ncyc5.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         87170744.0    
:2@N         4695133.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_6000_ncyc5', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_6000_ncyc5', exp_type='R1rho')
Setting the 'nu_6000_ncyc5' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_6000_ncyc5', field=6000)
Setting the 'nu_6000_ncyc5' spectrum spin-lock field strength to 6.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_6000_ncyc5', offset=115.0)
Setting the 'nu_6000_ncyc5' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_6000_ncyc5', time=0.06)
Setting the 'nu_6000_ncyc5' spectrum relaxation time period to 0.06 s.

relax> spectrometer.frequency(id='nu_6000_ncyc5', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_6000_ncyc6.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_6000_ncyc6', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_6000_ncyc6.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         83271107.0    
:2@N         2896369.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_6000_ncyc6', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_6000_ncyc6', exp_type='R1rho')
Setting the 'nu_6000_ncyc6' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_6000_ncyc6', field=6000)
Setting the 'nu_6000_ncyc6' spectrum spin-lock field strength to 6.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_6000_ncyc6', offset=115.0)
Setting the 'nu_6000_ncyc6' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_6000_ncyc6', time=0.08)
Setting the 'nu_6000_ncyc6' spectrum relaxation time period to 0.08 s.

relax> spectrometer.frequency(id='nu_6000_ncyc6', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_6000_ncyc7.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_6000_ncyc7', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_6000_ncyc7.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         79545922.0    
:2@N         1786734.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_6000_ncyc7', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_6000_ncyc7', exp_type='R1rho')
Setting the 'nu_6000_ncyc7' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_6000_ncyc7', field=6000)
Setting the 'nu_6000_ncyc7' spectrum spin-lock field strength to 6.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_6000_ncyc7', offset=115.0)
Setting the 'nu_6000_ncyc7' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_6000_ncyc7', time=0.1)
Setting the 'nu_6000_ncyc7' spectrum relaxation time period to 0.1 s.

relax> spectrometer.frequency(id='nu_6000_ncyc7', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_6000_ncyc8.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_6000_ncyc8', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_6000_ncyc8.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         75987386.0    
:2@N         1102214.0     

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_6000_ncyc8', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_6000_ncyc8', exp_type='R1rho')
Setting the 'nu_6000_ncyc8' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_6000_ncyc8', field=6000)
Setting the 'nu_6000_ncyc8' spectrum spin-lock field strength to 6.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_6000_ncyc8', offset=115.0)
Setting the 'nu_6000_ncyc8' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_6000_ncyc8', time=0.12)
Setting the 'nu_6000_ncyc8' spectrum relaxation time period to 0.12 s.

relax> spectrometer.frequency(id='nu_6000_ncyc8', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> spectrum.read_intensities(file='nu_6000_ncyc9.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spectrum_id='nu_6000_ncyc9', dim=1, int_method='height', int_col=None, spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_6000_ncyc9.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.

The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity     
:1@N         70945831.0    
:2@N         534041.0      

relax> spectrum.baseplane_rmsd(error=200000.0, spectrum_id='nu_6000_ncyc9', spin_id=None)

relax> relax_disp.exp_type(spectrum_id='nu_6000_ncyc9', exp_type='R1rho')
Setting the 'nu_6000_ncyc9' spectrum tothe R1rho-type experiment.

relax> relax_disp.spin_lock_field(spectrum_id='nu_6000_ncyc9', field=6000)
Setting the 'nu_6000_ncyc9' spectrum spin-lock field strength to 6.0 kHz.

relax> relax_disp.spin_lock_offset(spectrum_id='nu_6000_ncyc9', offset=115.0)
Setting the 'nu_6000_ncyc9' spectrum spin-lock offset to 115.0 ppm.

relax> relax_disp.relax_time(spectrum_id='nu_6000_ncyc9', time=0.15)
Setting the 'nu_6000_ncyc9' spectrum relaxation time period to 0.15 s.

relax> spectrometer.frequency(id='nu_6000_ncyc9', frq=800, units='MHz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> chemical_shift.read(file='nu_1000_ncyc1.list', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61', spin_id_col=None, mol_name_col=None, res_num_col=None, res_name_col=None, spin_num_col=None, spin_name_col=None, sep=None, spin_id=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/r1rho_on_res_m61/nu_1000_ncyc1.list' for reading.
Sparky formatted data file.

Number of header lines found: 1
2D peak list detected.
RelaxWarning: Cannot find the spin :1@HN within the sequence.
RelaxWarning: Cannot find the spin :2@HN within the sequence.

The following chemical shifts have been loaded into the relax data store:

# Spin_ID    Chemical shift    
:1@N         115.0             
:2@N         115.0             




=======================================
= Relaxation dispersion auto-analysis =
=======================================


relax> spectrum.error_analysis(subset=['nu_1000_ncyc1', 'nu_1000_ncyc2', 'nu_1000_ncyc3', 'nu_1000_ncyc4', 'nu_1000_ncyc5', 'nu_1000_ncyc6', 'nu_1000_ncyc7', 'nu_1000_ncyc8', 'nu_1000_ncyc9', 'nu_1500_ncyc1', 'nu_1500_ncyc2', 'nu_1500_ncyc3', 'nu_1500_ncyc4', 'nu_1500_ncyc5', 'nu_1500_ncyc6', 'nu_1500_ncyc7', 'nu_1500_ncyc8', 'nu_1500_ncyc9', 'nu_2000_ncyc1', 'nu_2000_ncyc2', 'nu_2000_ncyc3', 'nu_2000_ncyc4', 'nu_2000_ncyc5', 'nu_2000_ncyc6', 'nu_2000_ncyc7', 'nu_2000_ncyc8', 'nu_2000_ncyc9', 'nu_2500_ncyc1', 'nu_2500_ncyc2', 'nu_2500_ncyc3', 'nu_2500_ncyc4', 'nu_2500_ncyc5', 'nu_2500_ncyc6', 'nu_2500_ncyc7', 'nu_2500_ncyc8', 'nu_2500_ncyc9', 'nu_3000_ncyc1', 'nu_3000_ncyc2', 'nu_3000_ncyc3', 'nu_3000_ncyc4', 'nu_3000_ncyc5', 'nu_3000_ncyc6', 'nu_3000_ncyc7', 'nu_3000_ncyc8', 'nu_3000_ncyc9', 'nu_3500_ncyc1', 'nu_3500_ncyc2', 'nu_3500_ncyc3', 'nu_3500_ncyc4', 'nu_3500_ncyc5', 'nu_3500_ncyc6', 'nu_3500_ncyc7', 'nu_3500_ncyc8', 'nu_3500_ncyc9', 'nu_4000_ncyc1', 'nu_4000_ncyc2', 'nu_4000_ncyc3', 'nu_4000_ncyc4', 'nu_4000_ncyc5', 'nu_4000_ncyc6', 'nu_4000_ncyc7', 'nu_4000_ncyc8', 'nu_4000_ncyc9', 'nu_4500_ncyc1', 'nu_4500_ncyc2', 'nu_4500_ncyc3', 'nu_4500_ncyc4', 'nu_4500_ncyc5', 'nu_4500_ncyc6', 'nu_4500_ncyc7', 'nu_4500_ncyc8', 'nu_4500_ncyc9', 'nu_5000_ncyc1', 'nu_5000_ncyc2', 'nu_5000_ncyc3', 'nu_5000_ncyc4', 'nu_5000_ncyc5', 'nu_5000_ncyc6', 'nu_5000_ncyc7', 'nu_5000_ncyc8', 'nu_5000_ncyc9', 'nu_5500_ncyc1', 'nu_5500_ncyc2', 'nu_5500_ncyc3', 'nu_5500_ncyc4', 'nu_5500_ncyc5', 'nu_5500_ncyc6', 'nu_5500_ncyc7', 'nu_5500_ncyc8', 'nu_5500_ncyc9', 'nu_6000_ncyc1', 'nu_6000_ncyc2', 'nu_6000_ncyc3', 'nu_6000_ncyc4', 'nu_6000_ncyc5', 'nu_6000_ncyc6', 'nu_6000_ncyc7', 'nu_6000_ncyc8', 'nu_6000_ncyc9'])
Intensity measure:  Peak heights.
Replicated spectra:  No.
Spectra ID subset ignored.



---------------------
- The 'R2eff' model -
---------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='R2eff', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='R2eff')

relax> relax_disp.select_model(model='R2eff')
R2eff/R1rho value and error determination.

relax> grid_search(lower=None, upper=None, inc=10, constraints=True, verbosity=1)


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 1000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1501675.23377       
k: 10       xk: [              1,     11111111.11]    fk: 1145125.45345       
k: 20       xk: [              1,     22222222.22]    fk: 837645.707206       
k: 30       xk: [              1,     33333333.33]    fk: 579235.995031       
k: 40       xk: [              1,     44444444.44]    fk: 369896.316926       
k: 50       xk: [              1,     55555555.56]    fk: 209626.672891       
k: 60       xk: [              1,     66666666.67]    fk: 98427.0629266       
k: 70       xk: [              1,     77777777.78]    fk: 36297.4870317       
k: 80       xk: [              1,     88888888.89]    fk: 23237.9452069       
k: 91       xk: [    5.333333333,       100000000]    fk: 16396.6739886       


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 1500.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1616918.64732       
k: 10       xk: [              1,     11111111.11]    fk: 1244624.52717       
k: 20       xk: [              1,     22222222.22]    fk: 921400.441083       
k: 30       xk: [              1,     33333333.33]    fk: 647246.389068       
k: 40       xk: [              1,     44444444.44]    fk: 422162.371123       
k: 50       xk: [              1,     55555555.56]    fk: 246148.387248       
k: 60       xk: [              1,     66666666.67]    fk: 119204.437443       
k: 70       xk: [              1,     77777777.78]    fk: 41330.5217083       
k: 80       xk: [              1,     88888888.89]    fk: 12526.6400435       


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 2000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1661960.53633       
k: 10       xk: [              1,     11111111.11]    fk: 1283777.7404        
k: 20       xk: [              1,     22222222.22]    fk: 954664.97854        
k: 30       xk: [              1,     33333333.33]    fk: 674622.250749       
k: 40       xk: [              1,     44444444.44]    fk: 443649.557028       
k: 50       xk: [              1,     55555555.56]    fk: 261746.897378       
k: 60       xk: [              1,     66666666.67]    fk: 128914.271797       
k: 70       xk: [              1,     77777777.78]    fk: 45151.6802861       
k: 80       xk: [              1,     88888888.89]    fk: 10459.1228454       


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 2500.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1683727.64024       
k: 10       xk: [              1,     11111111.11]    fk: 1302748.29733       
k: 20       xk: [              1,     22222222.22]    fk: 970838.9885         
k: 30       xk: [              1,     33333333.33]    fk: 687999.713737       
k: 40       xk: [              1,     44444444.44]    fk: 454230.473044       
k: 50       xk: [              1,     55555555.56]    fk: 269531.266421       
k: 60       xk: [              1,     66666666.67]    fk: 133902.093869       
k: 70       xk: [              1,     77777777.78]    fk: 47342.9553858       
k: 80       xk: [              1,     88888888.89]    fk: 9853.85097302       


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 3000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1695806.34241       
k: 10       xk: [              1,     11111111.11]    fk: 1313288.56377       
k: 20       xk: [              1,     22222222.22]    fk: 979840.819198       
k: 30       xk: [              1,     33333333.33]    fk: 695463.108698       
k: 40       xk: [              1,     44444444.44]    fk: 460155.432268       
k: 50       xk: [              1,     55555555.56]    fk: 273917.789909       
k: 60       xk: [              1,     66666666.67]    fk: 136750.181619       
k: 70       xk: [              1,     77777777.78]    fk: 48652.6073992       
k: 80       xk: [              1,     88888888.89]    fk: 9625.06724939       


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 3500.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1703177.9766        
k: 10       xk: [              1,     11111111.11]    fk: 1319725.90512       
k: 20       xk: [              1,     22222222.22]    fk: 985343.867705       
k: 30       xk: [              1,     33333333.33]    fk: 700031.864362       
k: 40       xk: [              1,     44444444.44]    fk: 463789.89509        
k: 50       xk: [              1,     55555555.56]    fk: 276617.959887       
k: 60       xk: [              1,     66666666.67]    fk: 138516.058755       
k: 70       xk: [              1,     77777777.78]    fk: 49484.1916925       
k: 80       xk: [              1,     88888888.89]    fk: 9522.35870009       


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 4000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1707998.56746       
k: 10       xk: [              1,     11111111.11]    fk: 1323937.3992        
k: 20       xk: [              1,     22222222.22]    fk: 988946.265001       
k: 30       xk: [              1,     33333333.33]    fk: 703025.164874       
k: 40       xk: [              1,     44444444.44]    fk: 466174.098818       
k: 50       xk: [              1,     55555555.56]    fk: 278393.066831       
k: 60       xk: [              1,     66666666.67]    fk: 139682.068915       
k: 70       xk: [              1,     77777777.78]    fk: 50041.1050687       
k: 80       xk: [              1,     88888888.89]    fk: 9470.17529234       


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 4500.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1711320.09979       
k: 10       xk: [              1,     11111111.11]    fk: 1326840.10175       
k: 20       xk: [              1,     22222222.22]    fk: 991430.137779       
k: 30       xk: [              1,     33333333.33]    fk: 705090.207877       
k: 40       xk: [              1,     44444444.44]    fk: 467820.312045       
k: 50       xk: [              1,     55555555.56]    fk: 279620.450283       
k: 60       xk: [              1,     66666666.67]    fk: 140490.622591       
k: 70       xk: [              1,     77777777.78]    fk: 50430.8289695       
k: 80       xk: [              1,     88888888.89]    fk: 9441.06941748       


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 5000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1713704.29038       
k: 10       xk: [              1,     11111111.11]    fk: 1328924.08579       
k: 20       xk: [              1,     22222222.22]    fk: 993213.915272       
k: 30       xk: [              1,     33333333.33]    fk: 706573.778823       
k: 40       xk: [              1,     44444444.44]    fk: 469003.676445       
k: 50       xk: [              1,     55555555.56]    fk: 280503.608136       
k: 60       xk: [              1,     66666666.67]    fk: 141073.573898       
k: 70       xk: [              1,     77777777.78]    fk: 50713.5737293       
k: 80       xk: [              1,     88888888.89]    fk: 9423.60763081       


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 5500.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1715472.79579       
k: 10       xk: [              1,     11111111.11]    fk: 1330470.13978       
k: 20       xk: [              1,     22222222.22]    fk: 994537.517838       
k: 30       xk: [              1,     33333333.33]    fk: 707674.929967       
k: 40       xk: [              1,     44444444.44]    fk: 469882.376167       
k: 50       xk: [              1,     55555555.56]    fk: 281159.856437       
k: 60       xk: [              1,     66666666.67]    fk: 141507.370776       
k: 70       xk: [              1,     77777777.78]    fk: 50924.9191858       
k: 80       xk: [              1,     88888888.89]    fk: 9412.5016654        


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 6000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 1716820.44974       
k: 10       xk: [              1,     11111111.11]    fk: 1331648.41081       
k: 20       xk: [              1,     22222222.22]    fk: 995546.405953       
k: 30       xk: [              1,     33333333.33]    fk: 708514.435164       
k: 40       xk: [              1,     44444444.44]    fk: 470552.498444       
k: 50       xk: [              1,     55555555.56]    fk: 281660.595795       
k: 60       xk: [              1,     66666666.67]    fk: 141838.727215       
k: 70       xk: [              1,     77777777.78]    fk: 51086.8927058       
k: 80       xk: [              1,     88888888.89]    fk: 9405.0922663        


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 1000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 20016.9500396       
k: 10       xk: [              1,     2222222.222]    fk: 14525.4281879       
k: 20       xk: [              1,     4444444.445]    fk: 10996.7076991       
k: 21       xk: [    5.333333333,     4444444.445]    fk: 10580.3685736       
k: 30       xk: [              1,     6666666.667]    fk: 9430.78857298       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 7764.58366335       
k: 32       xk: [    9.666666667,     6666666.667]    fk: 7451.72553319       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6217.13596818       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5134.62687575       
k: 43       xk: [             14,     8888888.889]    fk: 4994.82500046       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3753.18297399       
k: 53       xk: [             14,     11111111.11]    fk: 3126.11224604       
k: 54       xk: [    18.33333333,     11111111.11]    fk: 3124.91404261       
k: 63       xk: [             14,     13333333.33]    fk: 2012.12689377       
k: 64       xk: [    18.33333333,     13333333.33]    fk: 1679.83073258       
k: 73       xk: [             14,     15555555.56]    fk: 1652.86894365       
k: 74       xk: [    18.33333333,     15555555.56]    fk: 879.188719011       
k: 75       xk: [    22.66666667,     15555555.56]    fk: 720.961655099       
k: 85       xk: [    22.66666667,     17777777.78]    fk: 247.020563971       
k: 86       xk: [             27,     17777777.78]    fk: 184.206299635       
k: 96       xk: [             27,        20000000]    fk: 34.5428970627       
k: 97       xk: [    31.33333333,        20000000]    fk: 18.6405640974       


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 1500.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 21212.8410188       
k: 10       xk: [              1,     2222222.222]    fk: 15318.8925534       
k: 20       xk: [              1,     4444444.445]    fk: 11387.7454507       
k: 21       xk: [    5.333333333,     4444444.445]    fk: 11135.067379        
k: 30       xk: [              1,     6666666.667]    fk: 9419.39971077       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 7998.68638177       
k: 32       xk: [    9.666666667,     6666666.667]    fk: 7864.08603537       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6130.64259965       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5285.81055223       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3643.18982478       
k: 53       xk: [             14,     11111111.11]    fk: 3237.13612937       
k: 62       xk: [    9.666666667,     13333333.33]    fk: 2936.223853         
k: 63       xk: [             14,     13333333.33]    fk: 1906.17735791       
k: 64       xk: [    18.33333333,     13333333.33]    fk: 1775.72743252       
k: 73       xk: [             14,     15555555.56]    fk: 1329.9459886        
k: 74       xk: [    18.33333333,     15555555.56]    fk: 791.75303906        
k: 84       xk: [    18.33333333,     17777777.78]    fk: 452.219942055       
k: 85       xk: [    22.66666667,     17777777.78]    fk: 185.441108867       
k: 95       xk: [    22.66666667,        20000000]    fk: 124.973382964       
k: 96       xk: [             27,        20000000]    fk: 2.27649290281       


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 2000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 21696.816635        
k: 10       xk: [              1,     2222222.222]    fk: 15642.3150641       
k: 20       xk: [              1,     4444444.445]    fk: 11550.6148559       
k: 21       xk: [    5.333333333,     4444444.445]    fk: 11366.0473437       
k: 30       xk: [              1,     6666666.667]    fk: 9421.71601056       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 8103.16852071       
k: 32       xk: [    9.666666667,     6666666.667]    fk: 8041.91744623       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6108.62691283       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5361.59389464       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3616.92509873       
k: 53       xk: [             14,     11111111.11]    fk: 3300.83942036       
k: 62       xk: [    9.666666667,     13333333.33]    fk: 2807.9110585        
k: 63       xk: [             14,     13333333.33]    fk: 1885.82618385       
k: 64       xk: [    18.33333333,     13333333.33]    fk: 1836.71404331       
k: 73       xk: [             14,     15555555.56]    fk: 1225.5403495        
k: 74       xk: [    18.33333333,     15555555.56]    fk: 782.241482281       
k: 84       xk: [    18.33333333,     17777777.78]    fk: 372.210217705       
k: 85       xk: [    22.66666667,     17777777.78]    fk: 188.943235218       
k: 95       xk: [    22.66666667,        20000000]    fk: 68.4163230816       
k: 96       xk: [             27,        20000000]    fk: 19.5377229608       


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 2500.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 21934.4530831       
k: 10       xk: [              1,     2222222.222]    fk: 15801.6509542       
k: 20       xk: [              1,     4444444.445]    fk: 11631.6501882       
k: 21       xk: [    5.333333333,     4444444.445]    fk: 11480.8519273       
k: 30       xk: [              1,     6666666.667]    fk: 9424.45078491       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 8156.55717211       
k: 32       xk: [    9.666666667,     6666666.667]    fk: 8131.50936388       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6100.59963202       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5401.83763549       
k: 51       xk: [    5.333333333,     11111111.11]    fk: 5312.97930705       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3607.82066278       
k: 53       xk: [             14,     11111111.11]    fk: 3335.9501041        
k: 62       xk: [    9.666666667,     13333333.33]    fk: 2749.45844576       
k: 63       xk: [             14,     13333333.33]    fk: 1880.43171473       
k: 64       xk: [    18.33333333,     13333333.33]    fk: 1871.13180278       
k: 73       xk: [             14,     15555555.56]    fk: 1179.64072752       
k: 74       xk: [    18.33333333,     15555555.56]    fk: 782.789460313       
k: 84       xk: [    18.33333333,     17777777.78]    fk: 338.888414307       
k: 85       xk: [    22.66666667,     17777777.78]    fk: 196.344517229       
k: 95       xk: [    22.66666667,        20000000]    fk: 47.0382093385       
k: 96       xk: [             27,        20000000]    fk: 34.0319542675       


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 3000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 22067.4236143       
k: 10       xk: [              1,     2222222.222]    fk: 15890.9663303       
k: 20       xk: [              1,     4444444.445]    fk: 11677.3104092       
k: 21       xk: [    5.333333333,     4444444.445]    fk: 11545.493183        
k: 30       xk: [              1,     6666666.667]    fk: 9426.45585083       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 8187.03378998       
k: 32       xk: [    9.666666667,     6666666.667]    fk: 8182.28974339       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6096.91161211       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5425.22129778       
k: 51       xk: [    5.333333333,     11111111.11]    fk: 5275.12664936       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3603.80760784       
k: 53       xk: [             14,     11111111.11]    fk: 3356.68108086       
k: 62       xk: [    9.666666667,     13333333.33]    fk: 2718.04867359       
k: 63       xk: [             14,     13333333.33]    fk: 1878.71478061       
k: 73       xk: [             14,     15555555.56]    fk: 1155.47588251       
k: 74       xk: [    18.33333333,     15555555.56]    fk: 784.56565302        
k: 84       xk: [    18.33333333,     17777777.78]    fk: 321.92255866        
k: 85       xk: [    22.66666667,     17777777.78]    fk: 202.079984048       
k: 95       xk: [    22.66666667,        20000000]    fk: 36.869293111        


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 3500.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 22148.9733509       
k: 10       xk: [              1,     2222222.222]    fk: 15945.8000632       
k: 20       xk: [              1,     4444444.445]    fk: 11705.4281382       
k: 21       xk: [    5.333333333,     4444444.445]    fk: 11585.2803604       
k: 30       xk: [              1,     6666666.667]    fk: 9427.85757598       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 8205.93968781       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6094.93623034       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5439.86839434       
k: 51       xk: [    5.333333333,     11111111.11]    fk: 5252.26998799       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3601.72904439       
k: 53       xk: [             14,     11111111.11]    fk: 3369.77733309       
k: 62       xk: [    9.666666667,     13333333.33]    fk: 2699.24445012       
k: 63       xk: [             14,     13333333.33]    fk: 1878.12033596       
k: 73       xk: [             14,     15555555.56]    fk: 1141.19074098       
k: 74       xk: [    18.33333333,     15555555.56]    fk: 786.171194099       
k: 84       xk: [    18.33333333,     17777777.78]    fk: 312.107500374       
k: 85       xk: [    22.66666667,     17777777.78]    fk: 206.156242889       
k: 95       xk: [    22.66666667,        20000000]    fk: 31.2613672287       


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 4000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 22202.4667786       
k: 10       xk: [              1,     2222222.222]    fk: 15981.7925601       
k: 20       xk: [              1,     4444444.445]    fk: 11723.9197045       
k: 21       xk: [    5.333333333,     4444444.445]    fk: 11611.4381852       
k: 30       xk: [              1,     6666666.667]    fk: 9428.84821158       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 8218.42971111       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6093.75845217       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5449.60213787       
k: 51       xk: [    5.333333333,     11111111.11]    fk: 5237.42440836       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3600.52286689       
k: 53       xk: [             14,     11111111.11]    fk: 3378.52482276       
k: 62       xk: [    9.666666667,     13333333.33]    fk: 2687.09835158       
k: 63       xk: [             14,     13333333.33]    fk: 1877.91863803       
k: 73       xk: [             14,     15555555.56]    fk: 1132.03985545       
k: 74       xk: [    18.33333333,     15555555.56]    fk: 787.436065889       
k: 84       xk: [    18.33333333,     17777777.78]    fk: 305.911149894       
k: 85       xk: [    22.66666667,     17777777.78]    fk: 209.059066755       
k: 95       xk: [    22.66666667,        20000000]    fk: 27.8403656181       


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 4500.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 22239.4015911       
k: 10       xk: [              1,     2222222.222]    fk: 16006.6548766       
k: 20       xk: [              1,     4444444.445]    fk: 11736.7095249       
k: 21       xk: [    5.333333333,     4444444.445]    fk: 11629.5263753       
k: 30       xk: [              1,     6666666.667]    fk: 9429.56553599       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 8227.09458999       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6093.00001984       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5456.38102007       
k: 51       xk: [    5.333333333,     11111111.11]    fk: 5227.24266481       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3599.7627665        
k: 53       xk: [             14,     11111111.11]    fk: 3384.63692581       
k: 62       xk: [    9.666666667,     13333333.33]    fk: 2678.79926861       
k: 63       xk: [             14,     13333333.33]    fk: 1877.86619918       
k: 73       xk: [             14,     15555555.56]    fk: 1125.8228747        
k: 74       xk: [    18.33333333,     15555555.56]    fk: 788.406910051       
k: 84       xk: [    18.33333333,     17777777.78]    fk: 301.744284287       
k: 85       xk: [    22.66666667,     17777777.78]    fk: 211.168688123       
k: 95       xk: [    22.66666667,        20000000]    fk: 25.5968380882       


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 5000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 22265.9527981       
k: 10       xk: [              1,     2222222.222]    fk: 16024.5330921       
k: 20       xk: [              1,     4444444.445]    fk: 11745.914749        
k: 21       xk: [    5.333333333,     4444444.445]    fk: 11642.5430999       
k: 30       xk: [              1,     6666666.667]    fk: 9430.09776858       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 8233.34407344       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6092.48226213       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5461.2833713        
k: 51       xk: [    5.333333333,     11111111.11]    fk: 5219.95766594       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3599.2529038        
k: 53       xk: [             14,     11111111.11]    fk: 3389.06711592       
k: 62       xk: [    9.666666667,     13333333.33]    fk: 2672.87719197       
k: 63       xk: [             14,     13333333.33]    fk: 1877.87218593       
k: 73       xk: [             14,     15555555.56]    fk: 1121.40465808       
k: 74       xk: [    18.33333333,     15555555.56]    fk: 789.153881201       
k: 84       xk: [    18.33333333,     17777777.78]    fk: 298.804936038       
k: 85       xk: [    22.66666667,     17777777.78]    fk: 212.738219635       
k: 95       xk: [    22.66666667,        20000000]    fk: 24.0436601715       


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 5500.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 22285.6684246       
k: 10       xk: [              1,     2222222.222]    fk: 16037.8117346       
k: 20       xk: [              1,     4444444.445]    fk: 11752.7564073       
k: 21       xk: [    5.333333333,     4444444.445]    fk: 11652.2162592       
k: 30       xk: [              1,     6666666.667]    fk: 9430.50244284       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 8237.99599914       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6092.11295422       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5464.93954502       
k: 51       xk: [    5.333333333,     11111111.11]    fk: 5214.56712442       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3598.89421432       
k: 53       xk: [             14,     11111111.11]    fk: 3392.37647239       
k: 62       xk: [    9.666666667,     13333333.33]    fk: 2668.5036393        
k: 63       xk: [             14,     13333333.33]    fk: 1877.90028838       
k: 73       xk: [             14,     15555555.56]    fk: 1118.15150653       
k: 74       xk: [    18.33333333,     15555555.56]    fk: 789.735049375       
k: 84       xk: [    18.33333333,     17777777.78]    fk: 296.652610163       
k: 85       xk: [    22.66666667,     17777777.78]    fk: 213.932283992       
k: 95       xk: [    22.66666667,        20000000]    fk: 22.9225292581       


Fitting to spin :2@N, frequency 800000000.0 and dispersion point 6000.0
-----------------------------------------------------------------------

Unconstrained grid search size: 100 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 100 grid nodes.
k: 0        xk: [              1,          0.0001]    fk: 22300.7042768       
k: 10       xk: [              1,     2222222.222]    fk: 16047.9402421       
k: 20       xk: [              1,     4444444.445]    fk: 11757.9775703       
k: 21       xk: [    5.333333333,     4444444.445]    fk: 11659.5976491       
k: 30       xk: [              1,     6666666.667]    fk: 9430.81626122       
k: 31       xk: [    5.333333333,     6666666.667]    fk: 8241.55015788       
k: 41       xk: [    5.333333333,     8888888.889]    fk: 6091.83988182       
k: 42       xk: [    9.666666667,     8888888.889]    fk: 5467.73698094       
k: 51       xk: [    5.333333333,     11111111.11]    fk: 5210.46682088       
k: 52       xk: [    9.666666667,     11111111.11]    fk: 3598.63204617       
k: 53       xk: [             14,     11111111.11]    fk: 3394.91161324       
k: 62       xk: [    9.666666667,     13333333.33]    fk: 2665.18186709       
k: 63       xk: [             14,     13333333.33]    fk: 1877.93528697       
k: 73       xk: [             14,     15555555.56]    fk: 1115.68636285       
k: 74       xk: [    18.33333333,     15555555.56]    fk: 790.193466697       
k: 84       xk: [    18.33333333,     17777777.78]    fk: 295.028536792       
k: 85       xk: [    22.66666667,     17777777.78]    fk: 214.859293003       
k: 95       xk: [    22.66666667,        20000000]    fk: 22.0859328754       

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to spin :1@N, frequency 800000000.0 and dispersion point 1000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    5.333333333,       100000000]    fk: 16396.6739886       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    5.333333333,       105000000]    fk: 9552.54194416       

	Parameter values: [3.5976821688184231, 100000002.65736856]
	Function value:   -0.24981135675505334
	Iterations:       84
	Function calls:   164
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    3.597682169,     100000002.7]    fk: 8.85622708756e-10   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597682169,     100000002.7]    fk: -0.00249811269073   

	Parameter values: [3.5976816422625042, 99999999.777887598]
	Function value:   -0.0024981135445100704
	Iterations:       79
	Function calls:   159
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    3.597681642,     99999999.78]    fk: 1.46501248778e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681642,     99999999.78]    fk: -2.49811209417e-05  
	k: 100      xk: [    3.597681637,     99999999.75]    fk: -2.49811210272e-05  

	Parameter values: [3.5976816369915818, 99999999.749058574]
	Function value:   -2.4981121027195763e-05
	Iterations:       103
	Function calls:   224
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    3.597681637,     99999999.75]    fk: 1.45626772472e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: -2.49796793221e-07  

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   -2.4979679322930435e-07
	Iterations:       98
	Function calls:   217
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    3.597681637,     99999999.75]    fk: 1.45626694231e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: -2.48355088973e-09  

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   -2.4835508897317017e-09
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    3.597681637,     99999999.75]    fk: 1.45626695122e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: -1.0418466336e-11   

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   -1.0418466335974962e-11
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    3.597681637,     99999999.75]    fk: 1.45626695122e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: 1.4312857898e-11    

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   1.4312857897982305e-11
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    3.597681637,     99999999.75]    fk: 1.45626695122e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: 1.45601711403e-11   

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   1.456017114032188e-11
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    3.597681637,     99999999.75]    fk: 1.45626695122e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: 1.45626442727e-11   

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   1.4562644272745275e-11
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    3.597681637,     99999999.75]    fk: 1.45626695122e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: 1.45626690041e-11   

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   1.4562669004069504e-11
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    3.597681637,     99999999.75]    fk: 1.45626695122e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: 1.45626692514e-11   

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   1.4562669251382753e-11
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    3.597681637,     99999999.75]    fk: 1.45626695122e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: 1.45626692539e-11   

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   1.4562669253855884e-11
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    3.597681637,     99999999.75]    fk: 1.45626695122e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: 1.45626692539e-11   

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   1.4562669253880615e-11
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    3.597681637,     99999999.75]    fk: 1.45626695122e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: 1.45626692539e-11   

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   1.4562669253880861e-11
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    3.597681637,     99999999.75]    fk: 1.45626695122e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.597681637,     99999999.75]    fk: 1.45626692539e-11   

	Parameter values: [3.5976816369392539, 99999999.748768359]
	Function value:   1.4562669253880864e-11
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [3.5976816369392539, 99999999.748768359]
Function value:   1.4562669253880864e-11
Iterations:       1431
Function calls:   3052
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :1@N, frequency 800000000.0 and dispersion point 1500.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              1,     88888888.89]    fk: 12526.6400435       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           1.05,     88888888.89]    fk: 11983.4577115       

	Parameter values: [2.857305288717181, 100000002.87012412]
	Function value:   -0.24754487432065098
	Iterations:       94
	Function calls:   189
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    2.857305289,     100000002.9]    fk: 1.1968323662e-09    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857305289,     100000002.9]    fk: -0.00247544755828   

	Parameter values: [2.8573047134767915, 99999999.6029993]
	Function value:   -0.0024754487021445165
	Iterations:       76
	Function calls:   155
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    2.857304713,      99999999.6]    fk: 2.99234043014e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304713,      99999999.6]    fk: -2.47544573973e-05  

	Parameter values: [2.8573047077150724, 99999999.570247531]
	Function value:   -2.4754457511986918e-05
	Iterations:       98
	Function calls:   216
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    2.857304708,     99999999.57]    fk: 2.98063768987e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: -2.47515066807e-07  

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   -2.4751506681690269e-07
	Iterations:       94
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    2.857304708,     99999999.57]    fk: 2.98063665314e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: -2.4456423653e-09   

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   -2.4456423653028924e-09
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    2.857304708,     99999999.57]    fk: 2.98063669059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: 5.05187921311e-12   

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   5.0518792131053751e-12
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    2.857304708,     99999999.57]    fk: 2.98063669059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: 2.95588216583e-11   

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   2.9558821658265353e-11
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    2.857304708,     99999999.57]    fk: 2.98063669059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: 2.98038910827e-11   

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   2.9803891082716957e-11
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    2.857304708,     99999999.57]    fk: 2.98063669059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: 2.9806341777e-11    

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   2.9806341776961462e-11
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    2.857304708,     99999999.57]    fk: 2.98063669059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: 2.98063662839e-11   

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   2.980636628390391e-11
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    2.857304708,     99999999.57]    fk: 2.98063669059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: 2.9806366529e-11    

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   2.9806366528973337e-11
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    2.857304708,     99999999.57]    fk: 2.98063669059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: 2.98063665314e-11   

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   2.9806366531424034e-11
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    2.857304708,     99999999.57]    fk: 2.98063669059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: 2.98063665314e-11   

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   2.9806366531448532e-11
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    2.857304708,     99999999.57]    fk: 2.98063669059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: 2.98063665314e-11   

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   2.9806366531448784e-11
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    2.857304708,     99999999.57]    fk: 2.98063669059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.857304708,     99999999.57]    fk: 2.98063665314e-11   

	Parameter values: [2.8573047076643481, 99999999.569956869]
	Function value:   2.9806366531448784e-11
	Iterations:       91
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [2.8573047076643481, 99999999.569956869]
Function value:   2.9806366531448784e-11
Iterations:       1363
Function calls:   2903
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :1@N, frequency 800000000.0 and dispersion point 2000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              1,     88888888.89]    fk: 10459.1228454       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           1.05,     88888888.89]    fk: 10140.8631988       

	Parameter values: [2.5932814444751706, 100000002.84983467]
	Function value:   -0.24658870838979327
	Iterations:       87
	Function calls:   169
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    2.593281444,     100000002.8]    fk: 1.35871766914e-09   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593281444,     100000002.8]    fk: -0.00246588573857   

	Parameter values: [2.5932808424167435, 99999999.38577868]
	Function value:   -0.0024658870442174218
	Iterations:       82
	Function calls:   171
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    2.593280842,     99999999.39]    fk: 2.68945563963e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280842,     99999999.39]    fk: -2.46588438166e-05  
	k: 100      xk: [    2.593280836,     99999999.35]    fk: -2.46588439472e-05  

	Parameter values: [2.5932808363948867, 99999999.351118878]
	Function value:   -2.4658843947188548e-05
	Iterations:       101
	Function calls:   216
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    2.593280836,     99999999.35]    fk: 2.67612935616e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: -2.46561945792e-07  

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   -2.4656194580453754e-07
	Iterations:       91
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    2.593280836,     99999999.35]    fk: 2.67612801919e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: -2.43912579083e-09  

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   -2.4391257908334888e-09
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    2.593280836,     99999999.35]    fk: 2.67612801973e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: 2.10240930355e-12   

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   2.1024093035520777e-12
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    2.593280836,     99999999.35]    fk: 2.67612801973e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: 2.65146913049e-11   

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   2.6514691304922485e-11
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    2.593280836,     99999999.35]    fk: 2.67612801973e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: 2.67588141249e-11   

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   2.675881412493619e-11
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    2.593280836,     99999999.35]    fk: 2.67612801973e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: 2.67612553531e-11   

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   2.6761255353136326e-11
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    2.593280836,     99999999.35]    fk: 2.67612801973e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: 2.67612797654e-11   

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   2.6761279765418327e-11
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    2.593280836,     99999999.35]    fk: 2.67612801973e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: 2.67612800095e-11   

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   2.6761280009541149e-11
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    2.593280836,     99999999.35]    fk: 2.67612801973e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: 2.6761280012e-11    

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   2.6761280011982376e-11
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    2.593280836,     99999999.35]    fk: 2.67612801973e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: 2.6761280012e-11    

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   2.676128001200679e-11
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    2.593280836,     99999999.35]    fk: 2.67612801973e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: 2.6761280012e-11    

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   2.6761280012007033e-11
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    2.593280836,     99999999.35]    fk: 2.67612801973e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.593280836,     99999999.35]    fk: 2.6761280012e-11    

	Parameter values: [2.5932808363337427, 99999999.350772321]
	Function value:   2.6761280012007036e-11
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [2.5932808363337427, 99999999.350772321]
Function value:   2.6761280012007036e-11
Iterations:       1395
Function calls:   2986
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :1@N, frequency 800000000.0 and dispersion point 2500.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              1,     88888888.89]    fk: 9853.85097302       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [              1,     93333333.33]    fk: 8597.58229757       

	Parameter values: [2.4701992480909514, 100000003.38119099]
	Function value:   -0.24610868911031003
	Iterations:       88
	Function calls:   172
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    2.470199248,     100000003.4]    fk: 1.44198420204e-09   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470199248,     100000003.4]    fk: -0.00246108546348   

	Parameter values: [2.4701986312021411, 99999999.810015142]
	Function value:   -0.0024610868608457154
	Iterations:       79
	Function calls:   157
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    2.470198631,     99999999.81]    fk: 1.64457750743e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198631,     99999999.81]    fk: -2.46108523272e-05  
	k: 100      xk: [    2.470198625,     99999999.77]    fk: -2.46108524668e-05  

	Parameter values: [2.4701986250336563, 99999999.774311572]
	Function value:   -2.4610852466847708e-05
	Iterations:       102
	Function calls:   217
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    2.470198625,     99999999.77]    fk: 1.63032440187e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: -2.46092384457e-07  

	Parameter values: [2.4701986249669341, 99999999.773962855]
	Function value:   -2.4609238447014243e-07
	Iterations:       96
	Function calls:   210
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    2.470198625,     99999999.77]    fk: 1.63032311532e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: -2.44478364654e-09  

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   -2.4447836471259372e-09
	Iterations:       94
	Function calls:   200
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    2.470198625,     99999999.77]    fk: 1.63032302759e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: -8.30763888977e-12  

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   -8.3076388897690381e-12
	Iterations:       95
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    2.470198625,     99999999.77]    fk: 1.63032299487e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: 1.60571211926e-11   

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   1.6057121192592642e-11
	Iterations:       95
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    2.470198625,     99999999.77]    fk: 1.63032299487e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: 1.63007687934e-11   

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   1.6300768793416255e-11
	Iterations:       95
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    2.470198625,     99999999.77]    fk: 1.63032299487e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: 1.63032052694e-11   

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   1.6303205269424497e-11
	Iterations:       95
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    2.470198625,     99999999.77]    fk: 1.63032299487e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: 1.63032296342e-11   

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   1.6303229634184574e-11
	Iterations:       95
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    2.470198625,     99999999.77]    fk: 1.63032299487e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: 1.63032298778e-11   

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   1.6303229877832178e-11
	Iterations:       95
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    2.470198625,     99999999.77]    fk: 1.63032299487e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: 1.63032298803e-11   

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   1.6303229880268652e-11
	Iterations:       95
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    2.470198625,     99999999.77]    fk: 1.63032299487e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: 1.63032298803e-11   

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   1.6303229880293018e-11
	Iterations:       95
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    2.470198625,     99999999.77]    fk: 1.63032299487e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: 1.63032298803e-11   

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   1.630322988029326e-11
	Iterations:       95
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    2.470198625,     99999999.77]    fk: 1.63032299487e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.470198625,     99999999.77]    fk: 1.63032298803e-11   

	Parameter values: [2.4701986249704362, 99999999.773927867]
	Function value:   1.6303229880293263e-11
	Iterations:       95
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [2.4701986249704362, 99999999.773927867]
Function value:   1.6303229880293263e-11
Iterations:       1409
Function calls:   2976
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :1@N, frequency 800000000.0 and dispersion point 3000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              1,     88888888.89]    fk: 9625.06724939       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [              1,     93333333.33]    fk: 7753.42427916       

	Parameter values: [2.4031051624133917, 100000003.26929142]
	Function value:   -0.2458367141432658
	Iterations:       91
	Function calls:   174
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    2.403105162,     100000003.3]    fk: 1.5193964009e-09    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.403105162,     100000003.3]    fk: -0.00245836563773   

	Parameter values: [2.4031045365244155, 99999999.634551615]
	Function value:   -0.0024583670912182078
	Iterations:       73
	Function calls:   147
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    2.403104537,     99999999.63]    fk: 3.60407885945e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.403104537,     99999999.63]    fk: -2.45836352322e-05  

	Parameter values: [2.4031045302791263, 99999999.598327011]
	Function value:   -2.4583635376917307e-05
	Iterations:       91
	Function calls:   199
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [     2.40310453,      99999999.6]    fk: 3.58927399125e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: -2.45800819957e-07  
	k: 100      xk: [     2.40310453,      99999999.6]    fk: -2.45800819972e-07  

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   -2.4580081997218434e-07
	Iterations:       104
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [     2.40310453,      99999999.6]    fk: 3.58927245885e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: -2.42247440286e-09  

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   -2.4224744028641211e-09
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [     2.40310453,      99999999.6]    fk: 3.5892724947e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: 1.13090528291e-11   

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   1.1309052829080963e-11
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [     2.40310453,      99999999.6]    fk: 3.5892724947e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: 3.5646887386e-11    

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   3.5646887386012984e-11
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [     2.40310453,      99999999.6]    fk: 3.5892724947e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: 3.58902657316e-11   

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   3.5890265731582305e-11
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [     2.40310453,      99999999.6]    fk: 3.5892724947e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: 3.5892699515e-11    

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   3.5892699515037997e-11
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [     2.40310453,      99999999.6]    fk: 3.5892724947e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: 3.58927238529e-11   

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   3.5892723852872551e-11
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [     2.40310453,      99999999.6]    fk: 3.5892724947e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: 3.58927240963e-11   

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   3.5892724096250905e-11
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [     2.40310453,      99999999.6]    fk: 3.5892724947e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: 3.58927240987e-11   

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   3.5892724098684683e-11
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [     2.40310453,      99999999.6]    fk: 3.5892724947e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: 3.58927240987e-11   

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   3.589272409870902e-11
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [     2.40310453,      99999999.6]    fk: 3.5892724947e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: 3.58927240987e-11   

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   3.5892724098709266e-11
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [     2.40310453,      99999999.6]    fk: 3.5892724947e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.40310453,      99999999.6]    fk: 3.58927240987e-11   

	Parameter values: [2.4031045302192551, 99999999.597949773]
	Function value:   3.5892724098709266e-11
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [2.4031045302192551, 99999999.597949773]
Function value:   3.5892724098709266e-11
Iterations:       1349
Function calls:   2884
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :1@N, frequency 800000000.0 and dispersion point 3500.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              1,     88888888.89]    fk: 9522.35870009       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [              1,     93333333.33]    fk: 7276.99859278       

	Parameter values: [2.3625694541861613, 100000003.5143768]
	Function value:   -0.24566864598073873
	Iterations:       95
	Function calls:   186
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    2.362569454,     100000003.5]    fk: 1.52792211206e-09   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362569454,     100000003.5]    fk: -0.00245668494721   

	Parameter values: [2.3625688226950756, 99999999.839396179]
	Function value:   -0.0024566864363255157
	Iterations:       96
	Function calls:   215
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    2.362568823,     99999999.84]    fk: 8.67614266654e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568823,     99999999.84]    fk: -2.45668557739e-05  
	k: 100      xk: [    2.362568816,      99999999.8]    fk: -2.45668559226e-05  

	Parameter values: [2.3625688163842553, 99999999.802652866]
	Function value:   -2.456685592262951e-05
	Iterations:       106
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    2.362568816,      99999999.8]    fk: 8.5243805356e-12    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: -2.4566012009e-07   
	k: 100      xk: [    2.362568816,      99999999.8]    fk: -2.45660120105e-07  

	Parameter values: [2.3625688163211498, 99999999.802291006]
	Function value:   -2.4566012010476908e-07
	Iterations:       103
	Function calls:   218
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    2.362568816,      99999999.8]    fk: 8.52436502994e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: -2.44816207967e-09  

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   -2.4481620797241982e-09
	Iterations:       98
	Function calls:   211
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    2.362568816,      99999999.8]    fk: 8.52436513376e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: -1.60424994732e-11  

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   -1.6042499473186002e-11
	Iterations:       88
	Function calls:   196
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: 8.27869632932e-12   

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   8.2786963293241195e-12
	Iterations:       88
	Function calls:   196
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: 8.52190828735e-12   

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   8.5219082873492223e-12
	Iterations:       88
	Function calls:   196
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: 8.52434040693e-12   

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   8.5243404069294728e-12
	Iterations:       88
	Function calls:   196
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: 8.52436472813e-12   

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   8.5243647281252743e-12
	Iterations:       88
	Function calls:   196
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: 8.52436497134e-12   

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   8.5243649713372332e-12
	Iterations:       88
	Function calls:   196
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: 8.52436497377e-12   

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   8.5243649737693526e-12
	Iterations:       88
	Function calls:   196
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   8.5243649737936737e-12
	Iterations:       88
	Function calls:   196
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   8.5243649737939176e-12
	Iterations:       88
	Function calls:   196
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.362568816,      99999999.8]    fk: 8.52436497379e-12   

	Parameter values: [2.3625688163211871, 99999999.802291393]
	Function value:   8.5243649737939193e-12
	Iterations:       88
	Function calls:   196
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [2.3625688163211871, 99999999.802291393]
Function value:   8.52436497379392e-12
Iterations:       1378
Function calls:   3009
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :1@N, frequency 800000000.0 and dispersion point 4000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              1,     88888888.89]    fk: 9470.17529234       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [              1,     93333333.33]    fk: 6981.17647146       

	Parameter values: [2.3362278367383231, 100000003.54447472]
	Function value:   -0.24555785683095499
	Iterations:       85
	Function calls:   169
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    2.336227837,     100000003.5]    fk: 1.56238250116e-09   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227837,     100000003.5]    fk: -0.00245557702165   

	Parameter values: [2.3362272014657166, 99999999.842773259]
	Function value:   -0.002455578534845728
	Iterations:       77
	Function calls:   154
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    2.336227201,     99999999.84]    fk: 1.8514507716e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227201,     99999999.84]    fk: -2.45557670195e-05  
	k: 100      xk: [    2.336227195,     99999999.81]    fk: -2.45557671706e-05  

	Parameter values: [2.3362271951205611, 99999999.805831283]
	Function value:   -2.455576717055628e-05
	Iterations:       101
	Function calls:   218
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    2.336227195,     99999999.81]    fk: 1.83599887554e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: -2.45539495317e-07  

	Parameter values: [2.3362271950566171, 99999999.805439472]
	Function value:   -2.4553949533305815e-07
	Iterations:       98
	Function calls:   211
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    2.336227195,     99999999.81]    fk: 1.83599724734e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: -2.43721858097e-09  

	Parameter values: [2.3362271950565257, 99999999.805438846]
	Function value:   -2.4372185809749658e-09
	Iterations:       90
	Function calls:   195
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    2.336227195,     99999999.81]    fk: 1.83599723225e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: -6.1958134541e-12   

	Parameter values: [2.3362271950559617, 99999999.805433154]
	Function value:   -6.1958135470520515e-12
	Iterations:       94
	Function calls:   204
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    2.336227195,     99999999.81]    fk: 1.83599721007e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: 1.81144141282e-11   

	Parameter values: [2.3362271950559617, 99999999.805433154]
	Function value:   1.8114414128156299e-11
	Iterations:       100
	Function calls:   220
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: 1.83575164049e-11   

	Parameter values: [2.3362271950559617, 99999999.805433154]
	Function value:   1.8357516404908379e-11
	Iterations:       100
	Function calls:   220
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: 1.83599474277e-11   

	Parameter values: [2.3362271950559617, 99999999.805433154]
	Function value:   1.8359947427675906e-11
	Iterations:       100
	Function calls:   220
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 9        xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: 1.83599717379e-11   

	Parameter values: [2.3362271950559617, 99999999.805433154]
	Function value:   1.8359971737903576e-11
	Iterations:       100
	Function calls:   220
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 10       xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: 1.8359971981e-11    

	Parameter values: [2.3362271950559617, 99999999.805433154]
	Function value:   1.8359971981005857e-11
	Iterations:       100
	Function calls:   220
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 11       xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: 1.83599719834e-11   

	Parameter values: [2.3362271950559617, 99999999.805433154]
	Function value:   1.8359971983436876e-11
	Iterations:       100
	Function calls:   220
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 12       xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   

	Parameter values: [2.3362271950559617, 99999999.805433154]
	Function value:   1.8359971983461188e-11
	Iterations:       100
	Function calls:   220
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 13       xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   

	Parameter values: [2.3362271950559617, 99999999.805433154]
	Function value:   1.835997198346143e-11
	Iterations:       100
	Function calls:   220
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 14       xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.336227195,     99999999.81]    fk: 1.83599719835e-11   

	Parameter values: [2.3362271950559617, 99999999.805433154]
	Function value:   1.8359971983461433e-11
	Iterations:       100
	Function calls:   220
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [2.3362271950559617, 99999999.805433154]
Function value:   1.8359971983461433e-11
Iterations:       1445
Function calls:   3131
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :1@N, frequency 800000000.0 and dispersion point 4500.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              1,     88888888.89]    fk: 9441.06941748       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [              1,     93333333.33]    fk: 6784.53868636       

	Parameter values: [2.3181534476629149, 100000003.66801403]
	Function value:   -0.2454811046731831
	Iterations:       86
	Function calls:   166
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    2.318153448,     100000003.7]    fk: 1.57013543127e-09   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318153448,     100000003.7]    fk: -0.00245480949147   

	Parameter values: [2.3181528096457953, 99999999.946967959]
	Function value:   -0.0024548110220793469
	Iterations:       77
	Function calls:   152
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [     2.31815281,     99999999.95]    fk: 9.441343692e-12     
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.31815281,     99999999.95]    fk: -2.45481008739e-05  

	Parameter values: [2.3181528032726604, 99999999.909832865]
	Function value:   -2.4548101026595383e-05
	Iterations:       98
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    2.318152803,     99999999.91]    fk: 9.28552324201e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: -2.45471817598e-07  

	Parameter values: [2.3181528032112944, 99999999.909496158]
	Function value:   -2.4547181761361329e-07
	Iterations:       99
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    2.318152803,     99999999.91]    fk: 9.28550765002e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: -2.44552552394e-09  

	Parameter values: [2.3181528032098377, 99999999.909476578]
	Function value:   -2.4455255240609008e-09
	Iterations:       99
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [    2.318152803,     99999999.91]    fk: 9.28550714788e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: -1.52626031642e-11  

	Parameter values: [2.3181528032098289, 99999999.909476489]
	Function value:   -1.5262603203026836e-11
	Iterations:       92
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    2.318152803,     99999999.91]    fk: 9.28550711364e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: 9.04002600594e-12   

	Parameter values: [2.3181528032098289, 99999999.909476489]
	Function value:   9.0400260059401139e-12
	Iterations:       89
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    2.318152803,     99999999.91]    fk: 9.28550748307e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: 9.28305229803e-12   

	Parameter values: [2.3181528032098289, 99999999.909476489]
	Function value:   9.283052298029782e-12
	Iterations:       89
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    2.318152803,     99999999.91]    fk: 9.28550748307e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: 9.28548256095e-12   

	Parameter values: [2.3181528032098289, 99999999.909476489]
	Function value:   9.2854825609506798e-12
	Iterations:       89
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    2.318152803,     99999999.91]    fk: 9.28550748307e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: 9.28550686358e-12   

	Parameter values: [2.3181528032098289, 99999999.909476489]
	Function value:   9.285506863579889e-12
	Iterations:       89
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    2.318152803,     99999999.91]    fk: 9.28550748307e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: 9.28550710661e-12   

	Parameter values: [2.3181528032098289, 99999999.909476489]
	Function value:   9.2855071066061815e-12
	Iterations:       89
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    2.318152803,     99999999.91]    fk: 9.28550748307e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: 9.28550710904e-12   

	Parameter values: [2.3181528032098289, 99999999.909476489]
	Function value:   9.2855071090364446e-12
	Iterations:       89
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    2.318152803,     99999999.91]    fk: 9.28550748307e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: 9.28550710906e-12   

	Parameter values: [2.3181528032098289, 99999999.909476489]
	Function value:   9.2855071090607462e-12
	Iterations:       89
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    2.318152803,     99999999.91]    fk: 9.28550748307e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: 9.28550710906e-12   

	Parameter values: [2.3181528032098289, 99999999.909476489]
	Function value:   9.2855071090609902e-12
	Iterations:       89
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    2.318152803,     99999999.91]    fk: 9.28550748307e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.318152803,     99999999.91]    fk: 9.28550710906e-12   

	Parameter values: [2.3181528032098289, 99999999.909476489]
	Function value:   9.2855071090609918e-12
	Iterations:       89
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [2.3181528032098289, 99999999.909476489]
Function value:   9.285507109060992e-12
Iterations:       1352
Function calls:   2926
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :1@N, frequency 800000000.0 and dispersion point 5000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              1,     88888888.89]    fk: 9423.60763081       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [              1,     93333333.33]    fk: 6646.99428111       

	Parameter values: [2.3052175024512076, 100000003.55441533]
	Function value:   -0.24542579992357028
	Iterations:       85
	Function calls:   165
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    2.305217502,     100000003.6]    fk: 1.59157718442e-09   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305217502,     100000003.6]    fk: -0.00245425642409   

	Parameter values: [2.3052168625697536, 99999999.820455626]
	Function value:   -0.002454257966757026
	Iterations:       79
	Function calls:   162
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    2.305216863,     99999999.82]    fk: 1.72210862226e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216863,     99999999.82]    fk: -2.45425626188e-05  

	Parameter values: [2.3052168561768136, 99999999.783160895]
	Function value:   -2.4542562772852377e-05
	Iterations:       99
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    2.305216856,     99999999.78]    fk: 1.70638148328e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: -2.45408734552e-07  

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   -2.4540873456911708e-07
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    2.305216856,     99999999.78]    fk: 1.70637974494e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: -2.43719418644e-09  

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   -2.437194186436289e-09
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    2.305216856,     99999999.78]    fk: 1.70637979966e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: -7.47878260948e-12  

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   -7.4787826094812585e-12
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    2.305216856,     99999999.78]    fk: 1.70637979966e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: 1.68183714288e-11   

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   1.6818371428786819e-11
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    2.305216856,     99999999.78]    fk: 1.70637979966e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: 1.70613429692e-11   

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   1.7061342969169502e-11
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    2.305216856,     99999999.78]    fk: 1.70637979966e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: 1.70637726846e-11   

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   1.7063772684573328e-11
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    2.305216856,     99999999.78]    fk: 1.70637979966e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: 1.70637969817e-11   

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   1.7063796981727365e-11
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    2.305216856,     99999999.78]    fk: 1.70637979966e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: 1.70637972247e-11   

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   1.706379722469891e-11
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    2.305216856,     99999999.78]    fk: 1.70637979966e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: 1.70637972271e-11   

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   1.7063797227128624e-11
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    2.305216856,     99999999.78]    fk: 1.70637979966e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: 1.70637972272e-11   

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   1.7063797227152919e-11
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    2.305216856,     99999999.78]    fk: 1.70637979966e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: 1.70637972272e-11   

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   1.7063797227153162e-11
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    2.305216856,     99999999.78]    fk: 1.70637979966e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.305216856,     99999999.78]    fk: 1.70637972272e-11   

	Parameter values: [2.3052168561108597, 99999999.782767057]
	Function value:   1.7063797227153165e-11
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [2.3052168561108597, 99999999.782767057]
Function value:   1.7063797227153165e-11
Iterations:       1382
Function calls:   2956
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :1@N, frequency 800000000.0 and dispersion point 5500.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              1,     88888888.89]    fk: 9412.5016654        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [              1,     93333333.33]    fk: 6546.90774691       

	Parameter values: [2.2956424459249347, 100000003.52286243]
	Function value:   -0.24538466127674416
	Iterations:       86
	Function calls:   174
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    2.295642446,     100000003.5]    fk: 1.59889358433e-09   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295642446,     100000003.5]    fk: -0.00245384502987   

	Parameter values: [2.295641804500181, 99999999.778362244]
	Function value:   -0.0024538465822694202
	Iterations:       79
	Function calls:   156
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    2.295641805,     99999999.78]    fk: 1.5126224173e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641805,     99999999.78]    fk: -2.45384508481e-05  

	Parameter values: [2.2956417980977841, 99999999.740944564]
	Function value:   -2.4538451002923509e-05
	Iterations:       98
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    2.295641798,     99999999.74]    fk: 1.49678984067e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: -2.4536969181e-07   
	k: 100      xk: [    2.295641798,     99999999.74]    fk: -2.45369691826e-07  

	Parameter values: [2.2956417980381976, 99999999.740659237]
	Function value:   -2.4536969182608786e-07
	Iterations:       101
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    2.295641798,     99999999.74]    fk: 1.4967881867e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: -2.43887871523e-09  

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   -2.4388787155992596e-09
	Iterations:       90
	Function calls:   200
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    2.295641798,     99999999.74]    fk: 1.49678819636e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: -9.57058449082e-12  

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   -9.5705844908154328e-12
	Iterations:       92
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    2.295641798,     99999999.74]    fk: 1.49678815358e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: 1.47224968203e-11   

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   1.4722496820269003e-11
	Iterations:       92
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    2.295641798,     99999999.74]    fk: 1.49678815358e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: 1.49654276334e-11   

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   1.4965427633379848e-11
	Iterations:       92
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    2.295641798,     99999999.74]    fk: 1.49678815358e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: 1.49678569415e-11   

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   1.4967856941510959e-11
	Iterations:       92
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    2.295641798,     99999999.74]    fk: 1.49678815358e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: 1.49678812346e-11   

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   1.4967881234592269e-11
	Iterations:       92
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    2.295641798,     99999999.74]    fk: 1.49678815358e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: 1.49678814775e-11   

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   1.4967881477523082e-11
	Iterations:       92
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    2.295641798,     99999999.74]    fk: 1.49678815358e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: 1.496788148e-11     

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   1.4967881479952392e-11
	Iterations:       92
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    2.295641798,     99999999.74]    fk: 1.49678815358e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: 1.496788148e-11     

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   1.4967881479976684e-11
	Iterations:       92
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    2.295641798,     99999999.74]    fk: 1.49678815358e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: 1.496788148e-11     

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   1.4967881479976926e-11
	Iterations:       92
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    2.295641798,     99999999.74]    fk: 1.49678815358e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.295641798,     99999999.74]    fk: 1.496788148e-11     

	Parameter values: [2.2956417980374537, 99999999.740602463]
	Function value:   1.496788147997693e-11
	Iterations:       92
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [2.2956417980374537, 99999999.740602463]
Function value:   1.496788147997693e-11
Iterations:       1374
Function calls:   2928
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :1@N, frequency 800000000.0 and dispersion point 6000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              1,     88888888.89]    fk: 9405.0922663        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [              1,     93333333.33]    fk: 6471.74518019       

	Parameter values: [2.2883575817681971, 100000003.61030942]
	Function value:   -0.24535324584442952
	Iterations:       83
	Function calls:   161
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    2.288357582,     100000003.6]    fk: 1.60401491662e-09   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288357582,     100000003.6]    fk: -0.00245353087031   

	Parameter values: [2.2883569393083611, 99999999.858748779]
	Function value:   -0.0024535324295030239
	Iterations:       83
	Function calls:   167
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    2.288356939,     99999999.86]    fk: 1.34812572032e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356939,     99999999.86]    fk: -2.45353109486e-05  

	Parameter values: [2.2883569328838753, 99999999.821224749]
	Function value:   -2.4535311104482465e-05
	Iterations:       93
	Function calls:   192
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    2.288356933,     99999999.82]    fk: 1.33222101553e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: -2.45339922057e-07  

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   -2.4533992207224178e-07
	Iterations:       96
	Function calls:   200
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    2.288356933,     99999999.82]    fk: 1.33221943974e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: -2.4402102483e-09   

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   -2.4402102483033056e-09
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    2.288356933,     99999999.82]    fk: 1.33221948382e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: -1.12131300639e-11  

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   -1.1213130063921018e-11
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    2.288356933,     99999999.82]    fk: 1.33221948382e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: 1.30768411185e-11   

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   1.3076841118472831e-11
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    2.288356933,     99999999.82]    fk: 1.33221948382e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: 1.33197408303e-11   

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   1.3319740830296769e-11
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    2.288356933,     99999999.82]    fk: 1.33221948382e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: 1.33221698274e-11   

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   1.3322169827415007e-11
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    2.288356933,     99999999.82]    fk: 1.33221948382e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: 1.33221941174e-11   

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   1.332219411738619e-11
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    2.288356933,     99999999.82]    fk: 1.33221948382e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: 1.33221943603e-11   

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   1.3322194360285903e-11
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    2.288356933,     99999999.82]    fk: 1.33221948382e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: 1.33221943627e-11   

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   1.3322194362714901e-11
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    2.288356933,     99999999.82]    fk: 1.33221948382e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: 1.33221943627e-11   

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   1.332219436273919e-11
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    2.288356933,     99999999.82]    fk: 1.33221948382e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: 1.33221943627e-11   

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   1.3322194362739434e-11
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    2.288356933,     99999999.82]    fk: 1.33221948382e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.288356933,     99999999.82]    fk: 1.33221943627e-11   

	Parameter values: [2.2883569328185507, 99999999.820829749]
	Function value:   1.3322194362739435e-11
	Iterations:       93
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [2.2883569328185507, 99999999.820829749]
Function value:   1.3322194362739435e-11
Iterations:       1378
Function calls:   2942
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 1000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    31.33333333,        20000000]    fk: 18.6405640974       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    31.33333333,        20000000]    fk: 18.3867256003       

	Parameter values: [29.390779744161435, 20000014.444017567]
	Function value:   -0.25331299171162025
	Iterations:       70
	Function calls:   138
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    29.39077974,     20000014.44]    fk: 1.07324048677e-08   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39077974,     20000014.44]    fk: -0.00253311929228   

	Parameter values: [29.390729655225112, 20000000.27265694]
	Function value:   -0.0025331297823723989
	Iterations:       91
	Function calls:   202
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    29.39072966,     20000000.27]    fk: 3.01433231379e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072966,     20000000.27]    fk: -2.53312679818e-05  

	Parameter values: [29.390729154322511, 20000000.13091141]
	Function value:   -2.5331269030939303e-05
	Iterations:       92
	Function calls:   206
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    29.39072915,     20000000.13]    fk: 2.90730237513e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: -2.53283908016e-07  

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   -2.5328390811981285e-07
	Iterations:       98
	Function calls:   207
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    29.39072915,     20000000.13]    fk: 2.90729177066e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: -2.50405689267e-09  

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   -2.5040568926728002e-09
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    29.39072915,     20000000.13]    fk: 2.90729177221e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: 3.7416195986e-12    

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   3.7416195986002934e-12
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    29.39072915,     20000000.13]    fk: 2.90729177221e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: 2.88196047213e-11   

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   2.88196047213143e-11
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    29.39072915,     20000000.13]    fk: 2.90729177221e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: 2.90703845725e-11   

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   2.9070384572541438e-11
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    29.39072915,     20000000.13]    fk: 2.90729177221e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: 2.90728923711e-11   

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   2.9072892371053711e-11
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    29.39072915,     20000000.13]    fk: 2.90729177221e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: 2.9072917449e-11    

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   2.9072917449038831e-11
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    29.39072915,     20000000.13]    fk: 2.90729177221e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: 2.90729176998e-11   

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   2.9072917699818683e-11
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    29.39072915,     20000000.13]    fk: 2.90729177221e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: 2.90729177023e-11   

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   2.9072917702326481e-11
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    29.39072915,     20000000.13]    fk: 2.90729177221e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: 2.90729177024e-11   

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   2.9072917702351562e-11
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    29.39072915,     20000000.13]    fk: 2.90729177221e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: 2.90729177024e-11   

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   2.9072917702351811e-11
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    29.39072915,     20000000.13]    fk: 2.90729177221e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    29.39072915,     20000000.13]    fk: 2.90729177024e-11   

	Parameter values: [29.390729149332191, 20000000.129492134]
	Function value:   2.9072917702351814e-11
	Iterations:       93
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [29.390729149332191, 20000000.129492134]
Function value:   2.9072917702351814e-11
Iterations:       1374
Function calls:   2986
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 1500.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [             27,        20000000]    fk: 2.27649290281       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [             27,        20000000]    fk: 2.02388918989       

	Parameter values: [26.429264697726552, 20000013.882497448]
	Function value:   -0.25242299599443341
	Iterations:       64
	Function calls:   128
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [     26.4292647,     20000013.88]    fk: 1.04642203725e-08   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292647,     20000013.88]    fk: -0.00252421960204   

	Parameter values: [26.429221636535473, 20000000.233622931]
	Function value:   -0.002524229816694745
	Iterations:       74
	Function calls:   147
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    26.42922164,     20000000.23]    fk: 4.15087756477e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    26.42922164,     20000000.23]    fk: -2.52422570726e-05  

	Parameter values: [26.429221205812688, 20000000.09708932]
	Function value:   -2.524225809472286e-05
	Iterations:       97
	Function calls:   217
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    26.42922121,      20000000.1]    fk: 4.04666762813e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    26.42922121,      20000000.1]    fk: -2.52382518938e-07  

	Parameter values: [26.429221201516075, 20000000.095724665]
	Function value:   -2.523825190403623e-07
	Iterations:       90
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [     26.4292212,      20000000.1]    fk: 4.04665716116e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: -2.48376328455e-09  

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   -2.4837632845665236e-09
	Iterations:       92
	Function calls:   197
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [     26.4292212,      20000000.1]    fk: 4.04665715527e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: 1.52242729915e-11   

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   1.522427299154722e-11
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [     26.4292212,      20000000.1]    fk: 4.04665715809e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: 4.02141485671e-11   

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   4.0214148567127933e-11
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [     26.4292212,      20000000.1]    fk: 4.04665715809e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: 4.04640473229e-11   

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   4.0464047322883734e-11
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [     26.4292212,      20000000.1]    fk: 4.04665715809e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: 4.04665463104e-11   

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   4.0466546310441291e-11
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [     26.4292212,      20000000.1]    fk: 4.04665715809e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: 4.04665713003e-11   

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   4.0466571300316867e-11
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [     26.4292212,      20000000.1]    fk: 4.04665715809e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: 4.04665715502e-11   

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   4.0466571550215626e-11
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [     26.4292212,      20000000.1]    fk: 4.04665715809e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: 4.04665715527e-11   

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   4.046657155271461e-11
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [     26.4292212,      20000000.1]    fk: 4.04665715809e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: 4.04665715527e-11   

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   4.04665715527396e-11
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [     26.4292212,      20000000.1]    fk: 4.04665715809e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: 4.04665715527e-11   

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   4.0466571552739852e-11
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [     26.4292212,      20000000.1]    fk: 4.04665715809e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     26.4292212,      20000000.1]    fk: 4.04665715527e-11   

	Parameter values: [26.429221201505989, 20000000.09572196]
	Function value:   4.0466571552739852e-11
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [26.429221201505989, 20000000.09572196]
Function value:   4.046657155273985e-11
Iterations:       1417
Function calls:   3016
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 2000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [             27,        20000000]    fk: 19.5377229608       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [             27,        20000000]    fk: 19.2851192479       

	Parameter values: [25.373166852290268, 20000013.620190509]
	Function value:   -0.25207585986462455
	Iterations:       67
	Function calls:   134
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    25.37316685,     20000013.62]    fk: 1.0339889322e-08    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37316685,     20000013.62]    fk: -0.00252074836512   

	Parameter values: [25.373126244069031, 20000000.175035521]
	Function value:   -0.0025207584628508532
	Iterations:       74
	Function calls:   144
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    25.37312624,     20000000.18]    fk: 3.51467572323e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312624,     20000000.18]    fk: -2.52075498312e-05  

	Parameter values: [25.373125837957787, 20000000.040492907]
	Function value:   -2.5207550841507015e-05
	Iterations:       87
	Function calls:   183
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    25.37312584,     20000000.04]    fk: 3.41180826457e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312584,     20000000.04]    fk: -2.52041731513e-07  
	k: 100      xk: [    25.37312583,     20000000.04]    fk: -2.52041731614e-07  

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   -2.5204173161439482e-07
	Iterations:       104
	Function calls:   216
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    25.37312583,     20000000.04]    fk: 3.4117979512e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: -2.48664051647e-09  

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   -2.4866405164657499e-09
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    25.37312583,     20000000.04]    fk: 3.41179795173e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: 8.91039451354e-12   

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   8.9103945135410691e-12
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    25.37312583,     20000000.04]    fk: 3.41179795173e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: 3.38659036233e-11   

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   3.3865903623333979e-11
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    25.37312583,     20000000.04]    fk: 3.41179795173e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: 3.41154587144e-11   

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   3.411545871443191e-11
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    25.37312583,     20000000.04]    fk: 3.41179795173e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: 3.41179542653e-11   

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   3.4117954265342883e-11
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    25.37312583,     20000000.04]    fk: 3.41179795173e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: 3.41179792209e-11   

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   3.4117979220851999e-11
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    25.37312583,     20000000.04]    fk: 3.41179795173e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: 3.41179794704e-11   

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   3.4117979470407091e-11
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    25.37312583,     20000000.04]    fk: 3.41179795173e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: 3.41179794729e-11   

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   3.4117979472902643e-11
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    25.37312583,     20000000.04]    fk: 3.41179795173e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: 3.41179794729e-11   

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   3.4117979472927594e-11
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    25.37312583,     20000000.04]    fk: 3.41179795173e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: 3.41179794729e-11   

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   3.4117979472927846e-11
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    25.37312583,     20000000.04]    fk: 3.41179795173e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    25.37312583,     20000000.04]    fk: 3.41179794729e-11   

	Parameter values: [25.373125833926835, 20000000.039150942]
	Function value:   3.4117979472927846e-11
	Iterations:       95
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [25.373125833926835, 20000000.039150942]
Function value:   3.4117979472927846e-11
Iterations:       1377
Function calls:   2888
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 2500.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [             27,        20000000]    fk: 34.0319542675       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [             27,        20000000]    fk: 33.7793505546       

	Parameter values: [24.880836254533655, 20000013.567956947]
	Function value:   -0.25190807039698998
	Iterations:       72
	Function calls:   144
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    24.88083625,     20000013.57]    fk: 1.02688890739e-08   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88083625,     20000013.57]    fk: -0.00251907053746   

	Parameter values: [24.880796768731649, 20000000.217804015]
	Function value:   -0.0025190805815835764
	Iterations:       75
	Function calls:   145
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    24.88079677,     20000000.22]    fk: 2.21754666894e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079677,     20000000.22]    fk: -2.51907838618e-05  

	Parameter values: [24.880796373699997, 20000000.08424709]
	Function value:   -2.5190784866999092e-05
	Iterations:       91
	Function calls:   204
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    24.88079637,     20000000.08]    fk: 2.11502952684e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: -2.51886909878e-07  

	Parameter values: [24.880796369786861, 20000000.08293131]
	Function value:   -2.5188690997707132e-07
	Iterations:       97
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    24.88079637,     20000000.08]    fk: 2.11501938789e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: -2.49793040784e-09  

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   -2.4979304078585732e-09
	Iterations:       100
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    24.88079637,     20000000.08]    fk: 2.11501938852e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: -4.04061216643e-12  
	k: 100      xk: [    24.88079637,     20000000.08]    fk: -4.04061216643e-12  

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   -4.0406121664265655e-12
	Iterations:       102
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    24.88079637,     20000000.08]    fk: 2.11501938852e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: 2.08982857905e-11   
	k: 100      xk: [    24.88079637,     20000000.08]    fk: 2.08982857905e-11   

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   2.0898285790494903e-11
	Iterations:       102
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    24.88079637,     20000000.08]    fk: 2.11501938852e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: 2.11476747701e-11   
	k: 100      xk: [    24.88079637,     20000000.08]    fk: 2.11476747701e-11   

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   2.1147674770064118e-11
	Iterations:       102
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    24.88079637,     20000000.08]    fk: 2.11501938852e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: 2.11501686599e-11   
	k: 100      xk: [    24.88079637,     20000000.08]    fk: 2.11501686599e-11   

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   2.115016865985981e-11
	Iterations:       102
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    24.88079637,     20000000.08]    fk: 2.11501938852e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: 2.11501935988e-11   
	k: 100      xk: [    24.88079637,     20000000.08]    fk: 2.11501935988e-11   

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   2.1150193598757763e-11
	Iterations:       102
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    24.88079637,     20000000.08]    fk: 2.11501938852e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: 2.11501938481e-11   
	k: 100      xk: [    24.88079637,     20000000.08]    fk: 2.11501938481e-11   

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   2.1150193848146747e-11
	Iterations:       102
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    24.88079637,     20000000.08]    fk: 2.11501938852e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: 2.11501938506e-11   
	k: 100      xk: [    24.88079637,     20000000.08]    fk: 2.11501938506e-11   

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   2.1150193850640632e-11
	Iterations:       102
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    24.88079637,     20000000.08]    fk: 2.11501938852e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: 2.11501938507e-11   
	k: 100      xk: [    24.88079637,     20000000.08]    fk: 2.11501938507e-11   

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   2.1150193850665573e-11
	Iterations:       102
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    24.88079637,     20000000.08]    fk: 2.11501938852e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: 2.11501938507e-11   
	k: 100      xk: [    24.88079637,     20000000.08]    fk: 2.11501938507e-11   

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   2.1150193850665822e-11
	Iterations:       102
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    24.88079637,     20000000.08]    fk: 2.11501938852e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.88079637,     20000000.08]    fk: 2.11501938507e-11   
	k: 100      xk: [    24.88079637,     20000000.08]    fk: 2.11501938507e-11   

	Parameter values: [24.880796369764369, 20000000.082922541]
	Function value:   2.1150193850665825e-11
	Iterations:       102
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [24.880796369764369, 20000000.082922541]
Function value:   2.1150193850665825e-11
Iterations:       1455
Function calls:   3115
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 3000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    22.66666667,        20000000]    fk: 36.869293111        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           23.8,        20000000]    fk: 5.77222300747       

	Parameter values: [24.612459873300985, 20000013.362873595]
	Function value:   -0.25181493330721005
	Iterations:       75
	Function calls:   140
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    24.61245987,     20000013.36]    fk: 1.02307003464e-08   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61245987,     20000013.36]    fk: -0.00251813920463   

	Parameter values: [24.612421000183723, 20000000.066895299]
	Function value:   -0.0025181492162132278
	Iterations:       74
	Function calls:   143
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [      24.612421,     20000000.07]    fk: 1.69089907217e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [      24.612421,     20000000.07]    fk: -2.51814754215e-05  

	Parameter values: [24.612420611349485, 19999999.933853045]
	Function value:   -2.5181476423450097e-05
	Iterations:       94
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    24.61242061,     19999999.93]    fk: 1.58875461194e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: -2.51799035564e-07  

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   -2.5179903566435834e-07
	Iterations:       97
	Function calls:   210
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    24.61242061,     19999999.93]    fk: 1.58874436408e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: -2.5022617875e-09   

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   -2.5022617874976706e-09
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    24.61242061,     19999999.93]    fk: 1.58874436163e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: -9.29404872906e-12  

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   -9.2940487290639978e-12
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    24.61242061,     19999999.93]    fk: 1.58874436163e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: 1.56356286586e-11   

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   1.5635628658622071e-11
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    24.61242061,     19999999.93]    fk: 1.58874436163e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: 1.58849254325e-11   

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   1.5884925432498932e-11
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    24.61242061,     19999999.93]    fk: 1.58874436163e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: 1.58874184002e-11   

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   1.5887418400237697e-11
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    24.61242061,     19999999.93]    fk: 1.58874436163e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: 1.58874433299e-11   

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   1.5887443329915087e-11
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    24.61242061,     19999999.93]    fk: 1.58874436163e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: 1.58874435792e-11   

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   1.588744357921186e-11
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    24.61242061,     19999999.93]    fk: 1.58874436163e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: 1.58874435817e-11   

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   1.588744358170483e-11
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    24.61242061,     19999999.93]    fk: 1.58874436163e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: 1.58874435817e-11   

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   1.5887443581729759e-11
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    24.61242061,     19999999.93]    fk: 1.58874436163e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: 1.58874435817e-11   

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   1.5887443581730007e-11
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    24.61242061,     19999999.93]    fk: 1.58874436163e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.61242061,     19999999.93]    fk: 1.58874435817e-11   

	Parameter values: [24.612420607468909, 19999999.932520114]
	Function value:   1.5887443581730011e-11
	Iterations:       93
	Function calls:   198
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [24.612420607468909, 19999999.932520114]
Function value:   1.588744358173001e-11
Iterations:       1363
Function calls:   2880
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 3500.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    22.66666667,        20000000]    fk: 31.2613672287       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           23.8,        20000000]    fk: 3.64246134146       

	Parameter values: [24.450316712210441, 20000013.476055253]
	Function value:   -0.25175807751078993
	Iterations:       63
	Function calls:   127
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    24.45031671,     20000013.48]    fk: 1.02217891836e-08   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45031671,     20000013.48]    fk: -0.00251757065689   

	Parameter values: [24.450278206756259, 20000000.213582069]
	Function value:   -0.0025175806486430878
	Iterations:       75
	Function calls:   152
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    24.45027821,     20000000.21]    fk: 2.68061273589e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027821,     20000000.21]    fk: -2.51757799482e-05  

	Parameter values: [24.450277821516636, 20000000.080908552]
	Function value:   -2.5175780948184259e-05
	Iterations:       99
	Function calls:   217
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    24.45027782,     20000000.08]    fk: 2.57861145476e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: -2.51732281229e-07  

	Parameter values: [24.450277817741267, 20000000.079581067]
	Function value:   -2.5173228132788122e-07
	Iterations:       99
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [    24.45027782,     20000000.08]    fk: 2.57860131131e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: -2.4917946603e-09   
	k: 100      xk: [    24.45027782,     20000000.08]    fk: -2.49179466031e-09  

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   -2.4917946603061757e-09
	Iterations:       102
	Function calls:   214
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    24.45027782,     20000000.08]    fk: 2.57860131037e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: 6.10206369568e-13   

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   6.1020636956791341e-13
	Iterations:       100
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    24.45027782,     20000000.08]    fk: 2.57860131298e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: 2.55342550363e-11   

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   2.5534255036325351e-11
	Iterations:       100
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    24.45027782,     20000000.08]    fk: 2.57860131298e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: 2.5783495523e-11    

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   2.5783495522992925e-11
	Iterations:       100
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    24.45027782,     20000000.08]    fk: 2.57860131298e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: 2.57859879279e-11   

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   2.5785987927859601e-11
	Iterations:       100
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    24.45027782,     20000000.08]    fk: 2.57860131298e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: 2.57860128519e-11   

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   2.5786012851908263e-11
	Iterations:       100
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    24.45027782,     20000000.08]    fk: 2.57860131298e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: 2.57860131011e-11   

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   2.5786013101148755e-11
	Iterations:       100
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    24.45027782,     20000000.08]    fk: 2.57860131298e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: 2.57860131036e-11   

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   2.578601310364116e-11
	Iterations:       100
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    24.45027782,     20000000.08]    fk: 2.57860131298e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: 2.57860131037e-11   

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   2.5786013103666082e-11
	Iterations:       100
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    24.45027782,     20000000.08]    fk: 2.57860131298e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: 2.57860131037e-11   

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   2.5786013103666331e-11
	Iterations:       100
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    24.45027782,     20000000.08]    fk: 2.57860131298e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.45027782,     20000000.08]    fk: 2.57860131037e-11   

	Parameter values: [24.450277817723535, 20000000.079573125]
	Function value:   2.5786013103666334e-11
	Iterations:       100
	Function calls:   209
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [24.450277817723535, 20000000.079573125]
Function value:   2.5786013103666334e-11
Iterations:       1438
Function calls:   3013
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 4000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    22.66666667,        20000000]    fk: 27.8403656181       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           23.8,        20000000]    fk: 2.49882103454       

	Parameter values: [24.34494969940922, 20000013.364135735]
	Function value:   -0.25172089033108624
	Iterations:       65
	Function calls:   130
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [     24.3449497,     20000013.36]    fk: 1.02034326325e-08   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     24.3449497,     20000013.36]    fk: -0.00251719880078   

	Parameter values: [24.34491142957188, 20000000.121199228]
	Function value:   -0.0025172087815742766
	Iterations:       75
	Function calls:   146
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    24.34491143,     20000000.12]    fk: 2.21582513592e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491143,     20000000.12]    fk: -2.51720658811e-05  

	Parameter values: [24.344911046834962, 19999999.988808353]
	Function value:   -2.5172066879167368e-05
	Iterations:       80
	Function calls:   162
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    24.34491105,     19999999.99]    fk: 2.11379747059e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491105,     19999999.99]    fk: -2.51699742196e-07  

	Parameter values: [24.344911043042934, 19999999.987497754]
	Function value:   -2.516997422963101e-07
	Iterations:       100
	Function calls:   215
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    24.34491104,     19999999.99]    fk: 2.11378731814e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: -2.49607092857e-09  

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   -2.49607092858577e-09
	Iterations:       98
	Function calls:   210
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [    24.34491104,     19999999.99]    fk: 2.11378731085e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: -4.0342149084e-12   

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   -4.0342149084044907e-12
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    24.34491104,     19999999.99]    fk: 2.11378731714e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: 2.08861522284e-11   

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   2.0886152228369161e-11
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    24.34491104,     19999999.99]    fk: 2.11378731714e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: 2.11353558997e-11   

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   2.1135355899736897e-11
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    24.34491104,     19999999.99]    fk: 2.11378731714e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: 2.11378479365e-11   

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   2.1137847936450576e-11
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    24.34491104,     19999999.99]    fk: 2.11378731714e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: 2.11378728568e-11   

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   2.1137872856817709e-11
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    24.34491104,     19999999.99]    fk: 2.11378731714e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: 2.1137873106e-11    

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   2.1137873106021381e-11
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    24.34491104,     19999999.99]    fk: 2.11378731714e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: 2.11378731085e-11   

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   2.1137873108513418e-11
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    24.34491104,     19999999.99]    fk: 2.11378731714e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: 2.11378731085e-11   

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   2.113787310853834e-11
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    24.34491104,     19999999.99]    fk: 2.11378731714e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: 2.11378731085e-11   

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   2.1137873108538589e-11
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    24.34491104,     19999999.99]    fk: 2.11378731714e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.34491104,     19999999.99]    fk: 2.11378731085e-11   

	Parameter values: [24.344911043042934, 19999999.987497769]
	Function value:   2.1137873108538592e-11
	Iterations:       96
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [24.344911043042934, 19999999.987497769]
Function value:   2.1137873108538592e-11
Iterations:       1378
Function calls:   2913
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 4500.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    22.66666667,        20000000]    fk: 25.5968380882       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           23.8,        20000000]    fk: 1.8257627635        

	Parameter values: [24.272652509434113, 20000013.265178394]
	Function value:   -0.25169526412563492
	Iterations:       63
	Function calls:   123
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    24.27265251,     20000013.27]    fk: 1.01974140646e-08   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27265251,     20000013.27]    fk: -0.00251694254785   

	Parameter values: [24.272614400839544, 20000000.038752027]
	Function value:   -0.0025169525196044036
	Iterations:       73
	Function calls:   144
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [     24.2726144,     20000000.04]    fk: 2.21570455816e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     24.2726144,     20000000.04]    fk: -2.51695032603e-05  

	Parameter values: [24.272614019891883, 19999999.906474821]
	Function value:   -2.5169504256946372e-05
	Iterations:       93
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    24.27261402,     19999999.91]    fk: 2.1140529989e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: -2.51674113445e-07  

	Parameter values: [24.272614016080617, 19999999.905163608]
	Function value:   -2.5167411354307144e-07
	Iterations:       100
	Function calls:   213
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [    24.27261402,     19999999.91]    fk: 2.11404296827e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: -2.49581211004e-09  

	Parameter values: [24.272614016067287, 19999999.905143913]
	Function value:   -2.4958121100589333e-09
	Iterations:       99
	Function calls:   206
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    24.27261402,     19999999.91]    fk: 2.1140429701e-11    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: -4.02909572881e-12  

	Parameter values: [24.272614016087012, 19999999.905148804]
	Function value:   -4.0290957466141375e-12
	Iterations:       91
	Function calls:   200
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    24.27261402,     19999999.91]    fk: 2.11404296933e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: 2.08887343967e-11   

	Parameter values: [24.272614016082215, 19999999.90514864]
	Function value:   2.0888734391576802e-11
	Iterations:       99
	Function calls:   214
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: 2.1137912693e-11    

	Parameter values: [24.272614016082215, 19999999.90514864]
	Function value:   2.1137912693009818e-11
	Iterations:       99
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: 2.1140404476e-11    

	Parameter values: [24.272614016082215, 19999999.90514864]
	Function value:   2.1140404476024149e-11
	Iterations:       99
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: 2.11404293939e-11   

	Parameter values: [24.272614016082215, 19999999.90514864]
	Function value:   2.1140429393854293e-11
	Iterations:       99
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: 2.1140429643e-11    

	Parameter values: [24.272614016082215, 19999999.90514864]
	Function value:   2.1140429643032591e-11
	Iterations:       99
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   

	Parameter values: [24.272614016082215, 19999999.90514864]
	Function value:   2.1140429645524376e-11
	Iterations:       99
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   

	Parameter values: [24.272614016082215, 19999999.90514864]
	Function value:   2.1140429645549295e-11
	Iterations:       99
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   

	Parameter values: [24.272614016082215, 19999999.90514864]
	Function value:   2.1140429645549544e-11
	Iterations:       99
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.27261402,     19999999.91]    fk: 2.11404296455e-11   

	Parameter values: [24.272614016082215, 19999999.90514864]
	Function value:   2.1140429645549547e-11
	Iterations:       99
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [24.272614016082215, 19999999.90514864]
Function value:   2.1140429645549547e-11
Iterations:       1410
Function calls:   2965
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 5000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    22.66666667,        20000000]    fk: 24.0436601715       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           23.8,        20000000]    fk: 1.40055660331       

	Parameter values: [24.220907947382443, 20000013.213380821]
	Function value:   -0.25167686747338436
	Iterations:       64
	Function calls:   127
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    24.22090795,     20000013.21]    fk: 1.01783186454e-08   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22090795,     20000013.21]    fk: -0.00251675859999   

	Parameter values: [24.22086996016359, 19999999.996491812]
	Function value:   -0.0025167685642613264
	Iterations:       72
	Function calls:   141
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    24.22086996,        20000000]    fk: 1.09271334615e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086996,        20000000]    fk: -2.51676748245e-05  

	Parameter values: [24.220869580346708, 19999999.864405327]
	Function value:   -2.5167675820411499e-05
	Iterations:       77
	Function calls:   154
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    24.22086958,     19999999.86]    fk: 9.91135134965e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: -2.51666945967e-07  
	k: 100      xk: [    24.22086958,     19999999.86]    fk: -2.51666946067e-07  

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   -2.5166694606740616e-07
	Iterations:       103
	Function calls:   218
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    24.22086958,     19999999.86]    fk: 9.91124821046e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: -2.50685732498e-09  

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   -2.5068573249759714e-09
	Iterations:       100
	Function calls:   207
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    24.22086958,     19999999.86]    fk: 9.91124819967e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: -1.52564375517e-11  

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   -1.5256437551669122e-11
	Iterations:       98
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: 9.65957132257e-12   

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   9.6595713225738996e-12
	Iterations:       98
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: 9.90873141132e-12   

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   9.9087314113163291e-12
	Iterations:       98
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: 9.9112230122e-12    

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   9.9112230122037554e-12
	Iterations:       98
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: 9.91124792821e-12   

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   9.9112479282126292e-12
	Iterations:       98
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: 9.91124817737e-12   

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   9.9112481773727162e-12
	Iterations:       98
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: 9.91124817986e-12   

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   9.9112481798643167e-12
	Iterations:       98
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   9.9112481798892339e-12
	Iterations:       98
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   9.9112481798894843e-12
	Iterations:       98
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.22086958,     19999999.86]    fk: 9.91124817989e-12   

	Parameter values: [24.220869576500554, 19999999.863075219]
	Function value:   9.911248179889486e-12
	Iterations:       98
	Function calls:   212
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [24.220869576500554, 19999999.863075219]
Function value:   9.911248179889486e-12
Iterations:       1396
Function calls:   2967
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 5500.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    22.66666667,        20000000]    fk: 22.9225292581       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           23.8,        20000000]    fk: 1.11647002041       

	Parameter values: [24.182607107590378, 20000013.114061564]
	Function value:   -0.25166322045479073
	Iterations:       67
	Function calls:   131
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    24.18260711,     20000013.11]    fk: 1.01811097722e-08   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18260711,     20000013.11]    fk: -0.00251662212655   

	Parameter values: [24.182569203080845, 19999999.905043062]
	Function value:   -0.0025166320875623059
	Iterations:       73
	Function calls:   142
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [     24.1825692,     19999999.91]    fk: 1.75542683734e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     24.1825692,     19999999.91]    fk: -2.51663034966e-05  

	Parameter values: [24.182568823786596, 19999999.772880495]
	Function value:   -2.516630449396018e-05
	Iterations:       97
	Function calls:   208
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [    24.18256882,     19999999.77]    fk: 1.65370728841e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: -2.51646673237e-07  

	Parameter values: [24.182568820034625, 19999999.771596011]
	Function value:   -2.5164667333709366e-07
	Iterations:       94
	Function calls:   203
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    24.18256882,     19999999.77]    fk: 1.65369712751e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: -2.50009513183e-09  
	k: 100      xk: [    24.18256882,     19999999.77]    fk: -2.5000951319e-09   

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   -2.5000951318960271e-09
	Iterations:       103
	Function calls:   219
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    24.18256882,     19999999.77]    fk: 1.65369712371e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: -8.62934984379e-12  

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   -8.6293498437924519e-12
	Iterations:       92
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    24.18256882,     19999999.77]    fk: 1.65369712009e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: 1.62853079767e-11   

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   1.6285307976729896e-11
	Iterations:       92
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    24.18256882,     19999999.77]    fk: 1.65369712009e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: 1.65344545549e-11   

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   1.6534454554935116e-11
	Iterations:       92
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    24.18256882,     19999999.77]    fk: 1.65369712009e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: 1.65369460207e-11   

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   1.6536946020717171e-11
	Iterations:       92
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    24.18256882,     19999999.77]    fk: 1.65369712009e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: 1.65369709354e-11   

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   1.6536970935374991e-11
	Iterations:       92
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    24.18256882,     19999999.77]    fk: 1.65369712009e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: 1.65369711845e-11   

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   1.6536971184521565e-11
	Iterations:       92
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    24.18256882,     19999999.77]    fk: 1.65369712009e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: 1.6536971187e-11    

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   1.6536971187013033e-11
	Iterations:       92
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    24.18256882,     19999999.77]    fk: 1.65369712009e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: 1.6536971187e-11    

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   1.6536971187037949e-11
	Iterations:       92
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    24.18256882,     19999999.77]    fk: 1.65369712009e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: 1.6536971187e-11    

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   1.6536971187038198e-11
	Iterations:       92
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    24.18256882,     19999999.77]    fk: 1.65369712009e-11   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.18256882,     19999999.77]    fk: 1.6536971187e-11    

	Parameter values: [24.182568819954707, 19999999.771566518]
	Function value:   1.6536971187038201e-11
	Iterations:       92
	Function calls:   205
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [24.182568819954707, 19999999.771566518]
Function value:   1.65369711870382e-11
Iterations:       1354
Function calls:   2953
Gradient calls:   0
Hessian calls:    0
Warning:          None



Fitting to spin :2@N, frequency 800000000.0 and dispersion point 6000.0
-----------------------------------------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [    22.66666667,        20000000]    fk: 22.0859328754       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           23.8,        20000000]    fk: 0.917917006246      

	Parameter values: [24.153468048088769, 20000013.206894971]
	Function value:   -0.25165282086594765
	Iterations:       70
	Function calls:   141
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    24.15346805,     20000013.21]    fk: 1.01654260489e-08   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15346805,     20000013.21]    fk: -0.00251651814401   

	Parameter values: [24.153430208134786, 20000000.003093824]
	Function value:   -0.0025165281020996973
	Iterations:       74
	Function calls:   143
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    24.15343021,        20000000]    fk: 7.05719038872e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15343021,        20000000]    fk: -2.51652740338e-05  

	Parameter values: [24.153429829812772, 19999999.870996654]
	Function value:   -2.5165275029828844e-05
	Iterations:       79
	Function calls:   160
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    24.15342983,     19999999.87]    fk: 6.04163125738e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: -2.51646769085e-07  

	Parameter values: [24.153429825978616, 19999999.869652666]
	Function value:   -2.516467691870372e-07
	Iterations:       98
	Function calls:   216
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    24.15342983,     19999999.87]    fk: 6.04152553188e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: -2.51048658162e-09  

	Parameter values: [24.153429825978549, 19999999.869652689]
	Function value:   -2.5104865816225683e-09
	Iterations:       94
	Function calls:   201
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [    24.15342983,     19999999.87]    fk: 6.0415255295e-12    
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: -1.91237555684e-11  

	Parameter values: [24.153429825924704, 19999999.8696495]
	Function value:   -1.9123755578302966e-11
	Iterations:       95
	Function calls:   206
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    24.15342983,     19999999.87]    fk: 6.04152549339e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: 5.78987268224e-12   

	Parameter values: [24.153429825924636, 19999999.869649507]
	Function value:   5.7898726804513038e-12
	Iterations:       100
	Function calls:   211
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [    24.15342983,     19999999.87]    fk: 6.04152550235e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: 6.03900896306e-12   

	Parameter values: [24.153429825924636, 19999999.869649507]
	Function value:   6.0390089630566994e-12
	Iterations:       92
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    24.15342983,     19999999.87]    fk: 6.04152551314e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: 6.04150032588e-12   

	Parameter values: [24.153429825924636, 19999999.869649507]
	Function value:   6.0415003258827538e-12
	Iterations:       92
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 9        xk: [    24.15342983,     19999999.87]    fk: 6.04152551314e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: 6.04152523951e-12   

	Parameter values: [24.153429825924636, 19999999.869649507]
	Function value:   6.0415252395110147e-12
	Iterations:       92
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    24.15342983,     19999999.87]    fk: 6.04152551314e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: 6.04152548865e-12   

	Parameter values: [24.153429825924636, 19999999.869649507]
	Function value:   6.0415254886472969e-12
	Iterations:       92
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 11       xk: [    24.15342983,     19999999.87]    fk: 6.04152551314e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: 6.04152549114e-12   

	Parameter values: [24.153429825924636, 19999999.869649507]
	Function value:   6.0415254911386599e-12
	Iterations:       92
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 12       xk: [    24.15342983,     19999999.87]    fk: 6.04152551314e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: 6.04152549116e-12   

	Parameter values: [24.153429825924636, 19999999.869649507]
	Function value:   6.0415254911635739e-12
	Iterations:       92
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 13       xk: [    24.15342983,     19999999.87]    fk: 6.04152551314e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: 6.04152549116e-12   

	Parameter values: [24.153429825924636, 19999999.869649507]
	Function value:   6.0415254911638227e-12
	Iterations:       92
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    24.15342983,     19999999.87]    fk: 6.04152551314e-12   
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    24.15342983,     19999999.87]    fk: 6.04152549116e-12   

	Parameter values: [24.153429825924636, 19999999.869649507]
	Function value:   6.0415254911638251e-12
	Iterations:       92
	Function calls:   194
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [24.153429825924636, 19999999.869649507]
Function value:   6.041525491163825e-12
Iterations:       1346
Function calls:   2830
Gradient calls:   0
Hessian calls:    0
Warning:          None


relax> monte_carlo.setup(number=500)

relax> monte_carlo.create_data(method='back_calc')

relax> monte_carlo.initial_values()

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)
Simulation 1
Simulation 2
Simulation 3
Simulation 4
Simulation 5
Simulation 6
Simulation 7
Simulation 8
Simulation 9
Simulation 10
Simulation 11
Simulation 12
Simulation 13
Simulation 14
Simulation 15
Simulation 16
Simulation 17
Simulation 18
Simulation 19
Simulation 20
Simulation 21
Simulation 22
Simulation 23
Simulation 24
Simulation 25
Simulation 26
Simulation 27
Simulation 28
Simulation 29
Simulation 30
Simulation 31
Simulation 32
Simulation 33
Simulation 34
Simulation 35
Simulation 36
Simulation 37
Simulation 38
Simulation 39
Simulation 40
Simulation 41
Simulation 42
Simulation 43
Simulation 44
Simulation 45
Simulation 46
Simulation 47
Simulation 48
Simulation 49
Simulation 50
Simulation 51
Simulation 52
Simulation 53
Simulation 54
Simulation 55
Simulation 56
Simulation 57
Simulation 58
Simulation 59
Simulation 60
Simulation 61
Simulation 62
Simulation 63
Simulation 64
Simulation 65
Simulation 66
Simulation 67
Simulation 68
Simulation 69
Simulation 70
Simulation 71
Simulation 72
Simulation 73
Simulation 74
Simulation 75
Simulation 76
Simulation 77
Simulation 78
Simulation 79
Simulation 80
Simulation 81
Simulation 82
Simulation 83
Simulation 84
Simulation 85
Simulation 86
Simulation 87
Simulation 88
Simulation 89
Simulation 90
Simulation 91
Simulation 92
Simulation 93
Simulation 94
Simulation 95
Simulation 96
Simulation 97
Simulation 98
Simulation 99
Simulation 100
Simulation 101
Simulation 102
Simulation 103
Simulation 104
Simulation 105
Simulation 106
Simulation 107
Simulation 108
Simulation 109
Simulation 110
Simulation 111
Simulation 112
Simulation 113
Simulation 114
Simulation 115
Simulation 116
Simulation 117
Simulation 118
Simulation 119
Simulation 120
Simulation 121
Simulation 122
Simulation 123
Simulation 124
Simulation 125
Simulation 126
Simulation 127
Simulation 128
Simulation 129
Simulation 130
Simulation 131
Simulation 132
Simulation 133
Simulation 134
Simulation 135
Simulation 136
Simulation 137
Simulation 138
Simulation 139
Simulation 140
Simulation 141
Simulation 142
Simulation 143
Simulation 144
Simulation 145
Simulation 146
Simulation 147
Simulation 148
Simulation 149
Simulation 150
Simulation 151
Simulation 152
Simulation 153
Simulation 154
Simulation 155
Simulation 156
Simulation 157
Simulation 158
Simulation 159
Simulation 160
Simulation 161
Simulation 162
Simulation 163
Simulation 164
Simulation 165
Simulation 166
Simulation 167
Simulation 168
Simulation 169
Simulation 170
Simulation 171
Simulation 172
Simulation 173
Simulation 174
Simulation 175
Simulation 176
Simulation 177
Simulation 178
Simulation 179
Simulation 180
Simulation 181
Simulation 182
Simulation 183
Simulation 184
Simulation 185
Simulation 186
Simulation 187
Simulation 188
Simulation 189
Simulation 190
Simulation 191
Simulation 192
Simulation 193
Simulation 194
Simulation 195
Simulation 196
Simulation 197
Simulation 198
Simulation 199
Simulation 200
Simulation 201
Simulation 202
Simulation 203
Simulation 204
Simulation 205
Simulation 206
Simulation 207
Simulation 208
Simulation 209
Simulation 210
Simulation 211
Simulation 212
Simulation 213
Simulation 214
Simulation 215
Simulation 216
Simulation 217
Simulation 218
Simulation 219
Simulation 220
Simulation 221
Simulation 222
Simulation 223
Simulation 224
Simulation 225
Simulation 226
Simulation 227
Simulation 228
Simulation 229
Simulation 230
Simulation 231
Simulation 232
Simulation 233
Simulation 234
Simulation 235
Simulation 236
Simulation 237
Simulation 238
Simulation 239
Simulation 240
Simulation 241
Simulation 242
Simulation 243
Simulation 244
Simulation 245
Simulation 246
Simulation 247
Simulation 248
Simulation 249
Simulation 250
Simulation 251
Simulation 252
Simulation 253
Simulation 254
Simulation 255
Simulation 256
Simulation 257
Simulation 258
Simulation 259
Simulation 260
Simulation 261
Simulation 262
Simulation 263
Simulation 264
Simulation 265
Simulation 266
Simulation 267
Simulation 268
Simulation 269
Simulation 270
Simulation 271
Simulation 272
Simulation 273
Simulation 274
Simulation 275
Simulation 276
Simulation 277
Simulation 278
Simulation 279
Simulation 280
Simulation 281
Simulation 282
Simulation 283
Simulation 284
Simulation 285
Simulation 286
Simulation 287
Simulation 288
Simulation 289
Simulation 290
Simulation 291
Simulation 292
Simulation 293
Simulation 294
Simulation 295
Simulation 296
Simulation 297
Simulation 298
Simulation 299
Simulation 300
Simulation 301
Simulation 302
Simulation 303
Simulation 304
Simulation 305
Simulation 306
Simulation 307
Simulation 308
Simulation 309
Simulation 310
Simulation 311
Simulation 312
Simulation 313
Simulation 314
Simulation 315
Simulation 316
Simulation 317
Simulation 318
Simulation 319
Simulation 320
Simulation 321
Simulation 322
Simulation 323
Simulation 324
Simulation 325
Simulation 326
Simulation 327
Simulation 328
Simulation 329
Simulation 330
Simulation 331
Simulation 332
Simulation 333
Simulation 334
Simulation 335
Simulation 336
Simulation 337
Simulation 338
Simulation 339
Simulation 340
Simulation 341
Simulation 342
Simulation 343
Simulation 344
Simulation 345
Simulation 346
Simulation 347
Simulation 348
Simulation 349
Simulation 350
Simulation 351
Simulation 352
Simulation 353
Simulation 354
Simulation 355
Simulation 356
Simulation 357
Simulation 358
Simulation 359
Simulation 360
Simulation 361
Simulation 362
Simulation 363
Simulation 364
Simulation 365
Simulation 366
Simulation 367
Simulation 368
Simulation 369
Simulation 370
Simulation 371
Simulation 372
Simulation 373
Simulation 374
Simulation 375
Simulation 376
Simulation 377
Simulation 378
Simulation 379
Simulation 380
Simulation 381
Simulation 382
Simulation 383
Simulation 384
Simulation 385
Simulation 386
Simulation 387
Simulation 388
Simulation 389
Simulation 390
Simulation 391
Simulation 392
Simulation 393
Simulation 394
Simulation 395
Simulation 396
Simulation 397
Simulation 398
Simulation 399
Simulation 400
Simulation 401
Simulation 402
Simulation 403
Simulation 404
Simulation 405
Simulation 406
Simulation 407
Simulation 408
Simulation 409
Simulation 410
Simulation 411
Simulation 412
Simulation 413
Simulation 414
Simulation 415
Simulation 416
Simulation 417
Simulation 418
Simulation 419
Simulation 420
Simulation 421
Simulation 422
Simulation 423
Simulation 424
Simulation 425
Simulation 426
Simulation 427
Simulation 428
Simulation 429
Simulation 430
Simulation 431
Simulation 432
Simulation 433
Simulation 434
Simulation 435
Simulation 436
Simulation 437
Simulation 438
Simulation 439
Simulation 440
Simulation 441
Simulation 442
Simulation 443
Simulation 444
Simulation 445
Simulation 446
Simulation 447
Simulation 448
Simulation 449
Simulation 450
Simulation 451
Simulation 452
Simulation 453
Simulation 454
Simulation 455
Simulation 456
Simulation 457
Simulation 458
Simulation 459
Simulation 460
Simulation 461
Simulation 462
Simulation 463
Simulation 464
Simulation 465
Simulation 466
Simulation 467
Simulation 468
Simulation 469
Simulation 470
Simulation 471
Simulation 472
Simulation 473
Simulation 474
Simulation 475
Simulation 476
Simulation 477
Simulation 478
Simulation 479
Simulation 480
Simulation 481
Simulation 482
Simulation 483
Simulation 484
Simulation 485
Simulation 486
Simulation 487
Simulation 488
Simulation 489
Simulation 490
Simulation 491
Simulation 492
Simulation 493
Simulation 494
Simulation 495
Simulation 496
Simulation 497
Simulation 498
Simulation 499
Simulation 500

relax> monte_carlo.error_analysis()

relax> relax_disp.plot_exp_curves(file='intensities.agr', dir='./R2eff', force=True, norm=False)
Opening the file './R2eff/intensities.agr' for writing.

relax> relax_disp.plot_exp_curves(file='intensities_norm.agr', dir='./R2eff', force=True, norm=True)
Opening the file './R2eff/intensities_norm.agr' for writing.

relax> relax_disp.plot_disp_curves(dir='./R2eff', force=True)
Opening the file './R2eff/disp_1_N.agr' for writing.
Opening the file './R2eff/disp_2_N.agr' for writing.
Opening the file './R2eff/grace2images.py' for writing.

relax> value.write(param='r2eff', file='r2eff.out', dir='./R2eff', scaling=1.0, comment=None, bc=False, force=True)
Opening the file './R2eff/r2eff.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='r2eff', spin_id=None, plot_data='value', file='r2eff.agr', dir='./R2eff', force=True, norm=False)
Opening the file './R2eff/r2eff.agr' for writing.

relax> value.write(param='i0', file='i0.out', dir='./R2eff', scaling=1.0, comment=None, bc=False, force=True)
Opening the file './R2eff/i0.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='i0', spin_id=None, plot_data='value', file='i0.agr', dir='./R2eff', force=True, norm=False)
Opening the file './R2eff/i0.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='./R2eff', force=True, norm=False)
Opening the file './R2eff/chi2.agr' for writing.

relax> results.write(file='results', dir='./R2eff', compress_type=1, force=True)
Opening the file './R2eff/results.bz2' for writing.
RelaxWarning: Model selection in the dispersion auto-analysis has been skipped as only 0 models have been optimised.

relax> state.save(state='final_state', dir='.', compress_type=1, force=True)
Opening the file './final_state.bz2' for writing.

relax> state.save(state='r2eff_values', dir=None, compress_type=1, force=True)
Opening the file 'r2eff_values.bz2' for writing.

