


                                  relax repository checkout r21124
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'analysis_mq_cr72.py'
----------------------------------------------------------------------------------------------------
"""Script for optimising the 'MQ NS 2-site' model.

This performs the analysis of:

    Remco Sprangers, Anna Gribun, Peter M. Hwang, Walid A. Houry, and Lewis E. Kay (2005)  Quantitative NMR spectroscopy of supramolecular complexes: Dynamic side pores in ClpP are important for product release, PNAS, 102 (46), 16678-16683.  (doi: http://dx.doi.org/10.1073/pnas.0507370102)
"""

# Python module imports.
from os import sep

# relax module imports.
from auto_analyses.relax_disp import Relax_disp
from data_store import Relax_data_store; ds = Relax_data_store()
from status import Status; status = Status()


# Analysis variables.
#####################

# The dispersion models.
MODELS = ['R2eff', 'No Rex', 'MQ CR72']

# The grid search size (the number of increments per dimension).
GRID_INC = 11

# The number of Monte Carlo simulations to be used for error analysis at the end of the analysis.
MC_NUM = 3

# The results directory.
RESULTS_DIR = 'mq_cr72_analysis'


# Set up the data pipe.
#######################

# Create the data pipe.
pipe_name = 'base pipe'
pipe_bundle = 'relax_disp'
pipe.create(pipe_name=pipe_name, bundle=pipe_bundle, pipe_type='relax_disp')

# The path to the data files.
data_path = status.install_path + sep+'test_suite'+sep+'shared_data'+sep+'dispersion'+sep+'Sprangers_ClpP'

# Create the sequence.
spin.create(res_num=135, spin_name='S')
spin.create(res_num=135, spin_name='F')
spin.create(res_num=137, spin_name='S')
spin.create(res_num=137, spin_name='F')

# Set the isotope for field strength scaling.
spin.isotope(isotope='13C')

# The spectral data - spectrum ID, peak list file name, intensity column, CPMG frequency (Hz), spectrometer frequency in Hertz.
ncyc_frq = 800/12.
data = [
    ['600_ref',     '600.out',  6,  None,           600e6],
    ['600_ncyc12',  '600.out',  7,  ncyc_frq * 12,  600e6],
    ['600_ncyc1',   '600.out',  8,  ncyc_frq * 1,   600e6],
    ['600_ncyc10',  '600.out',  9,  ncyc_frq * 10,  600e6],
    ['600_ncyc2',   '600.out', 10,  ncyc_frq * 2,   600e6],
    ['600_ncyc8',   '600.out', 11,  ncyc_frq * 8,   600e6],
    ['600_ncyc3',   '600.out', 12,  ncyc_frq * 3,   600e6],
    ['600_ncyc6',   '600.out', 13,  ncyc_frq * 6,   600e6],
    ['600_ncyc4',   '600.out', 14,  ncyc_frq * 4,   600e6],
    ['600_ncyc5',   '600.out', 15,  ncyc_frq * 5,   600e6],
    ['600_ncyc1b',  '600.out', 16,  ncyc_frq * 1,   600e6],
    ['600_ncyc2b',  '600.out', 17,  ncyc_frq * 2,   600e6],
    ['600_ncyc3b',  '600.out', 18,  ncyc_frq * 3,   600e6],
    ['800_ref',     '800.out',  6,  None,           800e6],
    ['800_ncyc12',  '800.out',  7,  ncyc_frq * 12,  800e6],
    ['800_ncyc1',   '800.out',  8,  ncyc_frq * 1,   800e6],
    ['800_ncyc10',  '800.out',  9,  ncyc_frq * 10,  800e6],
    ['800_ncyc2',   '800.out', 10,  ncyc_frq * 2,   800e6],
    ['800_ncyc8',   '800.out', 11,  ncyc_frq * 8,   800e6],
    ['800_ncyc3',   '800.out', 12,  ncyc_frq * 3,   800e6],
    ['800_ncyc6',   '800.out', 13,  ncyc_frq * 6,   800e6],
    ['800_ncyc4',   '800.out', 14,  ncyc_frq * 4,   800e6],
    ['800_ncyc5',   '800.out', 15,  ncyc_frq * 5,   800e6],
    ['800_ncyc1b',  '800.out', 16,  ncyc_frq * 1,   800e6],
    ['800_ncyc2b',  '800.out', 17,  ncyc_frq * 2,   800e6],
    ['800_ncyc3b',  '800.out', 18,  ncyc_frq * 3,   800e6]
]

# Loop over the spectra.
for id, file, int_col, cpmg_frq, H_frq in data:
    # Load the peak intensities.
    spectrum.read_intensities(file=file, dir=data_path, spectrum_id=id, int_method='height', res_num_col=1, spin_name_col=2, int_col=int_col)

    # Set the relaxation dispersion experiment type.
    relax_disp.exp_type(spectrum_id=id, exp_type='MQ CPMG')

    # Set the relaxation dispersion CPMG frequencies.
    relax_disp.cpmg_frq(spectrum_id=id, cpmg_frq=cpmg_frq)

    # Set the NMR field strength of the spectrum.
    spectrometer.frequency(id=id, frq=H_frq)

    # Relaxation dispersion CPMG constant time delay T (in s).
    relax_disp.relax_time(spectrum_id=id, time=0.015)

# Specify the duplicated spectra.
spectrum.replicated(spectrum_ids=['600_ncyc1', '600_ncyc1b'])
spectrum.replicated(spectrum_ids=['600_ncyc2', '600_ncyc2b'])
spectrum.replicated(spectrum_ids=['600_ncyc3', '600_ncyc3b'])
spectrum.replicated(spectrum_ids=['800_ncyc1', '800_ncyc1b'])
spectrum.replicated(spectrum_ids=['800_ncyc2', '800_ncyc2b'])
spectrum.replicated(spectrum_ids=['800_ncyc3', '800_ncyc3b'])

# Measured chemical shift differences.
value.set(val=0.625, param='dw', spin_id=":135")
value.set(val=0.033, param='dwH', spin_id=":135")
value.set(val=0.981, param='dw', spin_id=":137")
value.set(val=0.010, param='dwH', spin_id=":137")
#value.set(val=0.5, param='pA')
#value.set(val=67.5, param='kex')


# Auto-analysis execution.
##########################

# Do not change!
Relax_disp(pipe_name=pipe_name, pipe_bundle=pipe_bundle, results_dir=RESULTS_DIR, models=MODELS, grid_inc=GRID_INC, mc_sim_num=MC_NUM)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='base pipe', pipe_type='relax_disp', bundle='relax_disp')

relax> spin.create(spin_name='S', spin_num=None, res_name=None, res_num=135, mol_name=None)

relax> spin.create(spin_name='F', spin_num=None, res_name=None, res_num=135, mol_name=None)

relax> spin.create(spin_name='S', spin_num=None, res_name=None, res_num=137, mol_name=None)

relax> spin.create(spin_name='F', spin_num=None, res_name=None, res_num=137, mol_name=None)

relax> spin.isotope(isotope='13C', spin_id=None, force=False)

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ref', dim=1, int_method='height', int_col=6, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:135@S       400991.7     
:135@F       376293.3     
:137@S       376544.8     
:137@F       242397.4     

relax> relax_disp.exp_type(spectrum_id='600_ref', exp_type='MQ CPMG')
Setting the '600_ref' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ref', cpmg_frq=None)
Setting the '600_ref' spectrum CPMG frequency None Hz.

relax> spectrometer.frequency(id='600_ref', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ref', time=0.015)
Setting the '600_ref' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc12', dim=1, int_method='height', int_col=7, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       259000.539     
:135@F       205004.5898    
:137@S       252285.016     
:137@F       123986.2701    

relax> relax_disp.exp_type(spectrum_id='600_ncyc12', exp_type='MQ CPMG')
Setting the '600_ncyc12' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc12', cpmg_frq=800.0)
Setting the '600_ncyc12' spectrum CPMG frequency 800.0 Hz.

relax> spectrometer.frequency(id='600_ncyc12', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc12', time=0.015)
Setting the '600_ncyc12' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc1', dim=1, int_method='height', int_col=8, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       182250.7277    
:135@F       127337.6527    
:137@S       166922.3098    
:137@F       71895.0688     

relax> relax_disp.exp_type(spectrum_id='600_ncyc1', exp_type='MQ CPMG')
Setting the '600_ncyc1' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc1', cpmg_frq=66.66666666666667)
Setting the '600_ncyc1' spectrum CPMG frequency 66.6666666667 Hz.

relax> spectrometer.frequency(id='600_ncyc1', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc1', time=0.015)
Setting the '600_ncyc1' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc10', dim=1, int_method='height', int_col=9, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       257155.9772    
:135@F       202746.83      
:137@S       250214.0196    
:137@F       124713.4623    

relax> relax_disp.exp_type(spectrum_id='600_ncyc10', exp_type='MQ CPMG')
Setting the '600_ncyc10' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc10', cpmg_frq=666.6666666666667)
Setting the '600_ncyc10' spectrum CPMG frequency 666.666666667 Hz.

relax> spectrometer.frequency(id='600_ncyc10', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc10', time=0.015)
Setting the '600_ncyc10' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc2', dim=1, int_method='height', int_col=10, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       223312.2777    
:135@F       161166.4204    
:137@S       208794.0916    
:137@F       91601.9775     

relax> relax_disp.exp_type(spectrum_id='600_ncyc2', exp_type='MQ CPMG')
Setting the '600_ncyc2' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc2', cpmg_frq=133.33333333333334)
Setting the '600_ncyc2' spectrum CPMG frequency 133.333333333 Hz.

relax> spectrometer.frequency(id='600_ncyc2', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc2', time=0.015)
Setting the '600_ncyc2' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc8', dim=1, int_method='height', int_col=11, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       252584.6718    
:135@F       196425.1026    
:137@S       247051.0433    
:137@F       120471.5078    

relax> relax_disp.exp_type(spectrum_id='600_ncyc8', exp_type='MQ CPMG')
Setting the '600_ncyc8' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc8', cpmg_frq=533.3333333333334)
Setting the '600_ncyc8' spectrum CPMG frequency 533.333333333 Hz.

relax> spectrometer.frequency(id='600_ncyc8', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc8', time=0.015)
Setting the '600_ncyc8' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc3', dim=1, int_method='height', int_col=12, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       235783.1196    
:135@F       173094.918     
:137@S       223178.103     
:137@F       103406.7308    

relax> relax_disp.exp_type(spectrum_id='600_ncyc3', exp_type='MQ CPMG')
Setting the '600_ncyc3' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc3', cpmg_frq=200.0)
Setting the '600_ncyc3' spectrum CPMG frequency 200.0 Hz.

relax> spectrometer.frequency(id='600_ncyc3', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc3', time=0.015)
Setting the '600_ncyc3' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc6', dim=1, int_method='height', int_col=13, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       248093.5648    
:135@F       192172.9883    
:137@S       242419.5422    
:137@F       117829.3761    

relax> relax_disp.exp_type(spectrum_id='600_ncyc6', exp_type='MQ CPMG')
Setting the '600_ncyc6' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc6', cpmg_frq=400.0)
Setting the '600_ncyc6' spectrum CPMG frequency 400.0 Hz.

relax> spectrometer.frequency(id='600_ncyc6', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc6', time=0.015)
Setting the '600_ncyc6' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc4', dim=1, int_method='height', int_col=14, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       241637.5984    
:135@F       182615.1385    
:137@S       231650.361     
:137@F       108448.5968    

relax> relax_disp.exp_type(spectrum_id='600_ncyc4', exp_type='MQ CPMG')
Setting the '600_ncyc4' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc4', cpmg_frq=266.6666666666667)
Setting the '600_ncyc4' spectrum CPMG frequency 266.666666667 Hz.

relax> spectrometer.frequency(id='600_ncyc4', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc4', time=0.015)
Setting the '600_ncyc4' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc5', dim=1, int_method='height', int_col=15, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       247171.2839    
:135@F       188635.8313    
:137@S       238691.7487    
:137@F       113296.5448    

relax> relax_disp.exp_type(spectrum_id='600_ncyc5', exp_type='MQ CPMG')
Setting the '600_ncyc5' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc5', cpmg_frq=333.33333333333337)
Setting the '600_ncyc5' spectrum CPMG frequency 333.333333333 Hz.

relax> spectrometer.frequency(id='600_ncyc5', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc5', time=0.015)
Setting the '600_ncyc5' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc1b', dim=1, int_method='height', int_col=16, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       181208.1492    
:135@F       126697.9541    
:137@S       165001.9314    
:137@F       73131.2956     

relax> relax_disp.exp_type(spectrum_id='600_ncyc1b', exp_type='MQ CPMG')
Setting the '600_ncyc1b' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc1b', cpmg_frq=66.66666666666667)
Setting the '600_ncyc1b' spectrum CPMG frequency 66.6666666667 Hz.

relax> spectrometer.frequency(id='600_ncyc1b', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc1b', time=0.015)
Setting the '600_ncyc1b' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc2b', dim=1, int_method='height', int_col=17, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       224956.3437    
:135@F       158720.5139    
:137@S       211203.9783    
:137@F       92692.7658     

relax> relax_disp.exp_type(spectrum_id='600_ncyc2b', exp_type='MQ CPMG')
Setting the '600_ncyc2b' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc2b', cpmg_frq=133.33333333333334)
Setting the '600_ncyc2b' spectrum CPMG frequency 133.333333333 Hz.

relax> spectrometer.frequency(id='600_ncyc2b', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc2b', time=0.015)
Setting the '600_ncyc2b' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='600.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='600_ncyc3b', dim=1, int_method='height', int_col=18, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/600.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       237066.293     
:135@F       174299.0566    
:137@S       224571.3187    
:137@F       103891.5256    

relax> relax_disp.exp_type(spectrum_id='600_ncyc3b', exp_type='MQ CPMG')
Setting the '600_ncyc3b' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='600_ncyc3b', cpmg_frq=200.0)
Setting the '600_ncyc3b' spectrum CPMG frequency 200.0 Hz.

relax> spectrometer.frequency(id='600_ncyc3b', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='600_ncyc3b', time=0.015)
Setting the '600_ncyc3b' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ref', dim=1, int_method='height', int_col=6, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity    
:135@S       9705330.0    
:135@F       6448975.0    
:137@S       9348130.0    
:137@F       4167998.0    

relax> relax_disp.exp_type(spectrum_id='800_ref', exp_type='MQ CPMG')
Setting the '800_ref' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ref', cpmg_frq=None)
Setting the '800_ref' spectrum CPMG frequency None Hz.

relax> spectrometer.frequency(id='800_ref', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ref', time=0.015)
Setting the '800_ref' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc12', dim=1, int_method='height', int_col=7, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity       
:135@S       5456336.526     
:135@F       2788536.79      
:137@S       5418176.148     
:137@F       1789321.5414    

relax> relax_disp.exp_type(spectrum_id='800_ncyc12', exp_type='MQ CPMG')
Setting the '800_ncyc12' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc12', cpmg_frq=800.0)
Setting the '800_ncyc12' spectrum CPMG frequency 800.0 Hz.

relax> spectrometer.frequency(id='800_ncyc12', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc12', time=0.015)
Setting the '800_ncyc12' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc1', dim=1, int_method='height', int_col=8, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity       
:135@S       3794784.03      
:135@F       1394913.2925    
:137@S       3489656.929     
:137@F       905289.1656     

relax> relax_disp.exp_type(spectrum_id='800_ncyc1', exp_type='MQ CPMG')
Setting the '800_ncyc1' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc1', cpmg_frq=66.66666666666667)
Setting the '800_ncyc1' spectrum CPMG frequency 66.6666666667 Hz.

relax> spectrometer.frequency(id='800_ncyc1', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc1', time=0.015)
Setting the '800_ncyc1' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc10', dim=1, int_method='height', int_col=9, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       5503892.643    
:135@F       2689222.575    
:137@S       5449959.79     
:137@F       1721383.174    

relax> relax_disp.exp_type(spectrum_id='800_ncyc10', exp_type='MQ CPMG')
Setting the '800_ncyc10' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc10', cpmg_frq=666.6666666666667)
Setting the '800_ncyc10' spectrum CPMG frequency 666.666666667 Hz.

relax> spectrometer.frequency(id='800_ncyc10', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc10', time=0.015)
Setting the '800_ncyc10' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc2', dim=1, int_method='height', int_col=10, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity       
:135@S       4611972.816     
:135@F       1898578.24      
:137@S       4245920.646     
:137@F       1141614.6522    

relax> relax_disp.exp_type(spectrum_id='800_ncyc2', exp_type='MQ CPMG')
Setting the '800_ncyc2' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc2', cpmg_frq=133.33333333333334)
Setting the '800_ncyc2' spectrum CPMG frequency 133.333333333 Hz.

relax> spectrometer.frequency(id='800_ncyc2', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc2', time=0.015)
Setting the '800_ncyc2' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc8', dim=1, int_method='height', int_col=11, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity       
:135@S       5364135.891     
:135@F       2672455.24      
:137@S       5351804.425     
:137@F       1688872.7896    

relax> relax_disp.exp_type(spectrum_id='800_ncyc8', exp_type='MQ CPMG')
Setting the '800_ncyc8' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc8', cpmg_frq=533.3333333333334)
Setting the '800_ncyc8' spectrum CPMG frequency 533.333333333 Hz.

relax> spectrometer.frequency(id='800_ncyc8', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc8', time=0.015)
Setting the '800_ncyc8' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc3', dim=1, int_method='height', int_col=12, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity       
:135@S       4985628.021     
:135@F       2129451.545     
:137@S       4734827.845     
:137@F       1424204.9166    

relax> relax_disp.exp_type(spectrum_id='800_ncyc3', exp_type='MQ CPMG')
Setting the '800_ncyc3' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc3', cpmg_frq=200.0)
Setting the '800_ncyc3' spectrum CPMG frequency 200.0 Hz.

relax> spectrometer.frequency(id='800_ncyc3', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc3', time=0.015)
Setting the '800_ncyc3' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc6', dim=1, int_method='height', int_col=13, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity       
:135@S       5356371.627     
:135@F       2532512.4825    
:137@S       5196625.467     
:137@F       1593842.4352    

relax> relax_disp.exp_type(spectrum_id='800_ncyc6', exp_type='MQ CPMG')
Setting the '800_ncyc6' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc6', cpmg_frq=400.0)
Setting the '800_ncyc6' spectrum CPMG frequency 400.0 Hz.

relax> spectrometer.frequency(id='800_ncyc6', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc6', time=0.015)
Setting the '800_ncyc6' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc4', dim=1, int_method='height', int_col=14, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       5106944.646    
:135@F       2311312.64     
:137@S       4917116.38     
:137@F       1477555.291    

relax> relax_disp.exp_type(spectrum_id='800_ncyc4', exp_type='MQ CPMG')
Setting the '800_ncyc4' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc4', cpmg_frq=266.6666666666667)
Setting the '800_ncyc4' spectrum CPMG frequency 266.666666667 Hz.

relax> spectrometer.frequency(id='800_ncyc4', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc4', time=0.015)
Setting the '800_ncyc4' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc5', dim=1, int_method='height', int_col=15, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity       
:135@S       5147707.032     
:135@F       2504136.9925    
:137@S       5007793.241     
:137@F       1547994.4572    

relax> relax_disp.exp_type(spectrum_id='800_ncyc5', exp_type='MQ CPMG')
Setting the '800_ncyc5' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc5', cpmg_frq=333.33333333333337)
Setting the '800_ncyc5' spectrum CPMG frequency 333.333333333 Hz.

relax> spectrometer.frequency(id='800_ncyc5', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc5', time=0.015)
Setting the '800_ncyc5' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc1b', dim=1, int_method='height', int_col=16, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity      
:135@S       3776343.903    
:135@F       1400717.37     
:137@S       3626139.627    
:137@F       928629.9544    

relax> relax_disp.exp_type(spectrum_id='800_ncyc1b', exp_type='MQ CPMG')
Setting the '800_ncyc1b' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc1b', cpmg_frq=66.66666666666667)
Setting the '800_ncyc1b' spectrum CPMG frequency 66.6666666667 Hz.

relax> spectrometer.frequency(id='800_ncyc1b', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc1b', time=0.015)
Setting the '800_ncyc1b' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc2b', dim=1, int_method='height', int_col=17, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity       
:135@S       4623619.212     
:135@F       1930178.2175    
:137@S       4332858.255     
:137@F       1192464.2278    

relax> relax_disp.exp_type(spectrum_id='800_ncyc2b', exp_type='MQ CPMG')
Setting the '800_ncyc2b' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc2b', cpmg_frq=133.33333333333334)
Setting the '800_ncyc2b' spectrum CPMG frequency 133.333333333 Hz.

relax> spectrometer.frequency(id='800_ncyc2b', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc2b', time=0.015)
Setting the '800_ncyc2b' spectrum relaxation time period to 0.015 s.

relax> spectrum.read_intensities(file='800.out', dir='/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP', spectrum_id='800_ncyc3b', dim=1, int_method='height', int_col=18, spin_id_col=None, mol_name_col=None, res_num_col=1, res_name_col=None, spin_num_col=None, spin_name_col=2, sep=None, spin_id=None, ncproc=None)
Opening the file '/data/relax/branches/relax_disp/test_suite/shared_data/dispersion/Sprangers_ClpP/800.out' for reading.
Generic formatted data file.


The following intensities have been loaded into the relax data store:

# Spin_ID    Intensity       
:135@S       4798315.152     
:135@F       2251337.1725    
:137@S       4631998.415     
:137@F       1457965.7004    

relax> relax_disp.exp_type(spectrum_id='800_ncyc3b', exp_type='MQ CPMG')
Setting the '800_ncyc3b' spectrum tothe MQ CPMG-type experiment.

relax> relax_disp.cpmg_frq(spectrum_id='800_ncyc3b', cpmg_frq=200.0)
Setting the '800_ncyc3b' spectrum CPMG frequency 200.0 Hz.

relax> spectrometer.frequency(id='800_ncyc3b', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.relax_time(spectrum_id='800_ncyc3b', time=0.015)
Setting the '800_ncyc3b' spectrum relaxation time period to 0.015 s.

relax> spectrum.replicated(spectrum_ids=['600_ncyc1', '600_ncyc1b'])

relax> spectrum.replicated(spectrum_ids=['600_ncyc2', '600_ncyc2b'])

relax> spectrum.replicated(spectrum_ids=['600_ncyc3', '600_ncyc3b'])

relax> spectrum.replicated(spectrum_ids=['800_ncyc1', '800_ncyc1b'])

relax> spectrum.replicated(spectrum_ids=['800_ncyc2', '800_ncyc2b'])

relax> spectrum.replicated(spectrum_ids=['800_ncyc3', '800_ncyc3b'])

relax> value.set(val=0.625, param='dw', spin_id=':135', error=False)

relax> value.set(val=0.033, param='dwH', spin_id=':135', error=False)

relax> value.set(val=0.981, param='dw', spin_id=':137', error=False)

relax> value.set(val=0.01, param='dwH', spin_id=':137', error=False)




=======================================
= Relaxation dispersion auto-analysis =
=======================================


relax> spectrum.error_analysis(subset=['600_ref', '600_ncyc12', '600_ncyc1', '600_ncyc10', '600_ncyc2', '600_ncyc8', '600_ncyc3', '600_ncyc6', '600_ncyc4', '600_ncyc5', '600_ncyc1b', '600_ncyc2b', '600_ncyc3b'])
Intensity measure:  Peak heights.
Replicated spectra:  Yes.
All spectra replicated:  No.

Replicated spectra:  ['600_ncyc1', '600_ncyc1b']
Standard deviation:  915.989501013

Replicated spectra:  ['600_ncyc2', '600_ncyc2b']
Standard deviation:  1400.12430883

Replicated spectra:  ['600_ncyc3', '600_ncyc3b']
Standard deviation:  811.831242263

Variance averaging over all spectra.
Standard deviation for all spins:  1073.693750881971

relax> spectrum.error_analysis(subset=['800_ref', '800_ncyc12', '800_ncyc1', '800_ncyc10', '800_ncyc2', '800_ncyc8', '800_ncyc3', '800_ncyc6', '800_ncyc4', '800_ncyc5', '800_ncyc1b', '800_ncyc2b', '800_ncyc3b'])
Intensity measure:  Peak heights.
Replicated spectra:  Yes.
All spectra replicated:  No.

Replicated spectra:  ['800_ncyc1', '800_ncyc1b']
Standard deviation:  49429.299098

Replicated spectra:  ['800_ncyc2', '800_ncyc2b']
Standard deviation:  37546.6781406

Replicated spectra:  ['800_ncyc3', '800_ncyc3b']
Standard deviation:  87789.4493098

Variance averaging over all spectra.
Standard deviation for all spins:  34894.56205198071



---------------------
- The 'R2eff' model -
---------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='R2eff', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='R2eff')

relax> relax_disp.select_model(model='R2eff')
R2eff/R1rho value and error determination.

relax> calc(verbosity=1)
Calculating the R2eff/R1rho values for fixed relaxation time period data.
Spin ':135@S'.
Spin ':135@F'.
Spin ':137@S'.
Spin ':137@F'.

relax> relax_disp.plot_disp_curves(dir='mq_cr72_analysis/R2eff', force=True)
Opening the file 'mq_cr72_analysis/R2eff/disp_135_S.agr' for writing.
Opening the file 'mq_cr72_analysis/R2eff/disp_135_F.agr' for writing.
Opening the file 'mq_cr72_analysis/R2eff/disp_137_S.agr' for writing.
Opening the file 'mq_cr72_analysis/R2eff/disp_137_F.agr' for writing.
Opening the file 'mq_cr72_analysis/R2eff/grace2images.py' for writing.

relax> value.write(param='r2eff', file='r2eff.out', dir='mq_cr72_analysis/R2eff', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/R2eff/r2eff.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='r2eff', spin_id=None, plot_data='value', file='r2eff.agr', dir='mq_cr72_analysis/R2eff', force=True, norm=False)
Opening the file 'mq_cr72_analysis/R2eff/r2eff.agr' for writing.

relax> results.write(file='results', dir='mq_cr72_analysis/R2eff', compress_type=1, force=True)
Opening the file 'mq_cr72_analysis/R2eff/results.bz2' for writing.



----------------------
- The 'No Rex' model -
----------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='No Rex', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='No Rex')

relax> relax_disp.select_model(model='No Rex')
The model for no chemical exchange relaxation.

relax> value.copy(pipe_from='R2eff', pipe_to='No Rex', param='r2eff')

relax> grid_search(lower=None, upper=None, inc=11, constraints=True, verbosity=1)


Fitting to the spin block [':135@S']
------------------------------------

Unconstrained grid search size: 121 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 121 grid nodes.
k: 0        xk: [            0.1,             0.1]    fk: 143140.518182       
k: 1        xk: [           0.49,             0.1]    fk: 125256.372916       
k: 2        xk: [           0.88,             0.1]    fk: 109620.285867       
k: 3        xk: [           1.27,             0.1]    fk: 96232.2570372       
k: 4        xk: [           1.66,             0.1]    fk: 85092.2864249       
k: 5        xk: [           2.05,             0.1]    fk: 76200.3740307       
k: 6        xk: [           2.44,             0.1]    fk: 69556.5198545       
k: 7        xk: [           2.83,             0.1]    fk: 65160.7238963       
k: 8        xk: [           3.22,             0.1]    fk: 63012.9861561       
k: 17       xk: [           2.44,            0.49]    fk: 59164.5356936       
k: 18       xk: [           2.83,            0.49]    fk: 54768.7397354       
k: 19       xk: [           3.22,            0.49]    fk: 52621.0019952       
k: 28       xk: [           2.44,            0.88]    fk: 49782.062318        
k: 29       xk: [           2.83,            0.88]    fk: 45386.2663597       
k: 30       xk: [           3.22,            0.88]    fk: 43238.5286195       
k: 39       xk: [           2.44,            1.27]    fk: 41409.0997275       
k: 40       xk: [           2.83,            1.27]    fk: 37013.3037693       
k: 41       xk: [           3.22,            1.27]    fk: 34865.566029        
k: 50       xk: [           2.44,            1.66]    fk: 34045.6479222       
k: 51       xk: [           2.83,            1.66]    fk: 29649.8519639       
k: 52       xk: [           3.22,            1.66]    fk: 27502.1142237       
k: 62       xk: [           2.83,            2.05]    fk: 23295.9109438       
k: 63       xk: [           3.22,            2.05]    fk: 21148.1732036       
k: 73       xk: [           2.83,            2.44]    fk: 17951.4807089       
k: 74       xk: [           3.22,            2.44]    fk: 15803.7429687       
k: 84       xk: [           2.83,            2.83]    fk: 13616.5612592       
k: 85       xk: [           3.22,            2.83]    fk: 11468.8235189       
k: 95       xk: [           2.83,            3.22]    fk: 10291.1525946       
k: 96       xk: [           3.22,            3.22]    fk: 8143.41485439       
k: 106      xk: [           2.83,            3.61]    fk: 7975.25471524       
k: 107      xk: [           3.22,            3.61]    fk: 5827.51697502       
k: 118      xk: [           3.22,               4]    fk: 4521.12988084       

Optimised parameter values:
r2 (600.000 MHz):           32.200000000000003
r2 (800.000 MHz):           40.000000000000000


Fitting to the spin block [':135@F']
------------------------------------

Unconstrained grid search size: 121 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 121 grid nodes.
k: 0        xk: [            0.1,             0.1]    fk: 138935.178105       
k: 1        xk: [           0.49,             0.1]    fk: 122616.66637        
k: 2        xk: [           0.88,             0.1]    fk: 107725.027258       
k: 3        xk: [           1.27,             0.1]    fk: 94260.2607682       
k: 4        xk: [           1.66,             0.1]    fk: 82222.3669001       
k: 5        xk: [           2.05,             0.1]    fk: 71611.345654        
k: 6        xk: [           2.44,             0.1]    fk: 62427.1970299       
k: 7        xk: [           2.83,             0.1]    fk: 54669.9210277       
k: 8        xk: [           3.22,             0.1]    fk: 48339.5176476       
k: 9        xk: [           3.61,             0.1]    fk: 43435.9868895       
k: 10       xk: [              4,             0.1]    fk: 39959.3287533       
k: 20       xk: [           3.61,            0.49]    fk: 39487.2233817       
k: 21       xk: [              4,            0.49]    fk: 36010.5652455       
k: 31       xk: [           3.61,            0.88]    fk: 35786.2562181       
k: 32       xk: [              4,            0.88]    fk: 32309.5980819       
k: 43       xk: [              4,            1.27]    fk: 28856.4272626       
k: 54       xk: [              4,            1.66]    fk: 25651.0527875       
k: 65       xk: [              4,            2.05]    fk: 22693.4746567       
k: 76       xk: [              4,            2.44]    fk: 19983.6928701       
k: 87       xk: [              4,            2.83]    fk: 17521.7074278       
k: 98       xk: [              4,            3.22]    fk: 15307.5183297       
k: 109      xk: [              4,            3.61]    fk: 13341.1255759       
k: 120      xk: [              4,               4]    fk: 11622.5291663       

Optimised parameter values:
r2 (600.000 MHz):           40.000000000000000
r2 (800.000 MHz):           40.000000000000000


Fitting to the spin block [':137@S']
------------------------------------

Unconstrained grid search size: 121 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 121 grid nodes.
k: 0        xk: [            0.1,             0.1]    fk: 124046.862404       
k: 1        xk: [           0.49,             0.1]    fk: 108661.902926       
k: 2        xk: [           0.88,             0.1]    fk: 95324.5273187       
k: 3        xk: [           1.27,             0.1]    fk: 84034.7355829       
k: 4        xk: [           1.66,             0.1]    fk: 74792.5277182       
k: 5        xk: [           2.05,             0.1]    fk: 67597.9037246       
k: 6        xk: [           2.44,             0.1]    fk: 62450.863602        
k: 7        xk: [           2.83,             0.1]    fk: 59351.4073506       
k: 8        xk: [           3.22,             0.1]    fk: 58299.5349702       
k: 16       xk: [           2.05,            0.49]    fk: 58027.3618294       
k: 17       xk: [           2.44,            0.49]    fk: 52880.3217069       
k: 18       xk: [           2.83,            0.49]    fk: 49780.8654554       
k: 19       xk: [           3.22,            0.49]    fk: 48728.9930751       
k: 28       xk: [           2.44,            0.88]    fk: 44257.2665748       
k: 29       xk: [           2.83,            0.88]    fk: 41157.8103233       
k: 30       xk: [           3.22,            0.88]    fk: 40105.937943        
k: 39       xk: [           2.44,            1.27]    fk: 36581.6982058       
k: 40       xk: [           2.83,            1.27]    fk: 33482.2419543       
k: 41       xk: [           3.22,            1.27]    fk: 32430.369574        
k: 50       xk: [           2.44,            1.66]    fk: 29853.6165998       
k: 51       xk: [           2.83,            1.66]    fk: 26754.1603484       
k: 52       xk: [           3.22,            1.66]    fk: 25702.287968        
k: 61       xk: [           2.44,            2.05]    fk: 24073.0217569       
k: 62       xk: [           2.83,            2.05]    fk: 20973.5655055       
k: 63       xk: [           3.22,            2.05]    fk: 19921.6931252       
k: 72       xk: [           2.44,            2.44]    fk: 19239.9136771       
k: 73       xk: [           2.83,            2.44]    fk: 16140.4574257       
k: 74       xk: [           3.22,            2.44]    fk: 15088.5850453       
k: 84       xk: [           2.83,            2.83]    fk: 12254.836109        
k: 85       xk: [           3.22,            2.83]    fk: 11202.9637286       
k: 95       xk: [           2.83,            3.22]    fk: 9316.70155529       
k: 96       xk: [           3.22,            3.22]    fk: 8264.82917494       
k: 106      xk: [           2.83,            3.61]    fk: 7326.05376469       
k: 107      xk: [           3.22,            3.61]    fk: 6274.18138434       
k: 118      xk: [           3.22,               4]    fk: 5231.0203568        

Optimised parameter values:
r2 (600.000 MHz):           32.200000000000003
r2 (800.000 MHz):           40.000000000000000


Fitting to the spin block [':137@F']
------------------------------------

Unconstrained grid search size: 121 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 121 grid nodes.
k: 0        xk: [            0.1,             0.1]    fk: 60693.2288673       
k: 1        xk: [           0.49,             0.1]    fk: 54070.8814197       
k: 2        xk: [           0.88,             0.1]    fk: 47977.0232762       
k: 3        xk: [           1.27,             0.1]    fk: 42411.6544367       
k: 4        xk: [           1.66,             0.1]    fk: 37374.7749011       
k: 5        xk: [           2.05,             0.1]    fk: 32866.3846696       
k: 6        xk: [           2.44,             0.1]    fk: 28886.4837421       
k: 7        xk: [           2.83,             0.1]    fk: 25435.0721186       
k: 8        xk: [           3.22,             0.1]    fk: 22512.1497991       
k: 9        xk: [           3.61,             0.1]    fk: 20117.7167835       
k: 10       xk: [              4,             0.1]    fk: 18251.773072        
k: 21       xk: [              4,            0.49]    fk: 16621.4573626       
k: 32       xk: [              4,            0.88]    fk: 15091.5710041       
k: 43       xk: [              4,            1.27]    fk: 13662.1139965       
k: 54       xk: [              4,            1.66]    fk: 12333.0863397       
k: 65       xk: [              4,            2.05]    fk: 11104.4880338       
k: 76       xk: [              4,            2.44]    fk: 9976.31907879       
k: 87       xk: [              4,            2.83]    fk: 8948.57947464       
k: 98       xk: [              4,            3.22]    fk: 8021.26922136       
k: 109      xk: [              4,            3.61]    fk: 7194.38831895       
k: 120      xk: [              4,               4]    fk: 6467.93676742       

Optimised parameter values:
r2 (600.000 MHz):           40.000000000000000
r2 (800.000 MHz):           40.000000000000000

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':135@S']
------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           3.22,               4]    fk: 4521.12988084       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           3.22,             4.2]    fk: 4242.69788944       

	Parameter values: [3.3975962628439444, 4.3096912150951283]
	Function value:   3969.6823533898587
	Iterations:       55
	Function calls:   110
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    3.397596263,     4.309691215]    fk: 3969.76481864       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.397596263,     4.309691215]    fk: 3969.76399399       

	Parameter values: [3.3975960992027705, 4.3096909472914104]
	Function value:   3969.7639939888591
	Iterations:       49
	Function calls:   99
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    3.397596099,     4.309690947]    fk: 3969.76481864       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.397596099,     4.309690947]    fk: 3969.76481039       

	Parameter values: [3.3975960906645426, 4.3096909483454651]
	Function value:   3969.764810394845
	Iterations:       50
	Function calls:   103
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    3.397596091,     4.309690948]    fk: 3969.76481864       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.397596091,     4.309690948]    fk: 3969.76481856       

	Parameter values: [3.3975960906645426, 4.3096909483454651]
	Function value:   3969.7648185589042
	Iterations:       50
	Function calls:   102
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [    3.397596091,     4.309690948]    fk: 3969.76481864       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.397596091,     4.309690948]    fk: 3969.76481864       

	Parameter values: [3.3975960906645426, 4.3096909483454651]
	Function value:   3969.7648186405454
	Iterations:       50
	Function calls:   102
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [    3.397596091,     4.309690948]    fk: 3969.76481864       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.397596091,     4.309690948]    fk: 3969.76481864       

	Parameter values: [3.3975960906645426, 4.3096909483454651]
	Function value:   3969.7648186413617
	Iterations:       50
	Function calls:   102
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [    3.397596091,     4.309690948]    fk: 3969.76481864       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.397596091,     4.309690948]    fk: 3969.76481864       

	Parameter values: [3.3975960906645426, 4.3096909483454651]
	Function value:   3969.7648186413699
	Iterations:       50
	Function calls:   102
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [    3.397596091,     4.309690948]    fk: 3969.76481864       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.397596091,     4.309690948]    fk: 3969.76481864       

	Parameter values: [3.3975960906645426, 4.3096909483454651]
	Function value:   3969.7648186413699
	Iterations:       50
	Function calls:   102
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [3.3975960906645426, 4.3096909483454651]
Function value:   3969.7648186413699
Iterations:       404
Function calls:   822
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (600.000 MHz):           33.975960906645426
r2 (800.000 MHz):           43.096909483454652


Fitting to the spin block [':135@F']
------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              4,               4]    fk: 11622.5291663       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [            4.2,               4]    fk: 10393.0317546       
	k: 100      xk: [    4.755257835,     6.509853135]    fk: 3815.51578158       

	Parameter values: [4.7552578354055752, 6.5098531346214257]
	Function value:   3815.5157815780271
	Iterations:       102
	Function calls:   244
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 1        xk: [    4.755257835,     6.509853135]    fk: 3815.6033692        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.755257835,     6.509853135]    fk: 3815.60249332       

	Parameter values: [4.7552576922923038, 6.5098526458195884]
	Function value:   3815.6024933219273
	Iterations:       51
	Function calls:   104
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    4.755257692,     6.509852646]    fk: 3815.6033692        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.755257692,     6.509852646]    fk: 3815.60336044       

	Parameter values: [4.7552576922923038, 6.5098526458195884]
	Function value:   3815.6033604393638
	Iterations:       53
	Function calls:   110
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    4.755257692,     6.509852646]    fk: 3815.6033692        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.755257692,     6.509852646]    fk: 3815.60336911       

	Parameter values: [4.7552576922923038, 6.5098526458195884]
	Function value:   3815.6033691105376
	Iterations:       53
	Function calls:   110
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [    4.755257692,     6.509852646]    fk: 3815.6033692        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.755257692,     6.509852646]    fk: 3815.6033692        

	Parameter values: [4.7552576922923038, 6.5098526458195884]
	Function value:   3815.6033691972498
	Iterations:       53
	Function calls:   110
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [    4.755257692,     6.509852646]    fk: 3815.6033692        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.755257692,     6.509852646]    fk: 3815.6033692        

	Parameter values: [4.7552576922923038, 6.5098526458195884]
	Function value:   3815.603369198117
	Iterations:       53
	Function calls:   110
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [    4.755257692,     6.509852646]    fk: 3815.6033692        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.755257692,     6.509852646]    fk: 3815.6033692        

	Parameter values: [4.7552576922923038, 6.5098526458195884]
	Function value:   3815.6033691981256
	Iterations:       53
	Function calls:   110
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [    4.755257692,     6.509852646]    fk: 3815.6033692        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.755257692,     6.509852646]    fk: 3815.6033692        

	Parameter values: [4.7552576922923038, 6.5098526458195884]
	Function value:   3815.6033691981256
	Iterations:       53
	Function calls:   110
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [4.7552576922923038, 6.5098526458195884]
Function value:   3815.6033691981256
Iterations:       471
Function calls:   1008
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (600.000 MHz):           47.552576922923038
r2 (800.000 MHz):           65.098526458195892


Fitting to the spin block [':137@S']
------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           3.22,               4]    fk: 5231.0203568        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           3.22,             4.2]    fk: 5063.51680651       

	Parameter values: [3.2253486441231956, 4.2343812755192491]
	Function value:   5059.6424678892499
	Iterations:       48
	Function calls:   95
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    3.225348644,     4.234381276]    fk: 5059.72438768       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.225348644,     4.234381276]    fk: 5059.72356848       

	Parameter values: [3.2253484343959968, 4.2343809746334387]
	Function value:   5059.723568477928
	Iterations:       48
	Function calls:   98
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    3.225348434,     4.234380975]    fk: 5059.72438768       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.225348434,     4.234380975]    fk: 5059.72437948       

	Parameter values: [3.2253484378011774, 4.2343809888456825]
	Function value:   5059.7243794838078
	Iterations:       56
	Function calls:   127
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    3.225348438,     4.234380989]    fk: 5059.72438768       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.225348438,     4.234380989]    fk: 5059.72438759       

	Parameter values: [3.2253484378011774, 4.2343809888456825]
	Function value:   5059.7243875938657
	Iterations:       62
	Function calls:   152
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [    3.225348438,     4.234380989]    fk: 5059.72438768       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.225348438,     4.234380989]    fk: 5059.72438767       

	Parameter values: [3.2253484378011774, 4.2343809888456825]
	Function value:   5059.7243876749671
	Iterations:       62
	Function calls:   152
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [    3.225348438,     4.234380989]    fk: 5059.72438768       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.225348438,     4.234380989]    fk: 5059.72438768       

	Parameter values: [3.2253484378011774, 4.2343809888456825]
	Function value:   5059.7243876757784
	Iterations:       62
	Function calls:   152
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [    3.225348438,     4.234380989]    fk: 5059.72438768       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.225348438,     4.234380989]    fk: 5059.72438768       

	Parameter values: [3.2253484378011774, 4.2343809888456825]
	Function value:   5059.7243876757866
	Iterations:       62
	Function calls:   152
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [    3.225348438,     4.234380989]    fk: 5059.72438768       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    3.225348438,     4.234380989]    fk: 5059.72438768       

	Parameter values: [3.2253484378011774, 4.2343809888456825]
	Function value:   5059.7243876757866
	Iterations:       62
	Function calls:   152
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [3.2253484378011774, 4.2343809888456825]
Function value:   5059.7243876757866
Iterations:       462
Function calls:   1080
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (600.000 MHz):           32.253484378011777
r2 (800.000 MHz):           42.343809888456825


Fitting to the spin block [':137@F']
------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              4,               4]    fk: 6467.93676742       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [            4.2,               4]    fk: 5715.96144223       

	Parameter values: [5.1819781745410607, 6.6260500255651733]
	Function value:   1763.9974513664874
	Iterations:       70
	Function calls:   136
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [    5.181978175,     6.626050026]    fk: 1764.08570485       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    5.181978175,     6.626050026]    fk: 1764.08482232       

	Parameter values: [5.1819778105495491, 6.6260488753042264]
	Function value:   1764.0848223173407
	Iterations:       51
	Function calls:   105
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [    5.181977811,     6.626048875]    fk: 1764.08570485       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    5.181977811,     6.626048875]    fk: 1764.08569603       

	Parameter values: [5.1819778105495491, 6.6260488753042264]
	Function value:   1764.0856960268427
	Iterations:       48
	Function calls:   99
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    5.181977811,     6.626048875]    fk: 1764.08570485       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    5.181977811,     6.626048875]    fk: 1764.08570476       

	Parameter values: [5.1819778105495491, 6.6260488753042264]
	Function value:   1764.0857047639379
	Iterations:       48
	Function calls:   99
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [    5.181977811,     6.626048875]    fk: 1764.08570485       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    5.181977811,     6.626048875]    fk: 1764.08570485       

	Parameter values: [5.1819778105495491, 6.6260488753042264]
	Function value:   1764.0857048513083
	Iterations:       48
	Function calls:   99
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [    5.181977811,     6.626048875]    fk: 1764.08570485       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    5.181977811,     6.626048875]    fk: 1764.08570485       

	Parameter values: [5.1819778105495491, 6.6260488753042264]
	Function value:   1764.0857048521825
	Iterations:       48
	Function calls:   99
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [    5.181977811,     6.626048875]    fk: 1764.08570485       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    5.181977811,     6.626048875]    fk: 1764.08570485       

	Parameter values: [5.1819778105495491, 6.6260488753042264]
	Function value:   1764.0857048521912
	Iterations:       48
	Function calls:   99
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [    5.181977811,     6.626048875]    fk: 1764.08570485       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    5.181977811,     6.626048875]    fk: 1764.08570485       

	Parameter values: [5.1819778105495491, 6.6260488753042264]
	Function value:   1764.0857048521912
	Iterations:       48
	Function calls:   99
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [5.1819778105495491, 6.6260488753042264]
Function value:   1764.0857048521912
Iterations:       409
Function calls:   835
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (600.000 MHz):           51.819778105495487
r2 (800.000 MHz):           66.260488753042267

relax> relax_disp.plot_disp_curves(dir='mq_cr72_analysis/No Rex', force=True)
Opening the file 'mq_cr72_analysis/No Rex/disp_135_S.agr' for writing.
Opening the file 'mq_cr72_analysis/No Rex/disp_135_F.agr' for writing.
Opening the file 'mq_cr72_analysis/No Rex/disp_137_S.agr' for writing.
Opening the file 'mq_cr72_analysis/No Rex/disp_137_F.agr' for writing.
Opening the file 'mq_cr72_analysis/No Rex/grace2images.py' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='mq_cr72_analysis/No Rex', force=True, norm=False)
Opening the file 'mq_cr72_analysis/No Rex/chi2.agr' for writing.

relax> results.write(file='results', dir='mq_cr72_analysis/No Rex', compress_type=1, force=True)
Opening the file 'mq_cr72_analysis/No Rex/results.bz2' for writing.



-----------------------
- The 'MQ CR72' model -
-----------------------


relax> pipe.copy(pipe_from='base pipe', pipe_to='MQ CR72', bundle_to='relax_disp')

relax> pipe.switch(pipe_name='MQ CR72')

relax> relax_disp.select_model(model='MQ CR72')
The Carver and Richards (1972) 2-site model for all time scales expanded for MQ CPMG data by Korzhnev et al., 2004.

relax> value.copy(pipe_from='R2eff', pipe_to='MQ CR72', param='r2eff')

relax> grid_search(lower=None, upper=None, inc=11, constraints=True, verbosity=1)
The spin ':135@S' parameter 'dw' is pre-set to 0.625, skipping it in the grid search.
The spin ':135@S' parameter 'dwH' is pre-set to 0.033, skipping it in the grid search.
The spin ':135@F' parameter 'dw' is pre-set to 0.625, skipping it in the grid search.
The spin ':135@F' parameter 'dwH' is pre-set to 0.033, skipping it in the grid search.
The spin ':137@S' parameter 'dw' is pre-set to 0.981, skipping it in the grid search.
The spin ':137@S' parameter 'dwH' is pre-set to 0.01, skipping it in the grid search.
The spin ':137@F' parameter 'dw' is pre-set to 0.981, skipping it in the grid search.
The spin ':137@F' parameter 'dwH' is pre-set to 0.01, skipping it in the grid search.


Fitting to the spin block [':135@S']
------------------------------------

Unconstrained grid search size: 14641 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 14641 grid nodes.
k: 0        xk: [            0.1,             0.1,           0.625,           0.033,             0.5,          0.0001]    fk: 1.0708642351e+202   
k: 1331     xk: [            0.1,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 188360.498009       
k: 1332     xk: [           0.49,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 166137.196697       
k: 1333     xk: [           0.88,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 146161.953604       
k: 1334     xk: [           1.27,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 128434.768728       
k: 1335     xk: [           1.66,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 112955.642071       
k: 1336     xk: [           2.05,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 99724.5736311       
k: 1337     xk: [           2.44,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 88741.5634095       
k: 1338     xk: [           2.83,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 80006.611406        
k: 1339     xk: [           3.22,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 73519.7176204       
k: 1340     xk: [           3.61,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 69280.8820529       
k: 1341     xk: [              4,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 67290.1047033       
k: 1350     xk: [           3.22,            0.49,           0.625,           0.033,             0.5,         1.00009]    fk: 62653.362064        
k: 1351     xk: [           3.61,            0.49,           0.625,           0.033,             0.5,         1.00009]    fk: 58414.5264964       
k: 1352     xk: [              4,            0.49,           0.625,           0.033,             0.5,         1.00009]    fk: 56423.7491469       
k: 1361     xk: [           3.22,            0.88,           0.625,           0.033,             0.5,         1.00009]    fk: 52796.5172927       
k: 1362     xk: [           3.61,            0.88,           0.625,           0.033,             0.5,         1.00009]    fk: 48557.6817252       
k: 1363     xk: [              4,            0.88,           0.625,           0.033,             0.5,         1.00009]    fk: 46566.9043756       
k: 1372     xk: [           3.22,            1.27,           0.625,           0.033,             0.5,         1.00009]    fk: 43949.1833066       
k: 1373     xk: [           3.61,            1.27,           0.625,           0.033,             0.5,         1.00009]    fk: 39710.3477391       
k: 1374     xk: [              4,            1.27,           0.625,           0.033,             0.5,         1.00009]    fk: 37719.5703895       
k: 1383     xk: [           3.22,            1.66,           0.625,           0.033,             0.5,         1.00009]    fk: 36111.3601057       
k: 1384     xk: [           3.61,            1.66,           0.625,           0.033,             0.5,         1.00009]    fk: 31872.5245382       
k: 1385     xk: [              4,            1.66,           0.625,           0.033,             0.5,         1.00009]    fk: 29881.7471886       
k: 1394     xk: [           3.22,            2.05,           0.625,           0.033,             0.5,         1.00009]    fk: 29283.04769         
k: 1395     xk: [           3.61,            2.05,           0.625,           0.033,             0.5,         1.00009]    fk: 25044.2121225       
k: 1396     xk: [              4,            2.05,           0.625,           0.033,             0.5,         1.00009]    fk: 23053.4347729       
k: 1406     xk: [           3.61,            2.44,           0.625,           0.033,             0.5,         1.00009]    fk: 19225.4104919       
k: 1407     xk: [              4,            2.44,           0.625,           0.033,             0.5,         1.00009]    fk: 17234.6331424       
k: 1417     xk: [           3.61,            2.83,           0.625,           0.033,             0.5,         1.00009]    fk: 14416.1196466       
k: 1418     xk: [              4,            2.83,           0.625,           0.033,             0.5,         1.00009]    fk: 12425.342297        
k: 1428     xk: [           3.61,            3.22,           0.625,           0.033,             0.5,         1.00009]    fk: 10616.3395864       
k: 1429     xk: [              4,            3.22,           0.625,           0.033,             0.5,         1.00009]    fk: 8625.5622369        
k: 1439     xk: [           3.61,            3.61,           0.625,           0.033,             0.5,         1.00009]    fk: 7826.07031149       
k: 1440     xk: [              4,            3.61,           0.625,           0.033,             0.5,         1.00009]    fk: 5835.29296194       
k: 1451     xk: [              4,               4,           0.625,           0.033,             0.5,         1.00009]    fk: 4054.53447216       
k: 1571     xk: [           3.61,               4,           0.625,           0.033,            0.55,         1.00009]    fk: 3919.56010576       
k: 1572     xk: [              4,               4,           0.625,           0.033,            0.55,         1.00009]    fk: 3369.31399421       
k: 1692     xk: [           3.61,               4,           0.625,           0.033,             0.6,         1.00009]    fk: 3161.96903614       
RelaxWarning: overflow encountered in cdouble_scalars
RelaxWarning: overflow encountered in cdouble_scalars
RelaxWarning: invalid value encountered in cdouble_scalars
RelaxWarning: invalid value encountered in cdouble_scalars
RelaxWarning: overflow encountered in sin
RelaxWarning: overflow encountered in sin
RelaxWarning: overflow encountered in cosh
RelaxWarning: invalid value encountered in cosh
RelaxWarning: invalid value encountered in cdouble_scalars

Optimised parameter values:
r2 (600.000 MHz):           36.100000000000001
r2 (800.000 MHz):           40.000000000000000
dw:                          0.625000000000000
dwH:                         0.033000000000000
pA:                          0.600000000000000
kex:                     10000.900000000001455


Fitting to the spin block [':135@F']
------------------------------------

Unconstrained grid search size: 14641 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 14641 grid nodes.
k: 0        xk: [            0.1,             0.1,           0.625,           0.033,             0.5,          0.0001]    fk: 5.50515767997e+201  
k: 1331     xk: [            0.1,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 176249.236387       
k: 1332     xk: [           0.49,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 157157.144859       
k: 1333     xk: [           0.88,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 139491.925953       
k: 1334     xk: [           1.27,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 123253.579669       
k: 1335     xk: [           1.66,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 108442.106006       
k: 1336     xk: [           2.05,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 95057.5049662       
k: 1337     xk: [           2.44,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 83099.7765481       
k: 1338     xk: [           2.83,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 72568.9207519       
k: 1339     xk: [           3.22,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 63464.9375777       
k: 1340     xk: [           3.61,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 55787.8270255       
k: 1341     xk: [              4,             0.1,           0.625,           0.033,             0.5,         1.00009]    fk: 49537.5890953       
k: 1352     xk: [              4,            0.49,           0.625,           0.033,             0.5,         1.00009]    fk: 45460.1926077       
k: 1363     xk: [              4,            0.88,           0.625,           0.033,             0.5,         1.00009]    fk: 41630.5924644       
k: 1374     xk: [              4,            1.27,           0.625,           0.033,             0.5,         1.00009]    fk: 38048.7886653       
k: 1385     xk: [              4,            1.66,           0.625,           0.033,             0.5,         1.00009]    fk: 34714.7812105       
k: 1396     xk: [              4,            2.05,           0.625,           0.033,             0.5,         1.00009]    fk: 31628.5700999       
k: 1407     xk: [              4,            2.44,           0.625,           0.033,             0.5,         1.00009]    fk: 28790.1553336       
k: 1418     xk: [              4,            2.83,           0.625,           0.033,             0.5,         1.00009]    fk: 26199.5369115       
k: 1429     xk: [              4,            3.22,           0.625,           0.033,             0.5,         1.00009]    fk: 23856.7148336       
k: 1440     xk: [              4,            3.61,           0.625,           0.033,             0.5,         1.00009]    fk: 21761.6891001       
k: 1451     xk: [              4,               4,           0.625,           0.033,             0.5,         1.00009]    fk: 19914.4597107       
k: 1550     xk: [              4,            3.22,           0.625,           0.033,            0.55,         1.00009]    fk: 19269.8351787       
k: 1561     xk: [              4,            3.61,           0.625,           0.033,            0.55,         1.00009]    fk: 17329.5907066       
k: 1572     xk: [              4,               4,           0.625,           0.033,            0.55,         1.00009]    fk: 15637.1425787       
k: 1682     xk: [              4,            3.61,           0.625,           0.033,             0.6,         1.00009]    fk: 14098.9296392       
k: 1693     xk: [              4,               4,           0.625,           0.033,             0.6,         1.00009]    fk: 12533.3130824       
k: 1803     xk: [              4,            3.61,           0.625,           0.033,            0.65,         1.00009]    fk: 11854.7464261       
k: 1814     xk: [              4,               4,           0.625,           0.033,            0.65,         1.00009]    fk: 10386.5333003       
k: 1935     xk: [              4,               4,           0.625,           0.033,             0.7,         1.00009]    fk: 9005.26581528       
k: 2056     xk: [              4,               4,           0.625,           0.033,            0.75,         1.00009]    fk: 8232.32149515       
k: 2177     xk: [              4,               4,           0.625,           0.033,             0.8,         1.00009]    fk: 7954.91148671       

Optimised parameter values:
r2 (600.000 MHz):           40.000000000000000
r2 (800.000 MHz):           40.000000000000000
dw:                          0.625000000000000
dwH:                         0.033000000000000
pA:                          0.800000000000000
kex:                     10000.900000000001455


Fitting to the spin block [':137@S']
------------------------------------

Unconstrained grid search size: 14641 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 14641 grid nodes.
k: 0        xk: [            0.1,             0.1,           0.981,            0.01,             0.5,          0.0001]    fk: 9.84572858041e+201  
k: 1331     xk: [            0.1,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 74382.1019361       
k: 1332     xk: [           0.49,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 60649.2642781       
k: 1333     xk: [           0.88,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 48964.0104911       
k: 1334     xk: [           1.27,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 39326.3405753       
k: 1335     xk: [           1.66,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 31736.2545306       
k: 1336     xk: [           2.05,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 26193.752357        
k: 1337     xk: [           2.44,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 22698.8340544       
k: 1338     xk: [           2.83,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 21251.499623        
k: 1347     xk: [           2.05,            0.49,           0.981,            0.01,             0.5,         1.00009]    fk: 20780.3781662       
k: 1348     xk: [           2.44,            0.49,           0.981,            0.01,             0.5,         1.00009]    fk: 17285.4598636       
k: 1349     xk: [           2.83,            0.49,           0.981,            0.01,             0.5,         1.00009]    fk: 15838.1254322       
k: 1359     xk: [           2.44,            0.88,           0.981,            0.01,             0.5,         1.00009]    fk: 12819.5724359       
k: 1360     xk: [           2.83,            0.88,           0.981,            0.01,             0.5,         1.00009]    fk: 11372.2380045       
k: 1370     xk: [           2.44,            1.27,           0.981,            0.01,             0.5,         1.00009]    fk: 9301.17177132       
k: 1371     xk: [           2.83,            1.27,           0.981,            0.01,             0.5,         1.00009]    fk: 7853.83733987       
k: 1381     xk: [           2.44,            1.66,           0.981,            0.01,             0.5,         1.00009]    fk: 6730.25786977       
k: 1382     xk: [           2.83,            1.66,           0.981,            0.01,             0.5,         1.00009]    fk: 5282.92343831       
k: 1392     xk: [           2.44,            2.05,           0.981,            0.01,             0.5,         1.00009]    fk: 5106.83073128       
k: 1393     xk: [           2.83,            2.05,           0.981,            0.01,             0.5,         1.00009]    fk: 3659.49629983       
k: 1404     xk: [           2.83,            2.44,           0.981,            0.01,             0.5,         1.00009]    fk: 2983.55592441       

Optimised parameter values:
r2 (600.000 MHz):           28.300000000000001
r2 (800.000 MHz):           24.399999999999999
dw:                          0.981000000000000
dwH:                         0.010000000000000
pA:                          0.500000000000000
kex:                     10000.900000000001455


Fitting to the spin block [':137@F']
------------------------------------

Unconstrained grid search size: 14641 (constraints may decrease this size).


Grid search
~~~~~~~~~~~

Searching through 14641 grid nodes.
k: 0        xk: [            0.1,             0.1,           0.981,            0.01,             0.5,          0.0001]    fk: 2.06745119946e+201  
k: 1331     xk: [            0.1,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 48676.3668427       
k: 1332     xk: [           0.49,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 42460.0330241       
k: 1333     xk: [           0.88,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 36772.1885094       
k: 1334     xk: [           1.27,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 31612.8332988       
k: 1335     xk: [           1.66,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 26981.9673922       
k: 1336     xk: [           2.05,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 22879.5907896       
k: 1337     xk: [           2.44,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 19305.7034909       
k: 1338     xk: [           2.83,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 16260.3054963       
k: 1339     xk: [           3.22,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 13743.3968057       
k: 1340     xk: [           3.61,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 11754.9774191       
k: 1341     xk: [              4,             0.1,           0.981,            0.01,             0.5,         1.00009]    fk: 10295.0473365       
k: 1352     xk: [              4,            0.49,           0.981,            0.01,             0.5,         1.00009]    fk: 9095.52662702       
k: 1363     xk: [              4,            0.88,           0.981,            0.01,             0.5,         1.00009]    fk: 7996.43526844       
k: 1374     xk: [              4,            1.27,           0.981,            0.01,             0.5,         1.00009]    fk: 6997.77326073       
k: 1385     xk: [              4,            1.66,           0.981,            0.01,             0.5,         1.00009]    fk: 6099.54060389       
k: 1396     xk: [              4,            2.05,           0.981,            0.01,             0.5,         1.00009]    fk: 5301.73729793       
k: 1407     xk: [              4,            2.44,           0.981,            0.01,             0.5,         1.00009]    fk: 4604.36334284       
k: 1418     xk: [              4,            2.83,           0.981,            0.01,             0.5,         1.00009]    fk: 4007.41873862       
k: 1429     xk: [              4,            3.22,           0.981,            0.01,             0.5,         1.00009]    fk: 3510.90348528       
k: 1440     xk: [              4,            3.61,           0.981,            0.01,             0.5,         1.00009]    fk: 3114.81758281       
k: 1451     xk: [              4,               4,           0.981,            0.01,             0.5,         1.00009]    fk: 2819.16103121       
k: 1550     xk: [              4,            3.22,           0.981,            0.01,            0.55,         1.00009]    fk: 2647.61939957       
k: 1561     xk: [              4,            3.61,           0.981,            0.01,            0.55,         1.00009]    fk: 2308.69549348       
k: 1572     xk: [              4,               4,           0.981,            0.01,            0.55,         1.00009]    fk: 2070.20093826       
k: 1682     xk: [              4,            3.61,           0.981,            0.01,             0.6,         1.00009]    fk: 1874.14257211       
k: 1693     xk: [              4,               4,           0.981,            0.01,             0.6,         1.00009]    fk: 1671.72090763       
k: 1814     xk: [              4,               4,           0.981,            0.01,            0.65,         1.00009]    fk: 1501.12847548       
k: 1935     xk: [              4,               4,           0.981,            0.01,             0.7,         1.00009]    fk: 1477.58865342       

Optimised parameter values:
r2 (600.000 MHz):           40.000000000000000
r2 (800.000 MHz):           40.000000000000000
dw:                          0.981000000000000
dwH:                         0.010000000000000
pA:                          0.700000000000000
kex:                     10000.900000000001455

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':135@S']
------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           3.61,               4,           0.625,           0.033,             0.6,         1.00009]    fk: 3161.96903614       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           3.61,               4,         0.65625,           0.033,             0.6,         1.00009]    fk: 3057.30290932       
	k: 100      xk: [     3.35146166,     3.181102408,    0.6795942709,   0.05371509199,    0.5110014724,     0.482327976]    fk: 1658.55795584       
	k: 200      xk: [    4.371185695,     4.903342071,    0.2865726956,   0.06762787703,    0.5070654185,   0.05998920794]    fk: 327.666700617       
	k: 300      xk: [    4.375570101,     4.917065413,    0.2868041723,   0.06743037082,    0.5067066449,   0.06116003583]    fk: 327.028647605       
	k: 400      xk: [    4.410912992,     4.950141048,    0.2871548766,   0.06670018557,    0.5000939777,   0.06171785967]    fk: 326.427264751       

	Parameter values: [4.4103600607327298, 4.9567559798173653, 0.28696328720880515, 0.066535786727602769, 0.50008761167787497, 0.061060127320397908]
	Function value:   326.26795495561055
	Iterations:       500
	Function calls:   800
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [    4.410360061,      4.95675598,    0.2869632872,   0.06653578673,    0.5000876117,   0.06106012732]    fk: 326.238346509       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.410360061,      4.95675598,    0.2869632872,   0.06653578673,    0.5000876117,   0.06106012732]    fk: 326.238750195       
	k: 100      xk: [    4.483781379,      5.13972864,    0.2914815847,  0.006439197751,     0.511561729,   0.05618878833]    fk: 308.86691475        
	k: 200      xk: [    4.512792129,     5.163077394,    0.2908891169, 1.364011727e-05,    0.5051124463,   0.05712011586]    fk: 307.851214414       
	k: 300      xk: [    4.525994742,     5.175103961,    0.2909399633, 0.0003782992701,    0.5022886262,   0.05711663505]    fk: 307.731870811       
	k: 400      xk: [    4.538413704,     5.190903712,    0.2909624725,  0.001428288453,    0.5000025726,   0.05681265115]    fk: 307.580427033       

	Parameter values: [4.5383674702539594, 5.1908831567070379, 0.29095889863599778, 0.0014055398010065336, 0.50000323487242726, 0.056833966947295506]
	Function value:   307.58033936278093
	Iterations:       500
	Function calls:   802
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [     4.53836747,     5.190883157,    0.2909588986,  0.001405539801,    0.5000032349,   0.05683396695]    fk: 307.579333255       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     4.53836747,     5.190883157,    0.2909588986,  0.001405539801,    0.5000032349,   0.05683396695]    fk: 307.579338166       
	k: 100      xk: [    4.538344492,     5.190969148,    0.2909328895,  0.000941527964,    0.5000187065,   0.05681369803]    fk: 307.574975276       
	k: 200      xk: [    4.538745129,     5.190908231,    0.2909172499, 1.877440728e-05,    0.5000000046,   0.05681730556]    fk: 307.569502017       
	k: 300      xk: [    4.538739549,     5.190890688,     0.290920216, 9.792429692e-06,    0.5000000244,   0.05681967596]    fk: 307.569498893       
	k: 400      xk: [     4.53873903,     5.190888996,    0.2909205094, 8.505628113e-06,     0.500000024,   0.05681992908]    fk: 307.569498835       

	Parameter values: [4.5387650012899563, 5.1909193716433766, 0.29091464958655677, 1.4196561508596622e-05, 0.50000001257856974, 0.056819118582501923]
	Function value:   307.56948945486613
	Iterations:       500
	Function calls:   816
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [    4.538765001,     5.190919372,    0.2909146496, 1.419656151e-05,    0.5000000126,   0.05681911858]    fk: 307.569471648       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.538765001,     5.190919372,    0.2909146496, 1.419656151e-05,    0.5000000126,   0.05681911858]    fk: 307.569469399       
	k: 100      xk: [    4.538765001,     5.190919372,    0.2909146496, 1.419656151e-05,    0.5000000126,   0.05681911858]    fk: 307.569469399       
	k: 200      xk: [     4.53870906,      5.19101443,     0.290913359, 1.427674734e-05,    0.5000000003,   0.05680930846]    fk: 307.569401692       
	k: 300      xk: [    4.538707898,     5.191024034,       0.2909126, 8.735651319e-06,    0.5000000001,   0.05680908377]    fk: 307.569401321       
	k: 400      xk: [    4.538709753,      5.19101515,    0.2909131975, 6.772725953e-07,    0.5000000003,   0.05680942105]    fk: 307.569400681       

	Parameter values: [4.5387097581592508, 5.1910151786359666, 0.29091319399294746, 6.8641940017691074e-07, 0.50000000024963098, 0.056809421903839245]
	Function value:   307.56940068130433
	Iterations:       500
	Function calls:   924
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [    4.538709758,     5.191015179,     0.290913194, 6.864194002e-07,    0.5000000002,    0.0568094219]    fk: 307.569400409       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.538709758,     5.191015179,     0.290913194, 6.864194002e-07,    0.5000000002,    0.0568094219]    fk: 307.569400412       
	k: 100      xk: [    4.538738459,     5.190983725,    0.2909468219, 6.976066663e-07,    0.5000003612,   0.05679541291]    fk: 307.568938516       
	k: 200      xk: [    4.538812702,     5.191022051,    0.2909508548, 6.478077755e-07,    0.5000000004,   0.05681251458]    fk: 307.568747436       
	k: 300      xk: [    4.539010758,     5.191317459,    0.2909270934,  1.17178351e-06,    0.5000003311,   0.05678834151]    fk: 307.568362237       
	k: 400      xk: [    4.539109571,     5.191528952,    0.2909038954, 1.648476677e-06,    0.5000005827,   0.05675298285]    fk: 307.56820976        

	Parameter values: [4.5391179604776895, 5.1915494841743506, 0.29090110838868766, 1.6912976336532068e-06, 0.50000000217507035, 0.056749708423904033]
	Function value:   307.56818527014309
	Iterations:       500
	Function calls:   819
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 5        xk: [     4.53911796,     5.191549484,    0.2909011084, 1.691297634e-06,    0.5000000022,   0.05674970842]    fk: 307.568185268       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     4.53911796,     5.191549484,    0.2909011084, 1.691297634e-06,    0.5000000022,   0.05674970842]    fk: 307.568185268       
	k: 100      xk: [     4.53911796,     5.191549484,    0.2909011084, 1.691297634e-06,    0.5000000022,   0.05674970842]    fk: 307.568185268       
	k: 200      xk: [    4.539116786,     5.191637864,    0.2908989324, 1.779134004e-06,    0.5000000004,   0.05674429754]    fk: 307.56816726        
	k: 300      xk: [    4.539116508,     5.191638873,    0.2908988623, 1.779249192e-06,             0.5,   0.05674423742]    fk: 307.568167238       
	k: 400      xk: [    4.539116508,     5.191638873,    0.2908988623, 1.779259112e-06,             0.5,   0.05674423742]    fk: 307.568167238       

	Parameter values: [4.53911650803468, 5.19163887343037, 0.29089886231971429, 1.7792591122469757e-06, 0.50000000000026235, 0.056744237418828107]
	Function value:   307.56816723809442
	Iterations:       438
	Function calls:   928
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    4.539116508,     5.191638873,    0.2908988623, 1.779259112e-06,             0.5,   0.05674423742]    fk: 307.568167238       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.539116508,     5.191638873,    0.2908988623, 1.779259112e-06,             0.5,   0.05674423742]    fk: 307.568167238       
	k: 100      xk: [    4.539116508,     5.191638873,    0.2908988623, 1.779259112e-06,             0.5,   0.05674423742]    fk: 307.568167238       
	k: 200      xk: [    4.539116907,      5.19164289,    0.2908988272,  1.77485387e-06,             0.5,   0.05674403763]    fk: 307.568167195       
	k: 300      xk: [    4.539116516,      5.19164348,    0.2908987589, 2.581212996e-07,    0.5000000001,   0.05674400888]    fk: 307.568167175       
	k: 400      xk: [    4.539116151,     5.191643962,    0.2908986965,  3.25529522e-07,    0.5000000001,   0.05674398551]    fk: 307.568167173       

	Parameter values: [4.5391161826208153, 5.1916437282512504, 0.29089870622642949, 2.1341880054640343e-08, 0.50000000000002642, 0.056743997084177461]
	Function value:   307.56816716801274
	Iterations:       500
	Function calls:   849
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 7        xk: [    4.539116183,     5.191643728,    0.2908987062, 2.134188005e-08,             0.5,   0.05674399708]    fk: 307.568167168       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.539116183,     5.191643728,    0.2908987062, 2.134188005e-08,             0.5,   0.05674399708]    fk: 307.568167168       
	k: 100      xk: [    4.539116183,     5.191643728,    0.2908987062, 2.134188005e-08,             0.5,   0.05674399708]    fk: 307.568167168       
	k: 200      xk: [    4.539116183,     5.191643728,    0.2908987062, 2.134188005e-08,             0.5,   0.05674399708]    fk: 307.568167168       
	k: 300      xk: [    4.539116118,     5.191643719,    0.2908986973, 2.203507191e-08,             0.5,   0.05674399779]    fk: 307.568167168       

	Parameter values: [4.5391161184711928, 5.1916437189009805, 0.29089869732999496, 2.2035062910467607e-08, 0.50000000000041578, 0.056743997788768749]
	Function value:   307.56816716787671
	Iterations:       383
	Function calls:   950
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [    4.539116118,     5.191643719,    0.2908986973, 2.203506291e-08,             0.5,   0.05674399779]    fk: 307.568167168       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.539116118,     5.191643719,    0.2908986973, 2.313681606e-08,             0.5,   0.05674399779]    fk: 307.568167168       
	k: 100      xk: [    4.539116118,     5.191643719,    0.2908986973, 2.313681606e-08,             0.5,   0.05674399779]    fk: 307.568167168       
	k: 200      xk: [    4.539116118,     5.191643719,    0.2908986973, 2.313681606e-08,             0.5,   0.05674399779]    fk: 307.568167168       
	k: 300      xk: [    4.539116121,      5.19164373,    0.2908986975, 2.285985691e-08,             0.5,   0.05674399723]    fk: 307.568167168       

	Parameter values: [4.5391161214940059, 5.19164373004112, 0.29089869749907737, 2.285985688620983e-08, 0.50000000000005373, 0.056743997231271902]
	Function value:   307.56816716785727
	Iterations:       327
	Function calls:   728
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 9        xk: [    4.539116121,      5.19164373,    0.2908986975, 2.285985689e-08,             0.5,   0.05674399723]    fk: 307.568167168       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.539116121,      5.19164373,    0.2908986975, 2.285985689e-08,             0.5,   0.05674399723]    fk: 307.568167168       
	k: 100      xk: [    4.539116121,      5.19164373,    0.2908986975, 2.285985689e-08,             0.5,   0.05674399723]    fk: 307.568167168       
	k: 200      xk: [    4.539116121,      5.19164373,    0.2908986975, 2.285985689e-08,             0.5,   0.05674399723]    fk: 307.568167168       
	k: 300      xk: [    4.539116121,      5.19164373,    0.2908986975, 2.285985689e-08,             0.5,   0.05674399723]    fk: 307.568167168       

	Parameter values: [4.5391161214940059, 5.19164373004112, 0.29089869749907737, 2.285985688620983e-08, 0.50000000000005373, 0.056743997231271902]
	Function value:   307.56816716785727
	Iterations:       318
	Function calls:   705
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [4.5391161214940059, 5.19164373004112, 0.29089869749907737, 2.285985688620983e-08, 0.50000000000005373, 0.056743997231271902]
Function value:   307.56816716785727
Iterations:       4466
Function calls:   8321
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (600.000 MHz):           45.391161214940055
r2 (800.000 MHz):           51.916437300411204
dw:                          0.290898697499077
dwH:                         0.000000022859857
pA:                          0.500000000000054
kex:                       567.439972312718965


Fitting to the spin block [':135@F']
------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              4,               4,           0.625,           0.033,             0.8,         1.00009]    fk: 7954.91148671       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [            4.2,               4,           0.625,           0.033,             0.8,         1.00009]    fk: 7103.95548497       
	k: 100      xk: [    3.803954786,     5.271926534,    0.7219200332,   0.04245536213,    0.8676239848,   0.09707073698]    fk: 298.879719251       
	k: 200      xk: [    4.182004331,      5.64541124,    0.7210084137,    0.0367129846,    0.8771427482,   0.05284423673]    fk: 61.8775735084       
	k: 300      xk: [     4.20343376,     5.646128322,    0.7004082351,   0.01079861253,    0.8743320602,   0.05648675417]    fk: 59.339808252        
	k: 400      xk: [    4.207663607,     5.668035234,    0.6916535687, 0.0001413333201,    0.8714695618,   0.05529302605]    fk: 57.7618122341       

	Parameter values: [4.2074085208608967, 5.6699469838067014, 0.69158040490347106, 0.00010131614997540967, 0.87180094479043579, 0.055516563345465994]
	Function value:   57.737528389775491
	Iterations:       500
	Function calls:   777
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [    4.207408521,     5.669946984,    0.6915804049,   0.00010131615,    0.8718009448,   0.05551656335]    fk: 57.7199539342       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.207408521,     5.669946984,    0.6915804049, 0.0001063819575,    0.8718009448,   0.05551656335]    fk: 57.7215976519       
	k: 100      xk: [    4.240508085,     5.682024607,    0.6318384478, 0.0001888985368,     0.854936968,   0.06018158888]    fk: 54.8272587808       
	k: 200      xk: [    4.243424831,     5.684866333,    0.6304948756, 0.0002094787521,    0.8543721591,   0.06025288164]    fk: 54.801034751        
	k: 300      xk: [    4.243474849,     5.684892298,    0.6304953938, 0.0005099038383,    0.8543729746,   0.06024387092]    fk: 54.8009718338       
	k: 400      xk: [    4.243420143,     5.684854261,    0.6304941126, 0.0008545856338,    0.8543717308,   0.06025318638]    fk: 54.8009406269       

	Parameter values: [4.2434198436064685, 5.6848532273471584, 0.63049365219317144, 0.00085850130365475435, 0.85437159126222539, 0.060253341039952758]
	Function value:   54.800940623274677
	Iterations:       500
	Function calls:   854
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [    4.243419844,     5.684853227,    0.6304936522, 0.0008585013037,    0.8543715913,   0.06025334104]    fk: 54.8010011122       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.243419844,     5.684853227,    0.6304936522, 0.0008585013037,    0.8543715913,   0.06025334104]    fk: 54.8010005073       
	k: 100      xk: [    4.243376248,      5.68491376,     0.630554207, 0.0002347990675,    0.8543912168,   0.06024862443]    fk: 54.800963874        
	k: 200      xk: [    4.243425742,      5.68486555,    0.6304960854, 8.571527731e-05,    0.8543726117,     0.060253268]    fk: 54.8009533037       
	k: 300      xk: [    4.243425757,      5.68486564,    0.6304961252, 8.572986462e-05,    0.8543726268,   0.06025326174]    fk: 54.8009533037       

	Parameter values: [4.2434257571102822, 5.6848656396240607, 0.63049612521024301, 8.5729864622858816e-05, 0.85437262684638071, 0.060253261742429051]
	Function value:   54.800953303718231
	Iterations:       344
	Function calls:   740
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    4.243425757,      5.68486564,    0.6304961252, 8.572986462e-05,    0.8543726268,   0.06025326174]    fk: 54.8009516046       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.243425757,      5.68486564,    0.6304961252, 8.572986462e-05,    0.8543726268,   0.06025326174]    fk: 54.8009516216       
	k: 100      xk: [    4.243425757,      5.68486564,    0.6304961252, 8.572986462e-05,    0.8543726268,   0.06025326174]    fk: 54.8009516216       
	k: 200      xk: [    4.243425708,     5.684865183,    0.6304961812, 8.608996557e-06,    0.8543726301,   0.06025327721]    fk: 54.8009511511       
	k: 300      xk: [     4.24342581,     5.684865696,    0.6304961576, 8.515968394e-06,    0.8543726373,   0.06025326407]    fk: 54.800951151        

	Parameter values: [4.2434258097610034, 5.6848656959637962, 0.63049615760746658, 8.5159683750167073e-06, 0.85437263733703783, 0.0602532640710184]
	Function value:   54.800951150951839
	Iterations:       391
	Function calls:   845
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [     4.24342581,     5.684865696,    0.6304961576, 8.515968375e-06,    0.8543726373,   0.06025326407]    fk: 54.8009511109       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     4.24342581,     5.684865696,    0.6304961576, 8.515968375e-06,    0.8543726373,   0.06025326407]    fk: 54.8009511113       
	k: 100      xk: [     4.24342581,     5.684865696,    0.6304961576, 8.515968375e-06,    0.8543726373,   0.06025326407]    fk: 54.8009511113       
	k: 200      xk: [    4.243425802,     5.684865669,     0.630496223, 9.120986508e-07,    0.8543726629,   0.06025325258]    fk: 54.8009511067       
	k: 300      xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583114e-07,    0.8543726657,   0.06025325376]    fk: 54.8009511066       

	Parameter values: [4.2434257769158208, 5.6848657024394189, 0.63049623130035526, 8.2145831150367053e-07, 0.85437266565139391, 0.060253253757289682]
	Function value:   54.80095110662959
	Iterations:       342
	Function calls:   742
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
	k: 100      xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
	k: 200      xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        

	Parameter values: [4.2434257769158208, 5.6848657024394189, 0.63049623130035526, 8.2145831150367053e-07, 0.85437266565139391, 0.060253253757289682]
	Function value:   54.800951106001236
	Iterations:       273
	Function calls:   634
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
	k: 100      xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
	k: 200      xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        

	Parameter values: [4.2434257769158208, 5.6848657024394189, 0.63049623130035526, 8.2145831150367053e-07, 0.85437266565139391, 0.060253253757289682]
	Function value:   54.800951105994969
	Iterations:       273
	Function calls:   634
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
	k: 100      xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
	k: 200      xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        

	Parameter values: [4.2434257769158208, 5.6848657024394189, 0.63049623130035526, 8.2145831150367053e-07, 0.85437266565139391, 0.060253253757289682]
	Function value:   54.800951105994898
	Iterations:       273
	Function calls:   634
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
	k: 100      xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        
	k: 200      xk: [    4.243425777,     5.684865702,    0.6304962313, 8.214583115e-07,    0.8543726657,   0.06025325376]    fk: 54.800951106        

	Parameter values: [4.2434257769158208, 5.6848657024394189, 0.63049623130035526, 8.2145831150367053e-07, 0.85437266565139391, 0.060253253757289682]
	Function value:   54.800951105994898
	Iterations:       273
	Function calls:   634
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [4.2434257769158208, 5.6848657024394189, 0.63049623130035526, 8.2145831150367053e-07, 0.85437266565139391, 0.060253253757289682]
Function value:   54.800951105994898
Iterations:       3169
Function calls:   6494
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (600.000 MHz):           42.434257769158208
r2 (800.000 MHz):           56.848657024394186
dw:                          0.630496231300355
dwH:                         0.000000821458312
pA:                          0.854372665651394
kex:                       602.532537572896786


Fitting to the spin block [':137@S']
------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [           2.83,            2.44,           0.981,            0.01,             0.5,         1.00009]    fk: 2983.55592441       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [           2.83,            2.44,           0.981,            0.01,           0.525,         1.00009]    fk: 2940.3607188        
	k: 100      xk: [    2.620091044,     2.466196143,    0.6887468158,   0.01301893431,    0.5857162436,     0.396645324]    fk: 1840.52446838       
	k: 200      xk: [    3.116509857,     3.784295173,    0.4049575527,   0.01635280771,    0.7670626166,     0.065515964]    fk: 365.530843031       
	k: 300      xk: [    3.000469574,     3.723753175,    0.4374611561,   0.02327045271,    0.8054293753,   0.05864542904]    fk: 344.074340789       
	k: 400      xk: [    2.849183894,     3.602883373,    0.6523424031,   0.05920327242,    0.8833088147,   0.03789304411]    fk: 156.636500866       

	Parameter values: [2.9026806936057232, 3.6137548235180956, 0.75995909690908858, 0.071977628827800011, 0.84976881234957569, 0.021080497916950144]
	Function value:   93.887339989237162
	Iterations:       500
	Function calls:   770
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [    2.902680694,     3.613754824,    0.7599590969,   0.07197762883,    0.8497688123,   0.02108049792]    fk: 94.9076601098       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.902680694,     3.613754824,    0.7599590969,   0.07557651027,    0.8497688123,   0.02108049792]    fk: 93.1437040439       
	k: 100      xk: [    2.861278186,     3.512630241,    0.7511091138,   0.09225031521,    0.8393824859,   0.01978369863]    fk: 82.9355479106       
	k: 200      xk: [    2.863866847,     3.515069952,    0.7497907381,   0.09164991493,    0.8378260293,   0.01969796341]    fk: 82.6705203051       
	k: 300      xk: [    2.872183579,     3.524889595,    0.7461064709,   0.09102020981,    0.8369779601,   0.01959456582]    fk: 82.6000779641       
	k: 400      xk: [    2.873043422,     3.524643695,    0.7453645013,   0.09093642574,    0.8366409245,   0.01957368284]    fk: 82.5673236244       

	Parameter values: [2.8730801886716302, 3.5246235118785432, 0.74532297825261218, 0.09093478762569715, 0.83663789306897407, 0.019573511302042559]
	Function value:   82.567279910362899
	Iterations:       500
	Function calls:   798
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 2        xk: [    2.873080189,     3.524623512,    0.7453229783,   0.09093478763,    0.8366378931,    0.0195735113]    fk: 82.5676529338       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873080189,     3.524623512,    0.7453229783,   0.09093478763,    0.8366378931,    0.0195735113]    fk: 82.5676492036       
	k: 100      xk: [    2.872790797,     3.523816743,    0.7463710685,   0.09091877515,      0.83677659,   0.01955762365]    fk: 82.5628644454       
	k: 200      xk: [    2.872398484,     3.523790485,    0.7466364649,   0.09092062076,    0.8367773977,   0.01955724247]    fk: 82.5619727158       
	k: 300      xk: [    2.872405491,     3.523804454,    0.7465958011,   0.09092076978,    0.8367736816,   0.01955761455]    fk: 82.5619475744       
	k: 400      xk: [    2.872392818,     3.523794447,    0.7466083148,   0.09091910358,    0.8367793658,   0.01955677233]    fk: 82.5619076652       

	Parameter values: [2.8724752601052597, 3.5243903518855593, 0.74670291211082285, 0.090909415296277107, 0.83680432888042677, 0.019552272647062663]
	Function value:   82.561091540943806
	Iterations:       500
	Function calls:   802
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [     2.87247526,     3.524390352,    0.7467029121,    0.0909094153,    0.8368043289,   0.01955227265]    fk: 82.5610978587       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.87247526,     3.524390352,    0.7467029121,    0.0909094153,    0.8368043289,   0.01955227265]    fk: 82.5610952336       
	k: 100      xk: [     2.87247526,     3.524390352,    0.7467029121,    0.0909094153,    0.8368043289,   0.01955227265]    fk: 82.5610952336       
	k: 200      xk: [    2.872616738,     3.524299771,    0.7465573966,   0.09090594253,     0.836783971,   0.01955288368]    fk: 82.5608894061       
	k: 300      xk: [     2.87261705,     3.524298954,    0.7465585161,   0.09090600239,      0.83678398,   0.01955289664]    fk: 82.5608891441       
	k: 400      xk: [    2.872617048,     3.524298905,    0.7465584863,   0.09090600332,    0.8367839709,   0.01955289753]    fk: 82.5608891439       

	Parameter values: [2.8726170477815938, 3.5242989047650042, 0.74655848628190391, 0.090906003316851197, 0.83678397087409795, 0.019552897528950536]
	Function value:   82.560889143923731
	Iterations:       444
	Function calls:   863
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 4        xk: [    2.872617048,     3.524298905,    0.7465584863,   0.09090600332,    0.8367839709,   0.01955289753]    fk: 82.5608891813       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.872617048,     3.524298905,    0.7465584863,   0.09090600332,    0.8367839709,   0.01955289753]    fk: 82.5608891808       
	k: 100      xk: [    2.872617048,     3.524298905,    0.7465584863,   0.09090600332,    0.8367839709,   0.01955289753]    fk: 82.5608891808       
	k: 200      xk: [    2.872583201,     3.524416504,    0.7465935688,   0.09090505405,    0.8367822044,   0.01955262633]    fk: 82.5607595552       
	k: 300      xk: [    2.872583387,     3.524410439,    0.7465119008,   0.09090331405,    0.8367601751,    0.0195536334]    fk: 82.5606658993       
	k: 400      xk: [    2.872954158,     3.524931287,    0.7462681791,   0.09088601634,    0.8367299944,   0.01955118108]    fk: 82.5602903049       

	Parameter values: [2.8729153762594883, 3.5248688717837089, 0.74629418067376596, 0.090887973229135499, 0.83673216982232379, 0.019551519380042237]
	Function value:   82.560270362562633
	Iterations:       500
	Function calls:   803
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 5        xk: [    2.872915376,     3.524868872,    0.7462941807,   0.09088797323,    0.8367321698,   0.01955151938]    fk: 82.5602706067       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.872915376,     3.524868872,    0.7462941807,   0.09088797323,    0.8367321698,   0.01955151938]    fk: 82.5602703629       
	k: 100      xk: [    2.872915376,     3.524868872,    0.7462941807,   0.09088797323,    0.8367321698,   0.01955151938]    fk: 82.5602703629       
	k: 200      xk: [    2.872984576,     3.524934784,    0.7463371338,   0.09088423691,    0.8367473458,   0.01954943913]    fk: 82.5601443027       
	k: 300      xk: [    2.873000151,     3.524942303,    0.7463356477,   0.09088347222,    0.8367487174,    0.0195491455]    fk: 82.5601412981       
	k: 400      xk: [    2.873000296,     3.524941934,    0.7463358324,   0.09088348041,    0.8367487349,   0.01954914626]    fk: 82.5601412968       

	Parameter values: [2.8730002960292582, 3.5249419341203883, 0.74633583243626878, 0.090883480414749029, 0.83674873494900393, 0.019549146259520655]
	Function value:   82.560141296781694
	Iterations:       472
	Function calls:   920
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [    2.873000296,     3.524941934,    0.7463358324,   0.09088348041,    0.8367487349,   0.01954914626]    fk: 82.5601412968       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873000296,     3.524941934,    0.7463358324,   0.09088348041,    0.8367487349,   0.01954914626]    fk: 82.5601412968       
	k: 100      xk: [    2.873000296,     3.524941934,    0.7463358324,   0.09088348041,    0.8367487349,   0.01954914626]    fk: 82.5601412968       
	k: 200      xk: [    2.873032251,     3.524881575,    0.7462979139,   0.09088333454,    0.8367391531,   0.01954977363]    fk: 82.5601118682       
	k: 300      xk: [    2.873035466,     3.524881484,    0.7462919382,   0.09088317147,    0.8367382332,   0.01954979849]    fk: 82.56011172         
	k: 400      xk: [     2.87303559,      3.52488178,    0.7462919486,   0.09088316511,    0.8367382436,   0.01954979604]    fk: 82.5601117196       

	Parameter values: [2.873035590128413, 3.5248817799686938, 0.74629194858876891, 0.090883165112806516, 0.83673824357554039, 0.019549796037232392]
	Function value:   82.560111719606383
	Iterations:       448
	Function calls:   884
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [     2.87303559,      3.52488178,    0.7462919486,   0.09088316511,    0.8367382436,   0.01954979604]    fk: 82.5601117196       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.87303559,      3.52488178,    0.7462919486,   0.09088316511,    0.8367382436,   0.01954979604]    fk: 82.5601117196       
	k: 100      xk: [     2.87303559,      3.52488178,    0.7462919486,   0.09088316511,    0.8367382436,   0.01954979604]    fk: 82.5601117196       
	k: 200      xk: [    2.872989457,     3.524820973,    0.7463139027,   0.09088510164,    0.8367389588,   0.01955024172]    fk: 82.5601022561       
	k: 300      xk: [    2.872980715,     3.524813993,    0.7463200903,    0.0908854388,    0.8367396429,   0.01955027971]    fk: 82.5601020039       
	k: 400      xk: [     2.87298123,     3.524817182,    0.7463222792,   0.09088542711,    0.8367400931,   0.01955024358]    fk: 82.5601019455       

	Parameter values: [2.8729811645605432, 3.5248171103945918, 0.7463222160782681, 0.090885427732521479, 0.83674008402573963, 0.019550244477811732]
	Function value:   82.56010194533691
	Iterations:       500
	Function calls:   954
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 8        xk: [    2.872981165,      3.52481711,    0.7463222161,   0.09088542773,     0.836740084,   0.01955024448]    fk: 82.5601019454       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.872981165,      3.52481711,    0.7463222161,   0.09088542773,     0.836740084,   0.01955024448]    fk: 82.5601019453       
	k: 100      xk: [    2.872981165,      3.52481711,    0.7463222161,   0.09088542773,     0.836740084,   0.01955024448]    fk: 82.5601019453       
	k: 200      xk: [    2.872980367,      3.52481019,    0.7463370274,   0.09088579977,    0.8367409322,   0.01955025541]    fk: 82.5600992221       
	k: 300      xk: [    2.873007504,     3.524844039,    0.7463312195,    0.0908847835,    0.8367407309,   0.01954999312]    fk: 82.5600963515       
	k: 400      xk: [    2.873039504,     3.525084009,    0.7462390523,    0.0908757739,     0.836711454,   0.01954937142]    fk: 82.559898211        

	Parameter values: [2.8730521894770291, 3.5251048923191348, 0.74622714387429268, 0.090874923085326575, 0.83670939141108969, 0.019549282693793912]
	Function value:   82.559897266154891
	Iterations:       500
	Function calls:   818
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 9        xk: [    2.873052189,     3.525104892,    0.7462271439,   0.09087492309,    0.8367093914,   0.01954928269]    fk: 82.5598972662       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873052189,     3.525104892,    0.7462271439,   0.09087492309,    0.8367093914,   0.01954928269]    fk: 82.5598972662       
	k: 100      xk: [    2.873052189,     3.525104892,    0.7462271439,   0.09087492309,    0.8367093914,   0.01954928269]    fk: 82.5598972662       
	k: 200      xk: [    2.873013316,     3.525233067,     0.746695055,   0.09086178006,    0.8367650928,   0.01954081075]    fk: 82.5590698507       
	k: 300      xk: [    2.872967153,     3.525235145,    0.7467365404,   0.09086137296,     0.836767872,   0.01954040019]    fk: 82.5590574961       
	k: 400      xk: [    2.872966643,     3.525234833,    0.7467383633,   0.09086135557,    0.8367679822,   0.01954038299]    fk: 82.5590574605       

	Parameter values: [2.8729666432358956, 3.5252348337093258, 0.74673836259540871, 0.090861355553082709, 0.83676798226771809, 0.019540382986475917]
	Function value:   82.559057460451143
	Iterations:       487
	Function calls:   931
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 10       xk: [    2.872966643,     3.525234834,    0.7467383626,   0.09086135555,    0.8367679823,   0.01954038299]    fk: 82.5590574605       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.872966643,     3.525234834,    0.7467383626,   0.09086135555,    0.8367679823,   0.01954038299]    fk: 82.5590574605       
	k: 100      xk: [    2.872966643,     3.525234834,    0.7467383626,   0.09086135555,    0.8367679823,   0.01954038299]    fk: 82.5590574605       
	k: 200      xk: [    2.872899847,     3.525146978,     0.746765292,   0.09086356268,    0.8367653805,   0.01954107928]    fk: 82.5590296343       
	k: 300      xk: [    2.872862855,     3.525125099,    0.7467717071,   0.09086393273,    0.8367671625,   0.01954106705]    fk: 82.559018973        
	k: 400      xk: [    2.872873728,     3.525012921,     0.746779945,   0.09086558693,    0.8367707024,   0.01954132982]    fk: 82.5589845024       

	Parameter values: [2.8728583191082837, 3.5249918811248966, 0.74680959700149407, 0.090865612842401494, 0.83677274782376099, 0.019541106479844694]
	Function value:   82.558959995848966
	Iterations:       500
	Function calls:   804
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 11       xk: [    2.872858319,     3.524991881,     0.746809597,   0.09086561284,    0.8367727478,   0.01954110648]    fk: 82.5589604956       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.872858319,     3.524991881,     0.746809597,   0.09086561284,    0.8367727478,   0.01954110648]    fk: 82.5589599958       
	k: 100      xk: [    2.872858319,     3.524991881,     0.746809597,   0.09086561284,    0.8367727478,   0.01954110648]    fk: 82.5589599958       
	k: 200      xk: [    2.873002179,     3.524755416,    0.7465516603,   0.09086105281,    0.8367303122,   0.01954304912]    fk: 82.5584896805       
	k: 300      xk: [    2.872986862,      3.52480365,    0.7465604389,   0.09086040829,    0.8367354185,   0.01954254338]    fk: 82.5584719843       
	k: 400      xk: [    2.872986866,     3.524803239,    0.7465602895,   0.09086041547,    0.8367353595,    0.0195425493]    fk: 82.5584719811       

	Parameter values: [2.8729869050186734, 3.5248031665246282, 0.7465602601514052, 0.090860415444193821, 0.83673535141660338, 0.019542549845110259]
	Function value:   82.558471980955474
	Iterations:       500
	Function calls:   940
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 12       xk: [    2.872986905,     3.524803167,    0.7465602602,   0.09086041544,    0.8367353514,   0.01954254985]    fk: 82.558471981        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.872986905,     3.524803167,    0.7465602602,   0.09086041544,    0.8367353514,   0.01954254985]    fk: 82.558471981        
	k: 100      xk: [    2.872986905,     3.524803167,    0.7465602602,   0.09086041544,    0.8367353514,   0.01954254985]    fk: 82.558471981        
	k: 200      xk: [    2.872964798,     3.524864121,    0.7466015534,   0.09086049941,    0.8367412099,   0.01954211203]    fk: 82.5584553491       
	k: 300      xk: [    2.872923397,     3.524867337,    0.7465592684,   0.09085981104,    0.8367224343,   0.01954311647]    fk: 82.5583588346       
	k: 400      xk: [    2.872927462,     3.524863431,    0.7465603557,   0.09085985929,    0.8367225718,    0.0195431189]    fk: 82.5583584953       

	Parameter values: [2.8729274794204729, 3.524863461601587, 0.7465604145200132, 0.090859859897162262, 0.83672258298892688, 0.019543118243479402]
	Function value:   82.558358495015142
	Iterations:       500
	Function calls:   926
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 13       xk: [    2.872927479,     3.524863462,    0.7465604145,    0.0908598599,     0.836722583,   0.01954311824]    fk: 82.558358495        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.872927479,     3.524863462,    0.7465604145,    0.0908598599,     0.836722583,   0.01954311824]    fk: 82.558358495        
	k: 100      xk: [    2.872927479,     3.524863462,    0.7465604145,    0.0908598599,     0.836722583,   0.01954311824]    fk: 82.558358495        
	k: 200      xk: [    2.872981838,     3.524991767,    0.7465555347,   0.09085422417,    0.8367328803,   0.01954092516]    fk: 82.5582195589       
	k: 300      xk: [    2.873018987,     3.524959307,    0.7465527233,   0.09085387956,    0.8367334765,   0.01954080099]    fk: 82.5582068918       
	k: 400      xk: [    2.873018786,     3.524958872,     0.746553239,   0.09085390537,    0.8367335139,   0.01954080461]    fk: 82.5582068874       

	Parameter values: [2.8730187859976759, 3.5249588724208794, 0.74655323900470594, 0.090853905373168245, 0.83673351389977668, 0.019540804613746215]
	Function value:   82.558206887349073
	Iterations:       470
	Function calls:   921
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 14       xk: [    2.873018786,     3.524958872,     0.746553239,   0.09085390537,    0.8367335139,   0.01954080461]    fk: 82.5582068874       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873018786,     3.524958872,     0.746553239,   0.09085390537,    0.8367335139,   0.01954080461]    fk: 82.5582068873       
	k: 100      xk: [    2.873018786,     3.524958872,     0.746553239,   0.09085390537,    0.8367335139,   0.01954080461]    fk: 82.5582068873       
	k: 200      xk: [    2.873049668,     3.524901111,    0.7465166649,   0.09085404503,    0.8367246438,   0.01954146908]    fk: 82.5581835079       
	k: 300      xk: [    2.873056773,     3.524907731,    0.7465250419,   0.09085406973,    0.8367261947,   0.01954136061]    fk: 82.5581820987       
	k: 400      xk: [    2.873058164,     3.524908274,    0.7465260379,   0.09085407376,    0.8367263636,   0.01954134892]    fk: 82.5581820666       

	Parameter values: [2.8730581629011036, 3.5249082727343319, 0.74652603620410651, 0.09085407377066404, 0.83672636320271976, 0.019541348945443533]
	Function value:   82.558182066591641
	Iterations:       482
	Function calls:   944
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 15       xk: [    2.873058163,     3.524908273,    0.7465260362,   0.09085407377,    0.8367263632,   0.01954134895]    fk: 82.5581820666       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873058163,     3.524908273,    0.7465260362,   0.09085407377,    0.8367263632,   0.01954134895]    fk: 82.5581820666       
	k: 100      xk: [    2.873058163,     3.524908273,    0.7465260362,   0.09085407377,    0.8367263632,   0.01954134895]    fk: 82.5581820666       
	k: 200      xk: [    2.873211379,     3.525006835,    0.7464436099,   0.09084901975,    0.8367169541,   0.01954069833]    fk: 82.5581282002       
	k: 300      xk: [    2.873209105,     3.525001858,    0.7464409252,   0.09084906735,    0.8367163259,   0.01954075626]    fk: 82.5581276683       
	k: 400      xk: [    2.873209615,     3.525002055,    0.7464406386,   0.09084905234,     0.836716284,   0.01954075526]    fk: 82.5581276668       

	Parameter values: [2.8732096154277409, 3.525002055469157, 0.7464406385756126, 0.090849052340659556, 0.83671628401217202, 0.019540755256235415]
	Function value:   82.558127666768314
	Iterations:       478
	Function calls:   930
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 16       xk: [    2.873209615,     3.525002055,    0.7464406386,   0.09084905234,     0.836716284,   0.01954075526]    fk: 82.5581276668       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873209615,     3.525002055,    0.7464406386,   0.09084905234,     0.836716284,   0.01954075526]    fk: 82.5581276668       
	k: 100      xk: [    2.873209615,     3.525002055,    0.7464406386,   0.09084905234,     0.836716284,   0.01954075526]    fk: 82.5581276668       
	k: 200      xk: [     2.87324668,     3.525024144,    0.7464505964,   0.09084843086,    0.8367168218,   0.01954051368]    fk: 82.558118703        
	k: 300      xk: [    2.873255696,     3.525050087,    0.7464435901,   0.09084776905,    0.8367172208,   0.01954032312]    fk: 82.5581162421       
	k: 400      xk: [    2.873364992,     3.525490827,    0.7462804294,   0.09083122311,    0.8366668471,    0.0195390036]    fk: 82.5576654649       

	Parameter values: [2.8733378913626595, 3.525454032388657, 0.74631125472657311, 0.090832830968571587, 0.8366702098906873, 0.019539168862978212]
	Function value:   82.55765776281018
	Iterations:       500
	Function calls:   799
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 17       xk: [    2.873337891,     3.525454032,    0.7463112547,   0.09083283097,    0.8366702099,   0.01953916886]    fk: 82.5576581367       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873337891,     3.525454032,    0.7463112547,   0.09083283097,    0.8366702099,   0.01953916886]    fk: 82.5576577628       
	k: 100      xk: [    2.873337891,     3.525454032,    0.7463112547,   0.09083283097,    0.8366702099,   0.01953916886]    fk: 82.5576577628       
	k: 200      xk: [    2.873227776,     3.525532556,    0.7468132452,   0.09082060002,    0.8367283368,    0.0195306814]    fk: 82.5567620476       
	k: 300      xk: [    2.873219254,      3.52553005,    0.7468411278,   0.09082014616,    0.8367310505,   0.01953030582]    fk: 82.5567598173       
	k: 400      xk: [    2.873221025,     3.525425927,    0.7468182001,   0.09082254975,    0.8367297519,   0.01953114604]    fk: 82.5567260504       

	Parameter values: [2.8731687200632567, 3.5253649148579385, 0.74685359066555801, 0.090823380604205917, 0.8367332550343165, 0.019531070871572062]
	Function value:   82.556713625260258
	Iterations:       500
	Function calls:   791
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 18       xk: [     2.87316872,     3.525364915,    0.7468535907,    0.0908233806,     0.836733255,   0.01953107087]    fk: 82.556713701        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [     2.87316872,     3.525364915,    0.7468535907,    0.0908233806,     0.836733255,   0.01953107087]    fk: 82.5567136253       
	k: 100      xk: [     2.87316872,     3.525364915,    0.7468535907,    0.0908233806,     0.836733255,   0.01953107087]    fk: 82.5567136253       
	k: 200      xk: [    2.873289488,     3.525208405,    0.7466238912,    0.0908192969,    0.8366981484,   0.01953264033]    fk: 82.5563111251       
	k: 300      xk: [     2.87327569,     3.525193699,    0.7466096706,   0.09081948903,    0.8366948112,   0.01953293176]    fk: 82.5563076247       
	k: 400      xk: [    2.873276359,     3.525193831,    0.7466090516,   0.09081946043,      0.83669478,    0.0195329273]    fk: 82.5563076137       

	Parameter values: [2.8732763586414727, 3.5251938310987798, 0.7466090516015389, 0.090819460434919508, 0.83669478003453812, 0.019532927304831083]
	Function value:   82.55630761373078
	Iterations:       466
	Function calls:   886
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 19       xk: [    2.873276359,     3.525193831,    0.7466090516,   0.09081946043,      0.83669478,    0.0195329273]    fk: 82.5563076138       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873276359,     3.525193831,    0.7466090516,   0.09081946043,      0.83669478,    0.0195329273]    fk: 82.5563076137       
	k: 100      xk: [    2.873276359,     3.525193831,    0.7466090516,   0.09081946043,      0.83669478,    0.0195329273]    fk: 82.5563076137       
	k: 200      xk: [    2.873246799,     3.525237444,    0.7466266152,   0.09081935089,    0.8366931975,   0.01953293542]    fk: 82.5562555664       
	k: 300      xk: [    2.873221857,     3.525243168,    0.7466107935,   0.09081908526,    0.8366834679,   0.01953345913]    fk: 82.5562167427       
	k: 400      xk: [    2.873222133,     3.525242968,    0.7466108773,   0.09081908807,    0.8366835166,   0.01953345688]    fk: 82.5562167339       

	Parameter values: [2.87322213326987, 3.5252429684328459, 0.74661087725285391, 0.090819088074083482, 0.83668351664147766, 0.019533456878211421]
	Function value:   82.556216733838014
	Iterations:       478
	Function calls:   943
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 20       xk: [    2.873222133,     3.525242968,    0.7466108773,   0.09081908807,    0.8366835166,   0.01953345688]    fk: 82.5562167338       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873222133,     3.525242968,    0.7466108773,   0.09081908807,    0.8366835166,   0.01953345688]    fk: 82.5562167338       
	k: 100      xk: [    2.873222133,     3.525242968,    0.7466108773,   0.09081908807,    0.8366835166,   0.01953345688]    fk: 82.5562167338       
	k: 200      xk: [    2.873307582,     3.525316421,    0.7466111421,   0.09081391828,    0.8366946843,   0.01953133255]    fk: 82.5560879462       
	k: 300      xk: [    2.873301001,     3.525326204,    0.7466114636,    0.0908138608,    0.8366947678,   0.01953130993]    fk: 82.5560869106       
	k: 400      xk: [    2.873300888,     3.525326286,      0.74661146,   0.09081386227,    0.8366947629,   0.01953131064]    fk: 82.5560869103       

	Parameter values: [2.8733008877106281, 3.5253262857477101, 0.74661145996292611, 0.090813862267398529, 0.83669476286100064, 0.019531310638813113]
	Function value:   82.556086910274772
	Iterations:       446
	Function calls:   856
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 21       xk: [    2.873300888,     3.525326286,      0.74661146,   0.09081386227,    0.8366947629,   0.01953131064]    fk: 82.5560869103       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873300888,     3.525326286,      0.74661146,   0.09081386227,    0.8366947629,   0.01953131064]    fk: 82.5560869103       
	k: 100      xk: [    2.873300888,     3.525326286,      0.74661146,   0.09081386227,    0.8366947629,   0.01953131064]    fk: 82.5560869103       
	k: 200      xk: [    2.873345401,      3.52528008,    0.7465834297,   0.09081330544,    0.8366893114,   0.01953155209]    fk: 82.5560673215       
	k: 300      xk: [    2.873338456,     3.525278213,    0.7465847756,   0.09081381425,    0.8366883128,   0.01953175093]    fk: 82.5560648286       
	k: 400      xk: [    2.873339514,     3.525275592,    0.7465841432,   0.09081386735,    0.8366879718,    0.0195317877]    fk: 82.5560645964       

	Parameter values: [2.8732895586268734, 3.5251974958153678, 0.74664740870022417, 0.090814626093021253, 0.83669356516757842, 0.019531484716312539]
	Function value:   82.556047597929449
	Iterations:       500
	Function calls:   819
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 22       xk: [    2.873289559,     3.525197496,    0.7466474087,   0.09081462609,    0.8366935652,   0.01953148472]    fk: 82.5560476089       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873289559,     3.525197496,    0.7466474087,   0.09081462609,    0.8366935652,   0.01953148472]    fk: 82.5560475979       
	k: 100      xk: [    2.873289559,     3.525197496,    0.7466474087,   0.09081462609,    0.8366935652,   0.01953148472]    fk: 82.5560475979       
	k: 200      xk: [    2.873227898,     3.525238594,    0.7466634292,   0.09081475846,    0.8366840665,   0.01953201087]    fk: 82.5559521361       
	k: 300      xk: [    2.873231161,     3.525232388,    0.7466597357,   0.09081474942,    0.8366834298,   0.01953205629]    fk: 82.5559515989       
	k: 400      xk: [    2.873245468,     3.525356283,    0.7465557603,    0.0908103602,    0.8366694123,   0.01953193345]    fk: 82.5558805362       

	Parameter values: [2.8735375320196477, 3.5256584976710572, 0.74642320186027944, 0.090799726760264959, 0.83664966629562465, 0.019530444215518694]
	Function value:   82.555657593334146
	Iterations:       500
	Function calls:   806
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 23       xk: [    2.873537532,     3.525658498,    0.7464232019,   0.09079972676,    0.8366496663,   0.01953044422]    fk: 82.5556575933       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873537532,     3.525658498,    0.7464232019,   0.09079972676,    0.8366496663,   0.01953044422]    fk: 82.5556575933       
	k: 100      xk: [    2.873537532,     3.525658498,    0.7464232019,   0.09079972676,    0.8366496663,   0.01953044422]    fk: 82.5556575933       
	k: 200      xk: [    2.873613853,     3.525724898,    0.7464645113,   0.09079575851,    0.8366649312,   0.01952828089]    fk: 82.5555295824       
	k: 300      xk: [    2.873608861,     3.525729111,     0.746470749,   0.09079587936,    0.8366657203,    0.0195282505]    fk: 82.55552925         
	k: 400      xk: [    2.873608677,      3.52572899,     0.746470755,   0.09079588917,    0.8366657009,   0.01952825441]    fk: 82.5555292484       

	Parameter values: [2.8736086766626303, 3.5257289901375688, 0.74647075498543081, 0.090795889172268843, 0.83666570094741111, 0.019528254405333512]
	Function value:   82.555529248418054
	Iterations:       452
	Function calls:   890
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 24       xk: [    2.873608677,      3.52572899,     0.746470755,   0.09079588917,    0.8366657009,   0.01952825441]    fk: 82.5555292484       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873608677,      3.52572899,     0.746470755,   0.09079588917,    0.8366657009,   0.01952825441]    fk: 82.5555292484       
	k: 100      xk: [    2.873608677,      3.52572899,     0.746470755,   0.09079588917,    0.8366657009,   0.01952825441]    fk: 82.5555292484       
	k: 200      xk: [    2.873615544,     3.525636567,    0.7464359239,   0.09079665616,    0.8366560961,   0.01952913527]    fk: 82.5555011825       
	k: 300      xk: [    2.873618014,     3.525645389,    0.7464392017,    0.0907965449,    0.8366568475,   0.01952904978]    fk: 82.5555007903       
	k: 400      xk: [    2.873621405,     3.525647414,    0.7464384179,   0.09079645331,    0.8366566828,   0.01952903537]    fk: 82.5555007528       

	Parameter values: [2.8736214051286382, 3.5256474136998444, 0.74643841776072861, 0.090796453307928543, 0.83665668284028349, 0.019529035367274981]
	Function value:   82.555500752782223
	Iterations:       486
	Function calls:   935
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 25       xk: [    2.873621405,     3.525647414,    0.7464384178,   0.09079645331,    0.8366566828,   0.01952903537]    fk: 82.5555007528       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873621405,     3.525647414,    0.7464384178,   0.09079645331,    0.8366566828,   0.01952903537]    fk: 82.5555007528       
	k: 100      xk: [    2.873621405,     3.525647414,    0.7464384178,   0.09079645331,    0.8366566828,   0.01952903537]    fk: 82.5555007528       
	k: 200      xk: [    2.873571139,     3.525588503,    0.7464559262,   0.09079831877,    0.8366572039,   0.01952948558]    fk: 82.5554934223       
	k: 300      xk: [    2.873572313,     3.525588424,    0.7464664156,   0.09079851675,    0.8366583797,   0.01952944158]    fk: 82.5554924807       
	k: 400      xk: [    2.873571722,     3.525587944,     0.746466521,   0.09079853336,    0.8366583884,   0.01952944552]    fk: 82.5554924795       

	Parameter values: [2.873571722372545, 3.525587943691189, 0.74646652097154531, 0.090798533356231254, 0.83665838837513817, 0.019529445519917477]
	Function value:   82.555492479478232
	Iterations:       464
	Function calls:   910
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 26       xk: [    2.873571722,     3.525587944,     0.746466521,   0.09079853336,    0.8366583884,   0.01952944552]    fk: 82.5554924795       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873571722,     3.525587944,     0.746466521,   0.09079853336,    0.8366583884,   0.01952944552]    fk: 82.5554924795       
	k: 100      xk: [    2.873571722,     3.525587944,     0.746466521,   0.09079853336,    0.8366583884,   0.01952944552]    fk: 82.5554924795       
	k: 200      xk: [    2.873532669,     3.525633214,    0.7465140057,    0.0907988487,       0.8366661,   0.01952894307]    fk: 82.5554730742       
	k: 300      xk: [    2.873665428,      3.52584097,    0.7464421719,   0.09079136058,    0.8366534731,   0.01952775938]    fk: 82.5554164819       
	k: 400      xk: [    2.873710879,     3.525893429,    0.7464177993,   0.09078919938,    0.8366492146,   0.01952744212]    fk: 82.5553874676       

	Parameter values: [2.8737075891848081, 3.5258892511421407, 0.74641991995841162, 0.090789368685424449, 0.8366495785612138, 0.019527463195395861]
	Function value:   82.555387430600206
	Iterations:       500
	Function calls:   830
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 27       xk: [    2.873707589,     3.525889251,      0.74641992,   0.09078936869,    0.8366495786,    0.0195274632]    fk: 82.5553874306       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873707589,     3.525889251,      0.74641992,   0.09078936869,    0.8366495786,    0.0195274632]    fk: 82.5553874306       
	k: 100      xk: [    2.873707589,     3.525889251,      0.74641992,   0.09078936869,    0.8366495786,    0.0195274632]    fk: 82.5553874306       
	k: 200      xk: [    2.873718306,     3.525926614,    0.7464210354,   0.09078750049,    0.8366541203,   0.01952666339]    fk: 82.5553654415       
	k: 300      xk: [    2.873718382,     3.525919487,    0.7464237311,    0.0907877306,     0.836654289,   0.01952671133]    fk: 82.5553652037       
	k: 400      xk: [    2.873721108,     3.525913704,    0.7464274682,   0.09078776094,    0.8366552778,   0.01952665149]    fk: 82.5553644654       

	Parameter values: [2.8737233317774979, 3.5259112225566902, 0.74642488205727653, 0.090787715392798729, 0.83665502090231669, 0.019526661387779164]
	Function value:   82.555364381023082
	Iterations:       500
	Function calls:   852
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 28       xk: [    2.873723332,     3.525911223,    0.7464248821,   0.09078771539,    0.8366550209,   0.01952666139]    fk: 82.5553643811       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873723332,     3.525911223,    0.7464248821,   0.09078771539,    0.8366550209,   0.01952666139]    fk: 82.555364381        
	k: 100      xk: [    2.873539437,      3.52557084,    0.7466010794,   0.09079561053,    0.8366678611,   0.01952763801]    fk: 82.5551745349       
	k: 200      xk: [    2.873478613,     3.525548881,    0.7465737735,   0.09079533429,    0.8366652346,   0.01952778898]    fk: 82.5551202633       
	k: 300      xk: [    2.873500351,     3.525527559,     0.746561832,   0.09079501765,    0.8366635568,   0.01952783221]    fk: 82.5551159323       
	k: 400      xk: [    2.873501442,     3.525528522,     0.746561142,   0.09079498686,    0.8366634977,   0.01952782893]    fk: 82.5551158793       

	Parameter values: [2.8735014447077907, 3.5255285177732318, 0.74656114260538897, 0.090794986880831235, 0.83666349763898062, 0.019527828933286268]
	Function value:   82.555115879294618
	Iterations:       493
	Function calls:   969
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 29       xk: [    2.873501445,     3.525528518,    0.7465611426,   0.09079498688,    0.8366634976,   0.01952782893]    fk: 82.5551158793       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873501445,     3.525528518,    0.7465611426,   0.09079498688,    0.8366634976,   0.01952782893]    fk: 82.5551158793       
	k: 100      xk: [    2.873501445,     3.525528518,    0.7465611426,   0.09079498688,    0.8366634976,   0.01952782893]    fk: 82.5551158793       
	k: 200      xk: [    2.873610613,     3.525594908,    0.7464979196,   0.09079135253,    0.8366559186,   0.01952742032]    fk: 82.5550889564       
	k: 300      xk: [    2.873606476,     3.525586239,    0.7464986112,   0.09079155175,    0.8366555564,   0.01952749603]    fk: 82.5550888046       
	k: 400      xk: [    2.873607275,     3.525587247,    0.7464980942,   0.09079151567,    0.8366555291,   0.01952748888]    fk: 82.5550888006       

	Parameter values: [2.873607275095257, 3.5255872471154106, 0.74649809422137681, 0.090791515673286138, 0.83665552912508367, 0.019527488880214938]
	Function value:   82.5550888005384
	Iterations:       478
	Function calls:   920
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 30       xk: [    2.873607275,     3.525587247,    0.7464980942,   0.09079151567,    0.8366555291,   0.01952748888]    fk: 82.5550888006       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873607275,     3.525587247,    0.7464980942,   0.09079151567,    0.8366555291,   0.01952748888]    fk: 82.5550888005       
	k: 100      xk: [    2.873607275,     3.525587247,    0.7464980942,   0.09079151567,    0.8366555291,   0.01952748888]    fk: 82.5550888005       
	k: 200      xk: [    2.873625467,     3.525594931,    0.7465038698,   0.09079122495,    0.8366551146,   0.01952741089]    fk: 82.5550778612       
	k: 300      xk: [    2.873690777,     3.525659895,    0.7464818716,   0.09078884233,    0.8366521852,   0.01952696331]    fk: 82.5550659288       
	k: 400      xk: [    2.873675408,     3.525636922,    0.7464875949,   0.09078950349,    0.8366520882,   0.01952714058]    fk: 82.5550639455       

	Parameter values: [2.8737163227678177, 3.5259514753141961, 0.74639866674724953, 0.090778528389254876, 0.83661984265128186, 0.019526135388494612]
	Function value:   82.554815056769854
	Iterations:       500
	Function calls:   813
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 31       xk: [    2.873716323,     3.525951475,    0.7463986667,   0.09077852839,    0.8366198427,   0.01952613539]    fk: 82.554817899        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873716323,     3.525951475,    0.7463986667,   0.09077852839,    0.8366198427,   0.01952613539]    fk: 82.5548150568       
	k: 100      xk: [    2.873716323,     3.525951475,    0.7463986667,   0.09077852839,    0.8366198427,   0.01952613539]    fk: 82.5548150568       
	k: 200      xk: [    2.873544553,      3.52594707,    0.7469565914,   0.09076734134,    0.8366799605,   0.01951766906]    fk: 82.5539118808       
	k: 300      xk: [    2.873542163,     3.525955968,    0.7469457072,   0.09076731573,    0.8366795237,   0.01951771782]    fk: 82.5539048493       
	k: 400      xk: [    2.873542513,     3.525956762,    0.7469461547,   0.09076728044,    0.8366796316,   0.01951770008]    fk: 82.5539048443       

	Parameter values: [2.873542512517377, 3.5259567616076897, 0.74694615467355252, 0.090767280441436046, 0.83667963155937519, 0.019517700078209983]
	Function value:   82.553904844301655
	Iterations:       489
	Function calls:   948
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 32       xk: [    2.873542513,     3.525956762,    0.7469461547,   0.09076728044,    0.8366796316,   0.01951770008]    fk: 82.5539048443       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873542513,     3.525956762,    0.7469461547,   0.09076728044,    0.8366796316,   0.01951770008]    fk: 82.5539048443       
	k: 100      xk: [    2.873542513,     3.525956762,    0.7469461547,   0.09076728044,    0.8366796316,   0.01951770008]    fk: 82.5539048443       
	k: 200      xk: [    2.873539073,     3.525956149,    0.7469357626,   0.09076751122,    0.8366786748,   0.01951785456]    fk: 82.5539043055       
	k: 300      xk: [    2.873541115,     3.525958268,     0.746935057,   0.09076745228,    0.8366787694,   0.01951783451]    fk: 82.553904275        
	k: 400      xk: [    2.873547513,     3.525957218,     0.746927977,   0.09076760373,    0.8366778636,   0.01951795257]    fk: 82.5539039278       

	Parameter values: [2.8735475420448138, 3.5259572807575981, 0.74692797246320053, 0.090767601758779848, 0.83667786861157345, 0.01951795173539627]
	Function value:   82.553903927690158
	Iterations:       500
	Function calls:   972
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 33       xk: [    2.873547542,     3.525957281,    0.7469279725,   0.09076760176,    0.8366778686,   0.01951795174]    fk: 82.5539039277       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873547542,     3.525957281,    0.7469279725,   0.09076760176,    0.8366778686,   0.01951795174]    fk: 82.5539039277       
	k: 100      xk: [    2.873547542,     3.525957281,    0.7469279725,   0.09076760176,    0.8366778686,   0.01951795174]    fk: 82.5539039277       
	k: 200      xk: [    2.873547542,     3.525957281,    0.7469279725,   0.09076760176,    0.8366778686,   0.01951795174]    fk: 82.5539039277       
	k: 300      xk: [    2.873548827,     3.525957438,    0.7469276911,   0.09076759812,    0.8366778324,   0.01951795366]    fk: 82.5539039037       
	k: 400      xk: [    2.873548828,     3.525957438,    0.7469276898,   0.09076759815,    0.8366778322,   0.01951795368]    fk: 82.5539039037       

	Parameter values: [2.8735488277313763, 3.52595743775667, 0.74692768983558411, 0.090767598154545867, 0.83667783220576919, 0.019517953677379338]
	Function value:   82.55390390370053
	Iterations:       412
	Function calls:   825
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 34       xk: [    2.873548828,     3.525957438,    0.7469276898,   0.09076759815,    0.8366778322,   0.01951795368]    fk: 82.5539039037       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873548828,     3.525957438,    0.7469276898,   0.09076759815,    0.8366778322,   0.01951795368]    fk: 82.5539039037       
	k: 100      xk: [    2.873548828,     3.525957438,    0.7469276898,   0.09076759815,    0.8366778322,   0.01951795368]    fk: 82.5539039037       
	k: 200      xk: [    2.873550057,     3.525954669,    0.7469347022,   0.09076750166,      0.83667856,   0.01951786189]    fk: 82.553902597        
	k: 300      xk: [    2.873548539,     3.525840828,    0.7469200576,   0.09076981077,    0.8366791826,   0.01951853741]    fk: 82.55387142         
	k: 400      xk: [    2.873547938,     3.525835279,    0.7469228409,   0.09076987666,     0.836679389,    0.0195185355]    fk: 82.5538711898       

	Parameter values: [2.8735294218750287, 3.5258256551961988, 0.7469402129882563, 0.090769819432324345, 0.83668113588266513, 0.019518363362865679]
	Function value:   82.553869332315628
	Iterations:       500
	Function calls:   811
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 35       xk: [    2.873529422,     3.525825655,     0.746940213,   0.09076981943,    0.8366811359,   0.01951836336]    fk: 82.5538694468       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873529422,     3.525825655,     0.746940213,   0.09076981943,    0.8366811359,   0.01951836336]    fk: 82.5538693323       
	k: 100      xk: [    2.873529422,     3.525825655,     0.746940213,   0.09076981943,    0.8366811359,   0.01951836336]    fk: 82.5538693323       
	k: 200      xk: [    2.873531076,     3.525827964,    0.7469369828,   0.09076980187,    0.8366810441,   0.01951837393]    fk: 82.5538692411       
	k: 300      xk: [    2.873527669,     3.525826986,    0.7469394844,   0.09076980823,    0.8366811408,   0.01951836215]    fk: 82.5538691813       
	k: 400      xk: [    2.873527644,     3.525826963,    0.7469394519,   0.09076980972,    0.8366811356,   0.01951836298]    fk: 82.5538691812       

	Parameter values: [2.873527644170407, 3.5258269633739805, 0.74693945188560251, 0.09076980971795226, 0.83668113557285895, 0.019518362978107752]
	Function value:   82.55386918118711
	Iterations:       429
	Function calls:   871
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 36       xk: [    2.873527644,     3.525826963,    0.7469394519,   0.09076980972,    0.8366811356,   0.01951836298]    fk: 82.5538691812       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873527644,     3.525826963,    0.7469394519,   0.09076980972,    0.8366811356,   0.01951836298]    fk: 82.5538691812       
	k: 100      xk: [    2.873527644,     3.525826963,    0.7469394519,   0.09076980972,    0.8366811356,   0.01951836298]    fk: 82.5538691812       
	k: 200      xk: [    2.873527644,     3.525826963,    0.7469394519,   0.09076980972,    0.8366811356,   0.01951836298]    fk: 82.5538691812       
	k: 300      xk: [    2.873527726,     3.525826506,    0.7469392087,   0.09076982504,    0.8366810961,   0.01951837042]    fk: 82.5538691801       
	k: 400      xk: [    2.873527969,     3.525826545,    0.7469391195,    0.0907698228,    0.8366811032,   0.01951836966]    fk: 82.5538691795       

	Parameter values: [2.8735279685050266, 3.5258265446689476, 0.74693911953393932, 0.090769822797792041, 0.83668110320378353, 0.019518369657484939]
	Function value:   82.55386917952282
	Iterations:       450
	Function calls:   887
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 37       xk: [    2.873527969,     3.525826545,    0.7469391195,    0.0907698228,    0.8366811032,   0.01951836966]    fk: 82.5538691795       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873527969,     3.525826545,    0.7469391195,    0.0907698228,    0.8366811032,   0.01951836966]    fk: 82.5538691795       
	k: 100      xk: [    2.873527969,     3.525826545,    0.7469391195,    0.0907698228,    0.8366811032,   0.01951836966]    fk: 82.5538691795       
	k: 200      xk: [    2.873527969,     3.525826545,    0.7469391195,    0.0907698228,    0.8366811032,   0.01951836966]    fk: 82.5538691795       
	k: 300      xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,    0.8366811099,   0.01951836869]    fk: 82.5538691795       

	Parameter values: [2.8735279749690621, 3.5258265279217742, 0.74693919784152785, 0.090769821645987583, 0.83668110995009437, 0.019518368688599255]
	Function value:   82.553869179476408
	Iterations:       360
	Function calls:   760
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 38       xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
	k: 100      xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
	k: 200      xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
	k: 300      xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       

	Parameter values: [2.8735279749690732, 3.5258265279216774, 0.7469391978415878, 0.090769821645988819, 0.83668110995009548, 0.019518368688599356]
	Function value:   82.553869179459724
	Iterations:       392
	Function calls:   793
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 39       xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
	k: 100      xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
	k: 200      xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
	k: 300      xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       

	Parameter values: [2.8735279749690719, 3.5258265279216774, 0.74693919784158758, 0.090769821645988819, 0.8366811099500957, 0.019518368688599359]
	Function value:   82.553869179459667
	Iterations:       394
	Function calls:   812
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 40       xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
	k: 100      xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
	k: 200      xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       
	k: 300      xk: [    2.873527975,     3.525826528,    0.7469391978,   0.09076982165,      0.83668111,   0.01951836869]    fk: 82.5538691795       

	Parameter values: [2.8735279749690719, 3.5258265279216774, 0.74693919784158758, 0.090769821645988819, 0.8366811099500957, 0.019518368688599359]
	Function value:   82.553869179459667
	Iterations:       383
	Function calls:   774
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [2.8735279749690719, 3.5258265279216774, 0.74693919784158758, 0.090769821645988819, 0.8366811099500957, 0.019518368688599359]
Function value:   82.553869179459667
Iterations:       19353
Function calls:   35480
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (600.000 MHz):           28.735279749690719
r2 (800.000 MHz):           35.258265279216772
dw:                          0.746939197841588
dwH:                         0.090769821645989
pA:                          0.836681109950096
kex:                       195.183686885993581


Fitting to the spin block [':137@F']
------------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [              4,               4,           0.981,            0.01,             0.7,         1.00009]    fk: 1477.58865342       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [              4,               4,         1.03005,            0.01,             0.7,         1.00009]    fk: 1256.66595515       
	k: 100      xk: [    4.515373032,     5.390136834,    0.6486232418,   0.01819176779,    0.8357668104,   0.07539069669]    fk: 60.0538176359       
	k: 200      xk: [     4.60917851,     5.572614251,    0.6997142639,   0.01744283104,     0.861014448,   0.05877377183]    fk: 39.8841970946       
	k: 300      xk: [    4.556798131,     5.659474977,    0.7993147296,   0.01570192324,    0.8768501901,   0.04960389849]    fk: 32.9385726121       
	k: 400      xk: [    4.555976397,     5.658372429,    0.7992656733,    0.0157022391,    0.8768321802,   0.04964233857]    fk: 32.9378559601       

	Parameter values: [4.5559766288604955, 5.658372321936767, 0.79926905666624481, 0.015702271999012335, 0.87683252487511076, 0.049641931592785987]
	Function value:   32.937855945042799
	Iterations:       500
	Function calls:   803
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [    4.555976629,     5.658372322,    0.7992690567,     0.015702272,    0.8768325249,   0.04964193159]    fk: 32.9728253664       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.555976629,     5.658372322,    0.7992690567,     0.015702272,    0.8768325249,   0.04964193159]    fk: 32.9724756722       
	k: 100      xk: [    4.558006968,     5.662716505,    0.7999854242,  0.004427112446,    0.8769732012,   0.04958773507]    fk: 32.9695917026       
	k: 200      xk: [    4.558037206,     5.662326126,    0.7999235801,  0.001882213712,     0.877010896,   0.04963590865]    fk: 32.9693544484       
	k: 300      xk: [    4.558037251,     5.662325934,    0.7999233405,  0.001877422621,    0.8770108918,   0.04963596836]    fk: 32.9693544476       

	Parameter values: [4.5580372513715082, 5.6623259340562591, 0.79992334047079583, 0.0018774226213973816, 0.87701089175941038, 0.049635968364284189]
	Function value:   32.969354447597539
	Iterations:       397
	Function calls:   858
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 2        xk: [    4.558037251,     5.662325934,    0.7999233405,  0.001877422621,    0.8770108918,   0.04963596836]    fk: 32.9694917976       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.558037251,     5.662325934,    0.7999233405,  0.001877422621,    0.8770108918,   0.04963596836]    fk: 32.9694904241       
	k: 100      xk: [    4.558078204,     5.662587606,    0.7999032813, 0.0006127258978,    0.8770116317,   0.04963525699]    fk: 32.969458754        
	k: 200      xk: [    4.558067022,     5.662381367,    0.7999321046,  0.000193143155,    0.8770133184,   0.04963592091]    fk: 32.9694431992       
	k: 300      xk: [    4.558066762,     5.662382464,     0.799932654,  0.000187483674,    0.8770134442,    0.0496358945]    fk: 32.9694431975       
	k: 400      xk: [    4.558066762,     5.662382464,     0.799932654,  0.000187483674,    0.8770134442,    0.0496358945]    fk: 32.9694431975       

	Parameter values: [4.5580667621474467, 5.6623824640906104, 0.79993265395251423, 0.0001874836739849005, 0.8770134441545212, 0.049635894503563788]
	Function value:   32.969443197517485
	Iterations:       405
	Function calls:   843
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 3        xk: [    4.558066762,     5.662382464,     0.799932654,  0.000187483674,    0.8770134442,    0.0496358945]    fk: 32.9694422671       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.558066762,     5.662382464,     0.799932654,  0.000187483674,    0.8770134442,    0.0496358945]    fk: 32.9694422764       
	k: 100      xk: [    4.558066762,     5.662382464,     0.799932654,  0.000187483674,    0.8770134442,    0.0496358945]    fk: 32.9694422764       
	k: 200      xk: [     4.55806712,     5.662383023,    0.7999327584, 1.915565118e-05,    0.8770134689,   0.04963588666]    fk: 32.9694418052       
	k: 300      xk: [    4.558067059,     5.662382953,    0.7999328038, 1.874764047e-05,    0.8770134771,   0.04963588862]    fk: 32.9694418052       

	Parameter values: [4.5580670585451664, 5.6623829530165644, 0.7999328038489073, 1.8747640473252154e-05, 0.87701347714801625, 0.049635888617207399]
	Function value:   32.969441805224761
	Iterations:       333
	Function calls:   737
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [    4.558067059,     5.662382953,    0.7999328038, 1.874764047e-05,    0.8770134771,   0.04963588862]    fk: 32.9694417729       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.558067059,     5.662382953,    0.7999328038, 1.874764047e-05,    0.8770134771,   0.04963588862]    fk: 32.9694417732       
	k: 100      xk: [    4.558067059,     5.662382953,    0.7999328038, 1.874764047e-05,    0.8770134771,   0.04963588862]    fk: 32.9694417732       
	k: 200      xk: [    4.558067057,      5.66238291,    0.7999327416, 2.132315297e-06,     0.877013465,   0.04963588951]    fk: 32.9694417685       
	k: 300      xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976132747e-06,     0.877013467,    0.0496358916]    fk: 32.9694417685       

	Parameter values: [4.5580670948097897, 5.6623829883869377, 0.79993273717359203, 1.9761330484276966e-06, 0.87701346696358584, 0.049635891596112161]
	Function value:   32.969441768503849
	Iterations:       349
	Function calls:   745
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
	k: 100      xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
	k: 200      xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        

	Parameter values: [4.5580670948097897, 5.6623829883869377, 0.79993273717359137, 1.9761330483727767e-06, 0.87701346696358584, 0.049635891596112244]
	Function value:   32.969441767960916
	Iterations:       282
	Function calls:   637
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
	k: 100      xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
	k: 200      xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        

	Parameter values: [4.5580670948097897, 5.6623829883869377, 0.79993273717359137, 1.9761330483727767e-06, 0.87701346696358584, 0.049635891596112244]
	Function value:   32.969441767955487
	Iterations:       279
	Function calls:   625
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
	k: 100      xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
	k: 200      xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        

	Parameter values: [4.5580670948097897, 5.6623829883869377, 0.79993273717359137, 1.9761330483727767e-06, 0.87701346696358584, 0.049635891596112244]
	Function value:   32.969441767955438
	Iterations:       279
	Function calls:   625
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
	k: 100      xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        
	k: 200      xk: [    4.558067095,     5.662382988,    0.7999327372, 1.976133048e-06,     0.877013467,    0.0496358916]    fk: 32.969441768        

	Parameter values: [4.5580670948097897, 5.6623829883869377, 0.79993273717359137, 1.9761330483727767e-06, 0.87701346696358584, 0.049635891596112244]
	Function value:   32.969441767955438
	Iterations:       279
	Function calls:   625
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [4.5580670948097897, 5.6623829883869377, 0.79993273717359137, 1.9761330483727767e-06, 0.87701346696358584, 0.049635891596112244]
Function value:   32.969441767955438
Iterations:       3103
Function calls:   6498
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (600.000 MHz):           45.580670948097897
r2 (800.000 MHz):           56.623829883869377
dw:                          0.799932737173591
dwH:                         0.000001976133048
pA:                          0.877013466963586
kex:                       496.358915961122420

relax> relax_disp.plot_disp_curves(dir='mq_cr72_analysis/MQ CR72', force=True)
Opening the file 'mq_cr72_analysis/MQ CR72/disp_135_S.agr' for writing.
Opening the file 'mq_cr72_analysis/MQ CR72/disp_135_F.agr' for writing.
Opening the file 'mq_cr72_analysis/MQ CR72/disp_137_S.agr' for writing.
Opening the file 'mq_cr72_analysis/MQ CR72/disp_137_F.agr' for writing.
Opening the file 'mq_cr72_analysis/MQ CR72/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='mq_cr72_analysis/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/MQ CR72/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='mq_cr72_analysis/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/MQ CR72/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='mq_cr72_analysis/MQ CR72', force=True, norm=False)
Opening the file 'mq_cr72_analysis/MQ CR72/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='mq_cr72_analysis/MQ CR72', force=True, norm=False)
Opening the file 'mq_cr72_analysis/MQ CR72/pB.agr' for writing.

relax> value.write(param='dw', file='dw.out', dir='mq_cr72_analysis/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/MQ CR72/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='mq_cr72_analysis/MQ CR72', force=True, norm=False)
Opening the file 'mq_cr72_analysis/MQ CR72/dw.agr' for writing.

relax> value.write(param='dwH', file='dwH.out', dir='mq_cr72_analysis/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/MQ CR72/dwH.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dwH', spin_id=None, plot_data='value', file='dwH.agr', dir='mq_cr72_analysis/MQ CR72', force=True, norm=False)
Opening the file 'mq_cr72_analysis/MQ CR72/dwH.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='mq_cr72_analysis/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/MQ CR72/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='mq_cr72_analysis/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/MQ CR72/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='mq_cr72_analysis/MQ CR72', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/MQ CR72/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='mq_cr72_analysis/MQ CR72', force=True, norm=False)
Opening the file 'mq_cr72_analysis/MQ CR72/k_AB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='mq_cr72_analysis/MQ CR72', force=True, norm=False)
Opening the file 'mq_cr72_analysis/MQ CR72/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='mq_cr72_analysis/MQ CR72', force=True, norm=False)
Opening the file 'mq_cr72_analysis/MQ CR72/tex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='mq_cr72_analysis/MQ CR72', force=True, norm=False)
Opening the file 'mq_cr72_analysis/MQ CR72/chi2.agr' for writing.

relax> results.write(file='results', dir='mq_cr72_analysis/MQ CR72', compress_type=1, force=True)
Opening the file 'mq_cr72_analysis/MQ CR72/results.bz2' for writing.

relax> model_selection(method='AIC', modsel_pipe='final', bundle='relax_disp', pipes=['No Rex', 'MQ CR72'])
AIC model selection.


The spin cluster [':135@S'].
# Data pipe    Num_params_(k)    Num_data_sets_(n)    Chi2          Criterion     
No Rex         2                 18                   3969.76482    3973.76482    
MQ CR72        6                 18                   307.56817     319.56817     
The model from the data pipe 'MQ CR72' has been selected.


The spin cluster [':135@F'].
# Data pipe    Num_params_(k)    Num_data_sets_(n)    Chi2          Criterion     
No Rex         2                 18                   3815.60337    3819.60337    
MQ CR72        6                 18                   54.80095      66.80095      
The model from the data pipe 'MQ CR72' has been selected.


The spin cluster [':137@S'].
# Data pipe    Num_params_(k)    Num_data_sets_(n)    Chi2          Criterion     
No Rex         2                 18                   5059.72439    5063.72439    
MQ CR72        6                 18                   82.55387      94.55387      
The model from the data pipe 'MQ CR72' has been selected.


The spin cluster [':137@F'].
# Data pipe    Num_params_(k)    Num_data_sets_(n)    Chi2          Criterion     
No Rex         2                 18                   1764.08570    1768.08570    
MQ CR72        6                 18                   32.96944      44.96944      
The model from the data pipe 'MQ CR72' has been selected.

relax> monte_carlo.setup(number=3)

relax> monte_carlo.create_data(method='back_calc')

relax> monte_carlo.initial_values()

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)
Simulation 1, cluster [':135@S']
Simulation 1, cluster [':135@F']
Simulation 1, cluster [':137@S']
Simulation 1, cluster [':137@F']
Simulation 2, cluster [':135@S']
Simulation 2, cluster [':135@F']
Simulation 2, cluster [':137@S']
Simulation 2, cluster [':137@F']
Simulation 3, cluster [':135@S']
Simulation 3, cluster [':135@F']
Simulation 3, cluster [':137@S']
Simulation 3, cluster [':137@F']

relax> monte_carlo.error_analysis()

relax> relax_disp.plot_disp_curves(dir='mq_cr72_analysis/final', force=True)
Opening the file 'mq_cr72_analysis/final/disp_135_S.agr' for writing.
Opening the file 'mq_cr72_analysis/final/disp_135_F.agr' for writing.
Opening the file 'mq_cr72_analysis/final/disp_137_S.agr' for writing.
Opening the file 'mq_cr72_analysis/final/disp_137_F.agr' for writing.
Opening the file 'mq_cr72_analysis/final/grace2images.py' for writing.

relax> value.write(param='pA', file='pA.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/pA.out' for writing.

relax> value.write(param='pB', file='pB.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/pB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pA', spin_id=None, plot_data='value', file='pA.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/pA.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='pB', spin_id=None, plot_data='value', file='pB.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/pB.agr' for writing.

relax> value.write(param='phi_ex', file='phi_ex.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/phi_ex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex', spin_id=None, plot_data='value', file='phi_ex.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/phi_ex.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> value.write(param='phi_ex_B', file='phi_ex_B.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/phi_ex_B.out' for writing.

relax> value.write(param='phi_ex_C', file='phi_ex_C.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/phi_ex_C.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex_B', spin_id=None, plot_data='value', file='phi_ex_B.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/phi_ex_B.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='phi_ex_C', spin_id=None, plot_data='value', file='phi_ex_C.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/phi_ex_C.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> value.write(param='padw2', file='padw2.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/padw2.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='padw2', spin_id=None, plot_data='value', file='padw2.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/padw2.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> value.write(param='dw', file='dw.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/dw.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dw', spin_id=None, plot_data='value', file='dw.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/dw.agr' for writing.

relax> value.write(param='dwH', file='dwH.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/dwH.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='dwH', spin_id=None, plot_data='value', file='dwH.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/dwH.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/k_AB.out' for writing.

relax> value.write(param='kex', file='kex.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/kex.out' for writing.

relax> value.write(param='tex', file='tex.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/tex.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/k_AB.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kex', spin_id=None, plot_data='value', file='kex.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/kex.agr' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='tex', spin_id=None, plot_data='value', file='tex.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/tex.agr' for writing.

relax> value.write(param='k_AB', file='k_AB.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/k_AB.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='k_AB', spin_id=None, plot_data='value', file='k_AB.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/k_AB.agr' for writing.

relax> value.write(param='kB', file='kB.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/kB.out' for writing.

relax> value.write(param='kC', file='kC.out', dir='mq_cr72_analysis/final', scaling=1.0, comment=None, bc=False, force=True)
Opening the file 'mq_cr72_analysis/final/kC.out' for writing.

relax> grace.write(x_data_type='res_num', y_data_type='kB', spin_id=None, plot_data='value', file='kB.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/kB.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='kC', spin_id=None, plot_data='value', file='kC.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/kC.agr' for writing.
RelaxWarning: No data could be found, creating an empty file.

relax> grace.write(x_data_type='res_num', y_data_type='chi2', spin_id=None, plot_data='value', file='chi2.agr', dir='mq_cr72_analysis/final', force=True, norm=False)
Opening the file 'mq_cr72_analysis/final/chi2.agr' for writing.

relax> results.write(file='results', dir='mq_cr72_analysis/final', compress_type=1, force=True)
Opening the file 'mq_cr72_analysis/final/results.bz2' for writing.

relax> state.save(state='final_state', dir='mq_cr72_analysis', compress_type=1, force=True)
Opening the file 'mq_cr72_analysis/final_state.bz2' for writing.

