


                                  relax repository checkout r21622
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'cpmg_fit_solution_cr72.py'
----------------------------------------------------------------------------------------------------
"""Compare the cpmg_fit and relax solutions.

To run this, type:

$ rm -f cpmg_fit_solution_cr72.log; ../../../../../relax --tee cpmg_fit_solution_cr72.log cpmg_fit_solution_cr72.py


This uses the data from Dmitry Korzhnev's paper at U{DOI: 10.1021/ja054550e<http://dx.doi.org/10.1021/ja054550e>}.  This is the 1H SQ, 15N SQ, ZQ, DQ, 1H MQ and 15N MQ data for residue Asp 9 of the Fyn SH3 domain mutant.

Here all data will be used.  The values found by cpmg_fit using just this data are:

    - r2 = {'H-S 500': 6.778901685616349, 'H-S 600':  7.097457574164754, 'H-S 800':  5.635892738874367,
            'N-S 500': 8.481132052795216, 'N-S 600':  8.977844777932544, 'N-S 800': 10.490256957494095,
            'NHZ 500': 6.043941666541193, 'NHZ 600':  6.827801822697070, 'NHZ 800':  6.946693082577048,
            'NHD 500': 8.693570244455426, 'NHD 600': 10.744671857325738, 'NHD 800': 12.647868752250540,
            'HNM 500': 7.887263548378362, 'HNM 600':  8.506480948916035, 'HNM 800': 11.276893369084453,
            'NHM 500': 9.245925304879110, 'NHM 600':  9.949254911695823, 'NHM 800': 12.053030643443734},
    - pA = 0.944322334629977,
    - kex = 368.075224340237810,
    - dw = 4.413451295385187,
    - dwH = -0.271799433880579,
    - chi2 = 162.379807990821462.
"""

# Python module imports.
from os import remove
from shutil import move

# relax module imports.
from specific_analyses.relax_disp.disp_data import generate_r20_key
from specific_analyses.relax_disp.variables import EXP_TYPE_CPMG_DQ, EXP_TYPE_CPMG_MQ, EXP_TYPE_CPMG_PROTON_MQ, EXP_TYPE_CPMG_PROTON_SQ, EXP_TYPE_CPMG_SQ, EXP_TYPE_CPMG_ZQ


# Create a data pipe.
pipe.create('R2eff', 'relax_disp')

# Create the spin system.
spin.create(res_name='Asp', res_num=9, spin_name='H')
spin.create(res_name='Asp', res_num=9, spin_name='N')
spin.element('H', spin_id='@H')
spin.element('N', spin_id='@N')
spin.isotope('1H', spin_id='@H')
spin.isotope('15N', spin_id='@N')

# Define the magnetic dipole-dipole relaxation interaction.
interatom.define(spin_id1=':9@N', spin_id2=':9@H', direct_bond=True)

# The spectral data - experiment ID, R2eff file name, experiment type, spin ID string, spectrometer frequency in Hertz, relaxation time.
data = [
    ['1H SQ', '1H_SQ_CPMG_500_MHz',  'hs_500.res', EXP_TYPE_CPMG_PROTON_SQ, ':9@H', 500e6, 0.03],
    ['1H SQ', '1H_SQ_CPMG_600_MHz',  'hs_600.res', EXP_TYPE_CPMG_PROTON_SQ, ':9@H', 600e6, 0.03],
    ['1H SQ', '1H_SQ_CPMG_800_MHz',  'hs_800.res', EXP_TYPE_CPMG_PROTON_SQ, ':9@H', 800e6, 0.03],
    ['SQ',    '15N_SQ_CPMG_500_MHz', 'ns_500.res', EXP_TYPE_CPMG_SQ,        ':9@N', 500e6, 0.04],
    ['SQ',    '15N_SQ_CPMG_600_MHz', 'ns_600.res', EXP_TYPE_CPMG_SQ,        ':9@N', 600e6, 0.04],
    ['SQ',    '15N_SQ_CPMG_800_MHz', 'ns_800.res', EXP_TYPE_CPMG_SQ,        ':9@N', 800e6, 0.04],
    ['ZQ',    '15N_ZQ_CPMG_500_MHz', 'zq_500.res', EXP_TYPE_CPMG_ZQ,        ':9@N', 500e6, 0.03],
    ['ZQ',    '15N_ZQ_CPMG_600_MHz', 'zq_600.res', EXP_TYPE_CPMG_ZQ,        ':9@N', 600e6, 0.03],
    ['ZQ',    '15N_ZQ_CPMG_800_MHz', 'zq_800.res', EXP_TYPE_CPMG_ZQ,        ':9@N', 800e6, 0.03],
    ['DQ',    '15N_DQ_CPMG_500_MHz', 'dq_500.res', EXP_TYPE_CPMG_DQ,        ':9@N', 500e6, 0.03],
    ['DQ',    '15N_DQ_CPMG_600_MHz', 'dq_600.res', EXP_TYPE_CPMG_DQ,        ':9@N', 600e6, 0.03],
    ['DQ',    '15N_DQ_CPMG_800_MHz', 'dq_800.res', EXP_TYPE_CPMG_DQ,        ':9@N', 800e6, 0.03],
    ['1H MQ', '1H_MQ_CPMG_500_MHz',  'hm_500.res', EXP_TYPE_CPMG_PROTON_MQ, ':9@H', 500e6, 0.02],
    ['1H MQ', '1H_MQ_CPMG_600_MHz',  'hm_600.res', EXP_TYPE_CPMG_PROTON_MQ, ':9@H', 600e6, 0.02],
    ['1H MQ', '1H_MQ_CPMG_800_MHz',  'hm_800.res', EXP_TYPE_CPMG_PROTON_MQ, ':9@H', 800e6, 0.02],
    ['MQ',    '15N_MQ_CPMG_500_MHz', 'nm_500.res', EXP_TYPE_CPMG_MQ,        ':9@N', 500e6, 0.02],
    ['MQ',    '15N_MQ_CPMG_600_MHz', 'nm_600.res', EXP_TYPE_CPMG_MQ,        ':9@N', 600e6, 0.02],
    ['MQ',    '15N_MQ_CPMG_800_MHz', 'nm_800.res', EXP_TYPE_CPMG_MQ,        ':9@N', 800e6, 0.02]
]
cpmg_frqs_1h_sq = [67.0, 133.0, 267.0, 400.0, 533.0, 667.0, 800.0, 933.0, 1067.0, 1600.0, 2133.0, 2667.0]
cpmg_frqs_sq = [50.0, 100.0, 150.0, 200.0, 250.0, 300.0, 350.0, 400.0, 450.0, 500.0, 600.0, 700.0, 800.0, 900.0, 1000.0]
cpmg_frqs_dq = [33.0, 67.0, 133.0, 200.0, 267.0, 333.0, 400.0, 467.0, 533.0, 667.0, 800.0, 933.0, 1067.0]
cpmg_frqs_zq = [33.0, 67.0, 133.0, 200.0, 267.0, 333.0, 400.0, 467.0, 533.0, 667.0, 800.0, 933.0, 1067.0]
cpmg_frqs_1h_mq = [50.0, 100.0, 150.0, 200.0, 250.0, 300.0, 400.0, 500.0, 600.0, 700.0, 800.0, 1000.0, 1500.0, 2000.0, 2500.0]
cpmg_frqs_mq = [50.0, 100.0, 150.0, 200.0, 250.0, 300.0, 350.0, 400.0, 500.0, 600.0, 700.0, 800.0, 900.0, 1000.0]

# Loop over the files, reading in the data.
for data_type, id, file, exp_type, spin_id, H_frq, relax_time in data:
    # Alias the CPMG frequencies.
    if data_type == 'SQ':
        cpmg_frqs = cpmg_frqs_sq
    elif data_type == '1H SQ':
        cpmg_frqs = cpmg_frqs_1h_sq
    elif data_type == 'DQ':
        cpmg_frqs = cpmg_frqs_dq
    elif data_type == 'ZQ':
        cpmg_frqs = cpmg_frqs_zq
    elif data_type == '1H MQ':
        cpmg_frqs = cpmg_frqs_1h_mq
    elif data_type == 'MQ':
        cpmg_frqs = cpmg_frqs_mq

    # Loop over each CPMG frequency.
    for cpmg_frq in cpmg_frqs:
        # The id.
        new_id = "%s_%s" % (id, cpmg_frq)

        # Set the NMR field strength.
        spectrometer.frequency(id=new_id, frq=H_frq)

        # Set the relaxation dispersion experiment type.
        relax_disp.exp_type(spectrum_id=new_id, exp_type=exp_type)

        # Relaxation dispersion CPMG constant time delay T (in s).
        relax_disp.relax_time(spectrum_id=new_id, time=relax_time)

    # Read the R2eff data.
    relax_disp.r2eff_read_spin(id=id, file=file, dir='..', spin_id=spin_id, disp_point_col=1, data_col=2, error_col=3)

# Change the model.
relax_disp.select_model('MQ CR72')

# The R20 keys.
r20_key1 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=500e6)
r20_key2 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=600e6)
r20_key3 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=800e6)
r20_key4 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=500e6)
r20_key5 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=600e6)
r20_key6 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=800e6)
r20_key7 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=500e6)
r20_key8 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=600e6)
r20_key9 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=800e6)
r20_key10 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=500e6)
r20_key11 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=600e6)
r20_key12 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=800e6)
r20_key13 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=500e6)
r20_key14 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=600e6)
r20_key15 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=800e6)
r20_key16 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=500e6)
r20_key17 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=600e6)
r20_key18 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=800e6)

# Manually set the parameter values.
spin_N = cdp.mol[0].res[0].spin[1]
spin_N.r2 = {
    r20_key1:  6.778901685616349, r20_key2:   7.097457574164754, r20_key3:   5.635892738874367,
    r20_key4:  8.481132052795216, r20_key5:   8.977844777932544, r20_key6:  10.490256957494095,
    r20_key7:  6.043941666541193, r20_key8:   6.827801822697070, r20_key9:   6.946693082577048,
    r20_key10: 8.693570244455426, r20_key11: 10.744671857325738, r20_key12: 12.647868752250540,
    r20_key13: 7.887263548378362, r20_key14:  8.506480948916035, r20_key15: 11.276893369084453,
    r20_key16: 9.245925304879110, r20_key17:  9.949254911695823, r20_key18: 12.053030643443734,
}
spin_N.pA = 0.944322334629977
spin_N.kex = 368.075224340237810
spin_N.dw = 4.413451295385187
spin_N.dwH = -0.271799433880579

# Calculate.
calc()

# Plot the dispersion curves.
relax_disp.plot_disp_curves(dir='.', num_points=100, extend=0, force=True)

# Save the results.
state.save('cpmg_fit_solution_cr72', dir='.', compress_type=1, force=True)

# Cleanup.
print("\n\nMoving 'disp_9_N.agr' to 'cpmg_fit_solution_cr72.agr'.")
move('disp_9_N.agr', 'cpmg_fit_solution_cr72.agr')
print("Deleting 'grace2images.py'.")
remove('grace2images.py')
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='R2eff', pipe_type='relax_disp', bundle=None)

relax> spin.create(spin_name='H', spin_num=None, res_name='Asp', res_num=9, mol_name=None)

relax> spin.create(spin_name='N', spin_num=None, res_name='Asp', res_num=9, mol_name=None)

relax> spin.element(element='H', spin_id='@H', force=False)

relax> spin.element(element='N', spin_id='@N', force=False)

relax> spin.isotope(isotope='1H', spin_id='@H', force=False)

relax> spin.isotope(isotope='15N', spin_id='@N', force=False)

relax> interatom.define(spin_id1=':9@N', spin_id2=':9@H', direct_bond=True, pipe=None)
Interatomic interactions are now defined for the following spins:

# Spin_ID_1    Spin_ID_2    
':9@N'         ':9@H'       

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_67.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_67.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_67.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_67.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_133.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_133.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_133.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_133.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_267.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_267.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_267.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_267.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_400.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_400.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_400.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_400.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_533.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_533.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_533.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_533.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_667.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_667.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_667.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_667.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_800.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_800.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_800.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_800.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_933.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_933.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_933.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_933.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_1067.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_1067.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_1067.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_1067.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_1600.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_1600.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_1600.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_1600.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_1600.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_2133.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_2133.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_2133.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_2133.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_2133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_500_MHz_2667.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_500_MHz_2667.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_500_MHz_2667.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_500_MHz_2667.0', time=0.03)
Setting the '1H_SQ_CPMG_500_MHz_2667.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='1H_SQ_CPMG_500_MHz', spin_id=':9@H', file='hs_500.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../hs_500.res' for reading.
The spectrum ID '1H_SQ_CPMG_500_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_933.0' CPMG frequency is set to 933.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_1067.0' CPMG frequency is set to 1067.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_1600.0' CPMG frequency is set to 1600.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_2133.0' CPMG frequency is set to 2133.0 Hz.
The spectrum ID '1H_SQ_CPMG_500_MHz_2667.0' CPMG frequency is set to 2667.0 Hz.
Using the experiment IDs ['1H_SQ_CPMG_500_MHz_67.0', '1H_SQ_CPMG_500_MHz_133.0', '1H_SQ_CPMG_500_MHz_267.0', '1H_SQ_CPMG_500_MHz_400.0', '1H_SQ_CPMG_500_MHz_533.0', '1H_SQ_CPMG_500_MHz_667.0', '1H_SQ_CPMG_500_MHz_800.0', '1H_SQ_CPMG_500_MHz_933.0', '1H_SQ_CPMG_500_MHz_1067.0', '1H_SQ_CPMG_500_MHz_1600.0', '1H_SQ_CPMG_500_MHz_2133.0', '1H_SQ_CPMG_500_MHz_2667.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  67.000000000000000      21.479240000000001       0.429580000000000    
 133.000000000000000      16.738980000000002       0.334780000000000    
 267.000000000000000       9.973570000000000       0.199470000000000    
 400.000000000000000       8.238770000000001       0.247370000000000    
 533.000000000000000       7.592900000000000       0.242630000000000    
 667.000000000000000       7.458430000000000       0.241650000000000    
 800.000000000000000       7.112220000000000       0.239150000000000    
 933.000000000000000       7.408800000000000       0.241290000000000    
1067.000000000000000       6.551910000000000       0.166290000000000    
1600.000000000000000       6.721770000000000       0.236370000000000    
2133.000000000000000       7.096290000000000       0.239040000000000    
2667.000000000000000       7.146750000000000       0.239400000000000    

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_67.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_67.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_67.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_67.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_133.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_133.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_133.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_133.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_267.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_267.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_267.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_267.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_400.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_400.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_400.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_400.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_533.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_533.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_533.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_533.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_667.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_667.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_667.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_667.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_800.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_800.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_800.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_800.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_933.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_933.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_933.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_933.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_1067.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_1067.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_1067.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_1067.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_1600.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_1600.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_1600.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_1600.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_1600.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_2133.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_2133.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_2133.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_2133.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_2133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_600_MHz_2667.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_600_MHz_2667.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_600_MHz_2667.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_600_MHz_2667.0', time=0.03)
Setting the '1H_SQ_CPMG_600_MHz_2667.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='1H_SQ_CPMG_600_MHz', spin_id=':9@H', file='hs_600.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../hs_600.res' for reading.
The spectrum ID '1H_SQ_CPMG_600_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_933.0' CPMG frequency is set to 933.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_1067.0' CPMG frequency is set to 1067.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_1600.0' CPMG frequency is set to 1600.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_2133.0' CPMG frequency is set to 2133.0 Hz.
The spectrum ID '1H_SQ_CPMG_600_MHz_2667.0' CPMG frequency is set to 2667.0 Hz.
Using the experiment IDs ['1H_SQ_CPMG_600_MHz_67.0', '1H_SQ_CPMG_600_MHz_133.0', '1H_SQ_CPMG_600_MHz_267.0', '1H_SQ_CPMG_600_MHz_400.0', '1H_SQ_CPMG_600_MHz_533.0', '1H_SQ_CPMG_600_MHz_667.0', '1H_SQ_CPMG_600_MHz_800.0', '1H_SQ_CPMG_600_MHz_933.0', '1H_SQ_CPMG_600_MHz_1067.0', '1H_SQ_CPMG_600_MHz_1600.0', '1H_SQ_CPMG_600_MHz_2133.0', '1H_SQ_CPMG_600_MHz_2667.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  67.000000000000000      23.445460000000001       0.468910000000000    
 133.000000000000000      19.768950000000000       0.426460000000000    
 267.000000000000000      11.707560000000001       0.236780000000000    
 400.000000000000000       8.868470000000000       0.307510000000000    
 533.000000000000000       8.369920000000000       0.302950000000000    
 667.000000000000000       7.718830000000000       0.297090000000000    
 800.000000000000000       7.232220000000000       0.292780000000000    
 933.000000000000000       6.950050000000000       0.290310000000000    
1067.000000000000000       7.439580000000000       0.208320000000000    
1600.000000000000000       7.645880000000000       0.296440000000000    
2133.000000000000000       7.788530000000000       0.297710000000000    
2667.000000000000000       7.587850000000000       0.295920000000000    

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_67.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_67.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_67.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_67.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_133.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_133.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_133.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_133.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_267.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_267.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_267.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_267.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_400.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_400.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_400.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_400.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_533.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_533.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_533.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_533.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_667.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_667.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_667.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_667.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_800.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_800.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_800.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_800.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_933.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_933.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_933.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_933.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_1067.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_1067.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_1067.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_1067.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_1600.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_1600.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_1600.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_1600.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_1600.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_2133.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_2133.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_2133.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_2133.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_2133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='1H_SQ_CPMG_800_MHz_2667.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_SQ_CPMG_800_MHz_2667.0', exp_type='1H SQ CPMG')
The spectrum ID '1H_SQ_CPMG_800_MHz_2667.0' is now set to the 1H single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_SQ_CPMG_800_MHz_2667.0', time=0.03)
Setting the '1H_SQ_CPMG_800_MHz_2667.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='1H_SQ_CPMG_800_MHz', spin_id=':9@H', file='hs_800.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../hs_800.res' for reading.
The spectrum ID '1H_SQ_CPMG_800_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_933.0' CPMG frequency is set to 933.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_1067.0' CPMG frequency is set to 1067.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_1600.0' CPMG frequency is set to 1600.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_2133.0' CPMG frequency is set to 2133.0 Hz.
The spectrum ID '1H_SQ_CPMG_800_MHz_2667.0' CPMG frequency is set to 2667.0 Hz.
Using the experiment IDs ['1H_SQ_CPMG_800_MHz_67.0', '1H_SQ_CPMG_800_MHz_133.0', '1H_SQ_CPMG_800_MHz_267.0', '1H_SQ_CPMG_800_MHz_400.0', '1H_SQ_CPMG_800_MHz_533.0', '1H_SQ_CPMG_800_MHz_667.0', '1H_SQ_CPMG_800_MHz_800.0', '1H_SQ_CPMG_800_MHz_933.0', '1H_SQ_CPMG_800_MHz_1067.0', '1H_SQ_CPMG_800_MHz_1600.0', '1H_SQ_CPMG_800_MHz_2133.0', '1H_SQ_CPMG_800_MHz_2667.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  67.000000000000000      24.387730000000001       0.487750000000000    
 133.000000000000000      22.619000000000000       0.452380000000000    
 267.000000000000000      14.016249999999999       0.280320000000000    
 400.000000000000000       9.268480000000000       0.194240000000000    
 533.000000000000000       8.144980000000000       0.187800000000000    
 667.000000000000000       7.413840000000000       0.183730000000000    
 800.000000000000000       6.698590000000000       0.179820000000000    
 933.000000000000000       6.219090000000000       0.177260000000000    
1067.000000000000000       6.132810000000000       0.125020000000000    
1600.000000000000000       5.828130000000000       0.175190000000000    
2133.000000000000000       5.369680000000000       0.172800000000000    
2667.000000000000000       5.569820000000000       0.173840000000000    

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_50.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_50.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_100.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_100.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_150.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_150.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_200.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_200.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_250.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_250.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_300.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_300.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_350.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_350.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_400.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_400.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_450.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_450.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_500.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_500.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_600.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_600.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_700.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_700.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_800.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_800.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_900.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_900.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_500_MHz_1000.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_500_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_500_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_500_MHz_1000.0', time=0.04)
Setting the '15N_SQ_CPMG_500_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_SQ_CPMG_500_MHz', spin_id=':9@N', file='ns_500.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../ns_500.res' for reading.
The spectrum ID '15N_SQ_CPMG_500_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_SQ_CPMG_500_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_SQ_CPMG_500_MHz_50.0', '15N_SQ_CPMG_500_MHz_100.0', '15N_SQ_CPMG_500_MHz_150.0', '15N_SQ_CPMG_500_MHz_200.0', '15N_SQ_CPMG_500_MHz_250.0', '15N_SQ_CPMG_500_MHz_300.0', '15N_SQ_CPMG_500_MHz_350.0', '15N_SQ_CPMG_500_MHz_400.0', '15N_SQ_CPMG_500_MHz_500.0', '15N_SQ_CPMG_500_MHz_600.0', '15N_SQ_CPMG_500_MHz_700.0', '15N_SQ_CPMG_500_MHz_800.0', '15N_SQ_CPMG_500_MHz_900.0', '15N_SQ_CPMG_500_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      27.157670000000000       0.543150000000000    
 100.000000000000000      26.557810000000000       0.531160000000000    
 150.000000000000000      24.734620000000000       0.494690000000000    
 200.000000000000000      20.986170000000001       0.419720000000000    
 250.000000000000000      17.824420000000000       0.356490000000000    
 300.000000000000000      15.553520000000001       0.311070000000000    
 350.000000000000000      13.789580000000001       0.275790000000000    
 400.000000000000000      12.483340000000000       0.249670000000000    
 500.000000000000000      11.557240000000000       0.231140000000000    
 600.000000000000000      10.538740000000001       0.210770000000000    
 700.000000000000000      10.073950000000000       0.201480000000000    
 800.000000000000000       9.629519999999999       0.192590000000000    
 900.000000000000000       9.499940000000000       0.190000000000000    
1000.000000000000000       8.713500000000000       0.174270000000000    

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_50.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_50.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_100.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_100.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_150.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_150.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_200.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_200.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_250.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_250.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_300.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_300.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_350.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_350.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_400.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_400.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_450.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_450.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_500.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_500.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_600.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_600.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_700.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_700.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_800.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_800.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_900.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_900.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_600_MHz_1000.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_600_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_600_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_600_MHz_1000.0', time=0.04)
Setting the '15N_SQ_CPMG_600_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_SQ_CPMG_600_MHz', spin_id=':9@N', file='ns_600.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../ns_600.res' for reading.
The spectrum ID '15N_SQ_CPMG_600_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_SQ_CPMG_600_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_SQ_CPMG_600_MHz_50.0', '15N_SQ_CPMG_600_MHz_100.0', '15N_SQ_CPMG_600_MHz_150.0', '15N_SQ_CPMG_600_MHz_200.0', '15N_SQ_CPMG_600_MHz_250.0', '15N_SQ_CPMG_600_MHz_300.0', '15N_SQ_CPMG_600_MHz_350.0', '15N_SQ_CPMG_600_MHz_400.0', '15N_SQ_CPMG_600_MHz_500.0', '15N_SQ_CPMG_600_MHz_600.0', '15N_SQ_CPMG_600_MHz_800.0', '15N_SQ_CPMG_600_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      28.712740000000000       0.574250000000000    
 100.000000000000000      28.156870000000001       0.648350000000000    
 150.000000000000000      27.460400000000000       0.630540000000000    
 200.000000000000000      24.311219999999999       0.555910000000000    
 250.000000000000000      21.550129999999999       0.497780000000000    
 300.000000000000000      18.737749999999998       0.444820000000000    
 350.000000000000000      16.154080000000000       0.401140000000000    
 400.000000000000000      14.696420000000000       0.378420000000000    
 500.000000000000000      13.146250000000000       0.262930000000000    
 600.000000000000000      11.594429999999999       0.334260000000000    
 800.000000000000000      10.244870000000001       0.316700000000000    
1000.000000000000000       9.741450000000000       0.310380000000000    

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_50.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_50.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_100.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_100.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_150.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_150.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_200.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_200.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_250.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_250.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_300.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_300.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_350.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_350.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_400.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_400.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_450.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_450.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_500.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_500.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_600.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_600.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_700.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_700.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_800.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_800.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_900.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_900.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_SQ_CPMG_800_MHz_1000.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_SQ_CPMG_800_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_SQ_CPMG_800_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_SQ_CPMG_800_MHz_1000.0', time=0.04)
Setting the '15N_SQ_CPMG_800_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_SQ_CPMG_800_MHz', spin_id=':9@N', file='ns_800.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../ns_800.res' for reading.
The spectrum ID '15N_SQ_CPMG_800_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_450.0' CPMG frequency is set to 450.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_SQ_CPMG_800_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_SQ_CPMG_800_MHz_50.0', '15N_SQ_CPMG_800_MHz_100.0', '15N_SQ_CPMG_800_MHz_150.0', '15N_SQ_CPMG_800_MHz_200.0', '15N_SQ_CPMG_800_MHz_250.0', '15N_SQ_CPMG_800_MHz_300.0', '15N_SQ_CPMG_800_MHz_350.0', '15N_SQ_CPMG_800_MHz_400.0', '15N_SQ_CPMG_800_MHz_450.0', '15N_SQ_CPMG_800_MHz_500.0', '15N_SQ_CPMG_800_MHz_600.0', '15N_SQ_CPMG_800_MHz_700.0', '15N_SQ_CPMG_800_MHz_800.0', '15N_SQ_CPMG_800_MHz_900.0', '15N_SQ_CPMG_800_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      30.671690000000002       0.613430000000000    
 100.000000000000000      30.627970000000001       0.612560000000000    
 150.000000000000000      29.828849999999999       0.596580000000000    
 200.000000000000000      29.389659999999999       0.587790000000000    
 250.000000000000000      27.570190000000000       0.551400000000000    
 300.000000000000000      24.543270000000000       0.490870000000000    
 350.000000000000000      22.107839999999999       0.442160000000000    
 400.000000000000000      20.068380000000001       0.401370000000000    
 450.000000000000000      18.443570000000001       0.368870000000000    
 500.000000000000000      17.131820000000001       0.342640000000000    
 600.000000000000000      15.412590000000000       0.308250000000000    
 700.000000000000000      13.930770000000001       0.278620000000000    
 800.000000000000000      13.458140000000000       0.269160000000000    
 900.000000000000000      12.694400000000000       0.253890000000000    
1000.000000000000000      12.142960000000000       0.242860000000000    

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_33.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_33.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_33.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_33.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_33.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_67.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_67.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_67.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_67.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_133.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_133.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_133.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_133.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_200.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_200.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_200.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_200.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_200.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_267.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_267.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_267.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_267.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_333.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_333.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_333.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_333.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_333.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_400.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_400.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_400.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_400.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_467.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_467.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_467.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_467.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_467.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_533.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_533.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_533.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_533.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_667.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_667.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_667.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_667.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_800.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_800.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_800.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_800.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_933.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_933.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_933.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_933.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_500_MHz_1067.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_500_MHz_1067.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_500_MHz_1067.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_500_MHz_1067.0', time=0.03)
Setting the '15N_ZQ_CPMG_500_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='15N_ZQ_CPMG_500_MHz', spin_id=':9@N', file='zq_500.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../zq_500.res' for reading.
The spectrum ID '15N_ZQ_CPMG_500_MHz_33.0' CPMG frequency is set to 33.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_333.0' CPMG frequency is set to 333.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_467.0' CPMG frequency is set to 467.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_ZQ_CPMG_500_MHz_933.0' CPMG frequency is set to 933.0 Hz.
Using the experiment IDs ['15N_ZQ_CPMG_500_MHz_33.0', '15N_ZQ_CPMG_500_MHz_67.0', '15N_ZQ_CPMG_500_MHz_133.0', '15N_ZQ_CPMG_500_MHz_200.0', '15N_ZQ_CPMG_500_MHz_267.0', '15N_ZQ_CPMG_500_MHz_333.0', '15N_ZQ_CPMG_500_MHz_400.0', '15N_ZQ_CPMG_500_MHz_467.0', '15N_ZQ_CPMG_500_MHz_533.0', '15N_ZQ_CPMG_500_MHz_667.0', '15N_ZQ_CPMG_500_MHz_800.0', '15N_ZQ_CPMG_500_MHz_933.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  33.000000000000000      18.544770000000000       0.741790000000000    
  67.000000000000000      16.514669999999999       0.660590000000000    
 133.000000000000000      10.803490000000000       0.432140000000000    
 200.000000000000000       8.325419999999999       0.333020000000000    
 267.000000000000000       7.235040000000000       0.289400000000000    
 333.000000000000000       6.889130000000000       0.275570000000000    
 400.000000000000000       6.515130000000000       0.260610000000000    
 467.000000000000000       6.251600000000000       0.250060000000000    
 533.000000000000000       6.374040000000000       0.254960000000000    
 667.000000000000000       6.232320000000000       0.249290000000000    
 800.000000000000000       6.170270000000000       0.246810000000000    
 933.000000000000000       6.451310000000000       0.258050000000000    

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_33.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_33.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_33.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_33.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_33.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_67.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_67.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_67.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_67.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_133.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_133.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_133.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_133.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_200.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_200.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_200.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_200.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_200.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_267.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_267.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_267.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_267.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_333.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_333.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_333.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_333.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_333.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_400.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_400.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_400.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_400.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_467.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_467.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_467.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_467.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_467.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_533.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_533.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_533.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_533.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_667.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_667.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_667.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_667.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_800.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_800.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_800.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_800.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_933.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_933.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_933.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_933.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_600_MHz_1067.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_600_MHz_1067.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_600_MHz_1067.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_600_MHz_1067.0', time=0.03)
Setting the '15N_ZQ_CPMG_600_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='15N_ZQ_CPMG_600_MHz', spin_id=':9@N', file='zq_600.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../zq_600.res' for reading.
The spectrum ID '15N_ZQ_CPMG_600_MHz_33.0' CPMG frequency is set to 33.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_333.0' CPMG frequency is set to 333.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_467.0' CPMG frequency is set to 467.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_ZQ_CPMG_600_MHz_933.0' CPMG frequency is set to 933.0 Hz.
Using the experiment IDs ['15N_ZQ_CPMG_600_MHz_33.0', '15N_ZQ_CPMG_600_MHz_67.0', '15N_ZQ_CPMG_600_MHz_133.0', '15N_ZQ_CPMG_600_MHz_200.0', '15N_ZQ_CPMG_600_MHz_267.0', '15N_ZQ_CPMG_600_MHz_333.0', '15N_ZQ_CPMG_600_MHz_400.0', '15N_ZQ_CPMG_600_MHz_467.0', '15N_ZQ_CPMG_600_MHz_533.0', '15N_ZQ_CPMG_600_MHz_667.0', '15N_ZQ_CPMG_600_MHz_800.0', '15N_ZQ_CPMG_600_MHz_933.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  33.000000000000000      20.994479999999999       0.839780000000000    
  67.000000000000000      19.016130000000000       0.760650000000000    
 133.000000000000000      12.426330000000000       0.497230000000000    
 200.000000000000000      10.197270000000000       0.407890000000000    
 267.000000000000000       9.721399999999999       0.458480000000000    
 333.000000000000000       8.034940000000001       0.435860000000000    
 400.000000000000000       7.712380000000000       0.431660000000000    
 467.000000000000000       7.703030000000000       0.431540000000000    
 533.000000000000000       7.314080000000000       0.426530000000000    
 667.000000000000000       7.299390000000000       0.426350000000000    
 800.000000000000000       6.647380000000000       0.418090000000000    
 933.000000000000000       6.999720000000000       0.422530000000000    

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_33.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_33.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_33.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_33.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_33.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_67.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_67.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_67.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_67.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_133.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_133.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_133.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_133.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_200.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_200.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_200.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_200.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_200.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_267.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_267.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_267.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_267.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_333.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_333.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_333.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_333.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_333.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_400.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_400.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_400.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_400.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_467.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_467.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_467.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_467.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_467.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_533.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_533.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_533.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_533.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_667.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_667.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_667.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_667.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_800.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_800.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_800.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_800.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_933.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_933.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_933.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_933.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_ZQ_CPMG_800_MHz_1067.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_ZQ_CPMG_800_MHz_1067.0', exp_type='ZQ CPMG')
The spectrum ID '15N_ZQ_CPMG_800_MHz_1067.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_ZQ_CPMG_800_MHz_1067.0', time=0.03)
Setting the '15N_ZQ_CPMG_800_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='15N_ZQ_CPMG_800_MHz', spin_id=':9@N', file='zq_800.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../zq_800.res' for reading.
The spectrum ID '15N_ZQ_CPMG_800_MHz_33.0' CPMG frequency is set to 33.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_333.0' CPMG frequency is set to 333.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_467.0' CPMG frequency is set to 467.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_933.0' CPMG frequency is set to 933.0 Hz.
The spectrum ID '15N_ZQ_CPMG_800_MHz_1067.0' CPMG frequency is set to 1067.0 Hz.
Using the experiment IDs ['15N_ZQ_CPMG_800_MHz_33.0', '15N_ZQ_CPMG_800_MHz_67.0', '15N_ZQ_CPMG_800_MHz_133.0', '15N_ZQ_CPMG_800_MHz_200.0', '15N_ZQ_CPMG_800_MHz_267.0', '15N_ZQ_CPMG_800_MHz_333.0', '15N_ZQ_CPMG_800_MHz_400.0', '15N_ZQ_CPMG_800_MHz_467.0', '15N_ZQ_CPMG_800_MHz_533.0', '15N_ZQ_CPMG_800_MHz_667.0', '15N_ZQ_CPMG_800_MHz_800.0', '15N_ZQ_CPMG_800_MHz_933.0', '15N_ZQ_CPMG_800_MHz_1067.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  33.000000000000000      24.098389999999998       0.963940000000000    
  67.000000000000000      22.581070000000000       0.903240000000000    
 133.000000000000000      17.796029999999998       0.711840000000000    
 200.000000000000000      13.554140000000000       0.542170000000000    
 267.000000000000000      10.998480000000001       0.439940000000000    
 333.000000000000000       9.698230000000001       0.387930000000000    
 400.000000000000000       8.615190000000000       0.344610000000000    
 467.000000000000000       8.060570000000000       0.322420000000000    
 533.000000000000000       7.483890000000000       0.299360000000000    
 667.000000000000000       7.946680000000000       0.317870000000000    
 800.000000000000000       7.211550000000000       0.288460000000000    
 933.000000000000000       6.728530000000000       0.269140000000000    
1067.000000000000000       7.019760000000000       0.280790000000000    

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_33.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_33.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_33.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_33.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_33.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_67.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_67.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_67.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_67.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_133.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_133.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_133.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_133.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_200.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_200.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_200.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_200.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_200.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_267.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_267.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_267.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_267.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_333.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_333.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_333.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_333.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_333.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_400.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_400.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_400.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_400.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_467.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_467.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_467.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_467.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_467.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_533.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_533.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_533.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_533.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_667.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_667.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_667.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_667.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_800.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_800.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_800.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_800.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_933.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_933.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_933.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_933.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_500_MHz_1067.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_500_MHz_1067.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_500_MHz_1067.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_500_MHz_1067.0', time=0.03)
Setting the '15N_DQ_CPMG_500_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='15N_DQ_CPMG_500_MHz', spin_id=':9@N', file='dq_500.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../dq_500.res' for reading.
The spectrum ID '15N_DQ_CPMG_500_MHz_33.0' CPMG frequency is set to 33.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_333.0' CPMG frequency is set to 333.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_467.0' CPMG frequency is set to 467.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_DQ_CPMG_500_MHz_933.0' CPMG frequency is set to 933.0 Hz.
Using the experiment IDs ['15N_DQ_CPMG_500_MHz_33.0', '15N_DQ_CPMG_500_MHz_67.0', '15N_DQ_CPMG_500_MHz_133.0', '15N_DQ_CPMG_500_MHz_200.0', '15N_DQ_CPMG_500_MHz_267.0', '15N_DQ_CPMG_500_MHz_333.0', '15N_DQ_CPMG_500_MHz_400.0', '15N_DQ_CPMG_500_MHz_467.0', '15N_DQ_CPMG_500_MHz_533.0', '15N_DQ_CPMG_500_MHz_667.0', '15N_DQ_CPMG_500_MHz_800.0', '15N_DQ_CPMG_500_MHz_933.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  33.000000000000000      27.104299999999999       1.084170000000000    
  67.000000000000000      27.587949999999999       1.103520000000000    
 133.000000000000000      27.317550000000001       1.092700000000000    
 200.000000000000000      26.410509999999999       1.056420000000000    
 267.000000000000000      23.510310000000000       0.940410000000000    
 333.000000000000000      20.872920000000001       0.834920000000000    
 400.000000000000000      18.185780000000001       0.727430000000000    
 467.000000000000000      15.611430000000000       0.624460000000000    
 533.000000000000000      14.421640000000000       0.576870000000000    
 667.000000000000000      13.128579999999999       0.525140000000000    
 800.000000000000000      11.954210000000000       0.478170000000000    
 933.000000000000000      11.335550000000000       0.453420000000000    

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_33.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_33.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_33.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_33.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_33.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_67.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_67.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_67.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_67.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_133.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_133.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_133.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_133.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_200.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_200.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_200.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_200.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_200.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_267.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_267.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_267.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_267.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_333.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_333.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_333.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_333.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_333.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_400.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_400.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_400.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_400.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_467.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_467.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_467.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_467.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_467.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_533.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_533.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_533.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_533.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_667.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_667.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_667.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_667.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_800.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_800.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_800.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_800.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_933.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_933.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_933.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_933.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_600_MHz_1067.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_600_MHz_1067.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_600_MHz_1067.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_600_MHz_1067.0', time=0.03)
Setting the '15N_DQ_CPMG_600_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='15N_DQ_CPMG_600_MHz', spin_id=':9@N', file='dq_600.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../dq_600.res' for reading.
The spectrum ID '15N_DQ_CPMG_600_MHz_33.0' CPMG frequency is set to 33.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_333.0' CPMG frequency is set to 333.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_467.0' CPMG frequency is set to 467.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_DQ_CPMG_600_MHz_933.0' CPMG frequency is set to 933.0 Hz.
Using the experiment IDs ['15N_DQ_CPMG_600_MHz_33.0', '15N_DQ_CPMG_600_MHz_67.0', '15N_DQ_CPMG_600_MHz_133.0', '15N_DQ_CPMG_600_MHz_200.0', '15N_DQ_CPMG_600_MHz_267.0', '15N_DQ_CPMG_600_MHz_333.0', '15N_DQ_CPMG_600_MHz_400.0', '15N_DQ_CPMG_600_MHz_467.0', '15N_DQ_CPMG_600_MHz_533.0', '15N_DQ_CPMG_600_MHz_667.0', '15N_DQ_CPMG_600_MHz_800.0', '15N_DQ_CPMG_600_MHz_933.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  33.000000000000000      30.518010000000000       1.220720000000000    
  67.000000000000000      29.973810000000000       1.198950000000000    
 133.000000000000000      27.994190000000000       1.119770000000000    
 200.000000000000000      29.146000000000001       1.165840000000000    
 267.000000000000000      27.296410000000002       1.091860000000000    
 333.000000000000000      24.902320000000000       0.996090000000000    
 400.000000000000000      23.268409999999999       0.930740000000000    
 467.000000000000000      20.400410000000001       0.816020000000000    
 533.000000000000000      19.286020000000001       0.771440000000000    
 667.000000000000000      16.912520000000001       0.676500000000000    
 800.000000000000000      15.093780000000001       0.603750000000000    
 933.000000000000000      15.011820000000000       0.600470000000000    

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_33.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_33.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_33.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_33.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_33.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_67.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_67.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_67.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_67.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_133.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_133.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_133.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_133.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_200.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_200.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_200.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_200.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_200.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_267.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_267.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_267.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_267.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_333.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_333.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_333.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_333.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_333.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_400.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_400.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_400.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_400.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_467.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_467.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_467.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_467.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_467.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_533.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_533.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_533.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_533.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_667.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_667.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_667.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_667.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_800.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_800.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_800.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_800.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_933.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_933.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_933.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_933.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='15N_DQ_CPMG_800_MHz_1067.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_DQ_CPMG_800_MHz_1067.0', exp_type='DQ CPMG')
The spectrum ID '15N_DQ_CPMG_800_MHz_1067.0' is now set to the double quantum (DQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_DQ_CPMG_800_MHz_1067.0', time=0.03)
Setting the '15N_DQ_CPMG_800_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='15N_DQ_CPMG_800_MHz', spin_id=':9@N', file='dq_800.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../dq_800.res' for reading.
The spectrum ID '15N_DQ_CPMG_800_MHz_33.0' CPMG frequency is set to 33.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_333.0' CPMG frequency is set to 333.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_467.0' CPMG frequency is set to 467.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_933.0' CPMG frequency is set to 933.0 Hz.
The spectrum ID '15N_DQ_CPMG_800_MHz_1067.0' CPMG frequency is set to 1067.0 Hz.
Using the experiment IDs ['15N_DQ_CPMG_800_MHz_33.0', '15N_DQ_CPMG_800_MHz_67.0', '15N_DQ_CPMG_800_MHz_133.0', '15N_DQ_CPMG_800_MHz_200.0', '15N_DQ_CPMG_800_MHz_267.0', '15N_DQ_CPMG_800_MHz_333.0', '15N_DQ_CPMG_800_MHz_400.0', '15N_DQ_CPMG_800_MHz_467.0', '15N_DQ_CPMG_800_MHz_533.0', '15N_DQ_CPMG_800_MHz_667.0', '15N_DQ_CPMG_800_MHz_800.0', '15N_DQ_CPMG_800_MHz_933.0', '15N_DQ_CPMG_800_MHz_1067.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  33.000000000000000      32.726450000000000       1.309060000000000    
  67.000000000000000      32.877549999999999       1.315100000000000    
 133.000000000000000      32.375219999999999       1.295010000000000    
 200.000000000000000      32.328850000000003       1.293150000000000    
 267.000000000000000      32.690080000000002       1.307600000000000    
 333.000000000000000      32.120139999999999       1.284810000000000    
 400.000000000000000      29.519850000000002       1.180790000000000    
 467.000000000000000      26.846039999999999       1.073840000000000    
 533.000000000000000      23.902750000000001       0.956110000000000    
 667.000000000000000      21.671440000000000       0.866860000000000    
 800.000000000000000      19.742180000000001       0.789690000000000    
 933.000000000000000      18.136279999999999       0.725450000000000    
1067.000000000000000      17.008749999999999       0.680350000000000    

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_50.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_50.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_50.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_50.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_50.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_100.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_100.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_100.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_100.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_100.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_150.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_150.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_150.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_150.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_150.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_200.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_200.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_200.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_200.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_200.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_250.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_250.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_250.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_250.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_250.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_300.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_300.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_300.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_300.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_300.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_400.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_400.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_400.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_400.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_400.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_500.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_500.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_500.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_500.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_500.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_600.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_600.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_600.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_600.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_600.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_700.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_700.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_700.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_700.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_700.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_800.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_800.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_800.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_800.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_800.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_1000.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_1000.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_1000.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_1000.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_1000.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_1500.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_1500.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_1500.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_1500.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_1500.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_2000.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_2000.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_2000.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_2000.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_2000.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_500_MHz_2500.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_500_MHz_2500.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_500_MHz_2500.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_500_MHz_2500.0', time=0.02)
Setting the '1H_MQ_CPMG_500_MHz_2500.0' spectrum relaxation time period to 0.02 s.

relax> relax_disp.r2eff_read_spin(id='1H_MQ_CPMG_500_MHz', spin_id=':9@H', file='hm_500.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../hm_500.res' for reading.
The spectrum ID '1H_MQ_CPMG_500_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_1500.0' CPMG frequency is set to 1500.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_2000.0' CPMG frequency is set to 2000.0 Hz.
The spectrum ID '1H_MQ_CPMG_500_MHz_2500.0' CPMG frequency is set to 2500.0 Hz.
Using the experiment IDs ['1H_MQ_CPMG_500_MHz_50.0', '1H_MQ_CPMG_500_MHz_100.0', '1H_MQ_CPMG_500_MHz_150.0', '1H_MQ_CPMG_500_MHz_200.0', '1H_MQ_CPMG_500_MHz_250.0', '1H_MQ_CPMG_500_MHz_300.0', '1H_MQ_CPMG_500_MHz_400.0', '1H_MQ_CPMG_500_MHz_500.0', '1H_MQ_CPMG_500_MHz_600.0', '1H_MQ_CPMG_500_MHz_700.0', '1H_MQ_CPMG_500_MHz_800.0', '1H_MQ_CPMG_500_MHz_1000.0', '1H_MQ_CPMG_500_MHz_1500.0', '1H_MQ_CPMG_500_MHz_2000.0', '1H_MQ_CPMG_500_MHz_2500.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      23.789110000000001       0.497970000000000    
 100.000000000000000      23.712730000000001       0.474250000000000    
 150.000000000000000      24.828510000000001       0.508430000000000    
 200.000000000000000      25.550120000000000       0.515820000000000    
 250.000000000000000      25.707630000000002       0.517440000000000    
 300.000000000000000      26.856790000000000       0.537140000000000    
 400.000000000000000      27.464430000000000       0.549290000000000    
 500.000000000000000      26.959470000000000       0.539190000000000    
 600.000000000000000      26.575060000000001       0.531500000000000    
 700.000000000000000      26.431650000000001       0.528630000000000    
 800.000000000000000      26.007870000000000       0.520560000000000    
1000.000000000000000      26.892810000000001       0.537860000000000    
1500.000000000000000      26.589759999999998       0.531800000000000    
2000.000000000000000      26.542090000000002       0.530840000000000    
2500.000000000000000      26.700939999999999       0.534020000000000    

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_50.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_50.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_50.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_50.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_50.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_100.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_100.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_100.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_100.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_100.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_150.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_150.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_150.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_150.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_150.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_200.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_200.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_200.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_200.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_200.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_250.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_250.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_250.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_250.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_250.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_300.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_300.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_300.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_300.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_300.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_400.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_400.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_400.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_400.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_400.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_500.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_500.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_500.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_500.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_500.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_600.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_600.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_600.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_600.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_600.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_700.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_700.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_700.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_700.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_700.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_800.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_800.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_800.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_800.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_800.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_1000.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_1000.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_1000.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_1000.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_1000.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_1500.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_1500.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_1500.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_1500.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_1500.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_2000.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_2000.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_2000.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_2000.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_2000.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_600_MHz_2500.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_600_MHz_2500.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_600_MHz_2500.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_600_MHz_2500.0', time=0.02)
Setting the '1H_MQ_CPMG_600_MHz_2500.0' spectrum relaxation time period to 0.02 s.

relax> relax_disp.r2eff_read_spin(id='1H_MQ_CPMG_600_MHz', spin_id=':9@H', file='hm_600.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../hm_600.res' for reading.
The spectrum ID '1H_MQ_CPMG_600_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_1500.0' CPMG frequency is set to 1500.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_2000.0' CPMG frequency is set to 2000.0 Hz.
The spectrum ID '1H_MQ_CPMG_600_MHz_2500.0' CPMG frequency is set to 2500.0 Hz.
Using the experiment IDs ['1H_MQ_CPMG_600_MHz_50.0', '1H_MQ_CPMG_600_MHz_100.0', '1H_MQ_CPMG_600_MHz_150.0', '1H_MQ_CPMG_600_MHz_200.0', '1H_MQ_CPMG_600_MHz_250.0', '1H_MQ_CPMG_600_MHz_300.0', '1H_MQ_CPMG_600_MHz_400.0', '1H_MQ_CPMG_600_MHz_500.0', '1H_MQ_CPMG_600_MHz_600.0', '1H_MQ_CPMG_600_MHz_700.0', '1H_MQ_CPMG_600_MHz_800.0', '1H_MQ_CPMG_600_MHz_1000.0', '1H_MQ_CPMG_600_MHz_1500.0', '1H_MQ_CPMG_600_MHz_2000.0', '1H_MQ_CPMG_600_MHz_2500.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      25.197099999999999       0.503940000000000    
 100.000000000000000      25.035219999999999       0.500700000000000    
 150.000000000000000      26.422080000000001       0.528440000000000    
 200.000000000000000      26.312400000000000       0.526250000000000    
 250.000000000000000      25.991270000000000       0.519830000000000    
 300.000000000000000      27.013449999999999       0.540270000000000    
 400.000000000000000      28.196110000000001       0.563920000000000    
 500.000000000000000      27.954879999999999       0.559100000000000    
 600.000000000000000      27.718480000000000       0.554370000000000    
 700.000000000000000      28.194620000000000       0.563890000000000    
 800.000000000000000      27.638929999999998       0.552780000000000    
1000.000000000000000      28.139469999999999       0.562790000000000    
1500.000000000000000      27.250270000000000       0.545010000000000    
2000.000000000000000      28.322379999999999       0.566450000000000    
2500.000000000000000      27.652239999999999       0.553040000000000    

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_50.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_50.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_50.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_50.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_50.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_100.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_100.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_100.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_100.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_100.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_150.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_150.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_150.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_150.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_150.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_200.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_200.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_200.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_200.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_200.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_250.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_250.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_250.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_250.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_250.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_300.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_300.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_300.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_300.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_300.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_400.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_400.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_400.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_400.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_400.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_500.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_500.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_500.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_500.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_500.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_600.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_600.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_600.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_600.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_600.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_700.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_700.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_700.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_700.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_700.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_800.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_800.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_800.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_800.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_800.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_1000.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_1000.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_1000.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_1000.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_1000.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_1500.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_1500.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_1500.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_1500.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_1500.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_2000.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_2000.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_2000.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_2000.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_2000.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='1H_MQ_CPMG_800_MHz_2500.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='1H_MQ_CPMG_800_MHz_2500.0', exp_type='1H MQ CPMG')
The spectrum ID '1H_MQ_CPMG_800_MHz_2500.0' is now set to the 1H multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='1H_MQ_CPMG_800_MHz_2500.0', time=0.02)
Setting the '1H_MQ_CPMG_800_MHz_2500.0' spectrum relaxation time period to 0.02 s.

relax> relax_disp.r2eff_read_spin(id='1H_MQ_CPMG_800_MHz', spin_id=':9@H', file='hm_800.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../hm_800.res' for reading.
The spectrum ID '1H_MQ_CPMG_800_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_1500.0' CPMG frequency is set to 1500.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_2000.0' CPMG frequency is set to 2000.0 Hz.
The spectrum ID '1H_MQ_CPMG_800_MHz_2500.0' CPMG frequency is set to 2500.0 Hz.
Using the experiment IDs ['1H_MQ_CPMG_800_MHz_50.0', '1H_MQ_CPMG_800_MHz_100.0', '1H_MQ_CPMG_800_MHz_150.0', '1H_MQ_CPMG_800_MHz_200.0', '1H_MQ_CPMG_800_MHz_250.0', '1H_MQ_CPMG_800_MHz_300.0', '1H_MQ_CPMG_800_MHz_400.0', '1H_MQ_CPMG_800_MHz_500.0', '1H_MQ_CPMG_800_MHz_600.0', '1H_MQ_CPMG_800_MHz_700.0', '1H_MQ_CPMG_800_MHz_800.0', '1H_MQ_CPMG_800_MHz_1000.0', '1H_MQ_CPMG_800_MHz_1500.0', '1H_MQ_CPMG_800_MHz_2000.0', '1H_MQ_CPMG_800_MHz_2500.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      29.406079999999999       0.588120000000000    
 100.000000000000000      29.331720000000001       0.586630000000000    
 150.000000000000000      29.400469999999999       0.588010000000000    
 200.000000000000000      30.373410000000000       0.607470000000000    
 250.000000000000000      30.330600000000000       0.606610000000000    
 300.000000000000000      29.470160000000000       0.589400000000000    
 400.000000000000000      30.092800000000000       0.601860000000000    
 500.000000000000000      30.727670000000000       0.614550000000000    
 600.000000000000000      30.939150000000001       0.618780000000000    
 700.000000000000000      30.820720000000001       0.616410000000000    
 800.000000000000000      31.025720000000000       0.620510000000000    
1000.000000000000000      30.959330000000001       0.619190000000000    
1500.000000000000000      31.317010000000000       0.626340000000000    
2000.000000000000000      31.136920000000000       0.622740000000000    
2500.000000000000000      31.058509999999998       0.621170000000000    

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_50.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_50.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_50.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_50.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_50.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_100.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_100.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_100.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_100.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_100.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_150.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_150.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_150.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_150.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_150.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_200.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_200.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_200.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_200.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_200.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_250.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_250.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_250.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_250.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_250.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_300.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_300.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_300.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_300.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_300.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_350.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_350.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_350.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_350.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_350.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_400.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_400.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_400.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_400.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_400.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_500.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_500.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_500.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_500.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_500.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_600.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_600.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_600.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_600.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_600.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_700.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_700.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_700.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_700.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_700.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_800.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_800.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_800.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_800.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_800.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_900.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_900.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_900.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_900.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_900.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_500_MHz_1000.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_500_MHz_1000.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_500_MHz_1000.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_500_MHz_1000.0', time=0.02)
Setting the '15N_MQ_CPMG_500_MHz_1000.0' spectrum relaxation time period to 0.02 s.

relax> relax_disp.r2eff_read_spin(id='15N_MQ_CPMG_500_MHz', spin_id=':9@N', file='nm_500.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../nm_500.res' for reading.
The spectrum ID '15N_MQ_CPMG_500_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_MQ_CPMG_500_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_MQ_CPMG_500_MHz_50.0', '15N_MQ_CPMG_500_MHz_100.0', '15N_MQ_CPMG_500_MHz_150.0', '15N_MQ_CPMG_500_MHz_200.0', '15N_MQ_CPMG_500_MHz_250.0', '15N_MQ_CPMG_500_MHz_300.0', '15N_MQ_CPMG_500_MHz_350.0', '15N_MQ_CPMG_500_MHz_400.0', '15N_MQ_CPMG_500_MHz_500.0', '15N_MQ_CPMG_500_MHz_600.0', '15N_MQ_CPMG_500_MHz_700.0', '15N_MQ_CPMG_500_MHz_800.0', '15N_MQ_CPMG_500_MHz_900.0', '15N_MQ_CPMG_500_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      24.474489999999999       0.489490000000000    
 100.000000000000000      24.650729999999999       0.493010000000000    
 150.000000000000000      24.577890000000000       0.491560000000000    
 200.000000000000000      25.757269999999998       0.515150000000000    
 250.000000000000000      27.370590000000000       0.547410000000000    
 300.000000000000000      26.797409999999999       0.535950000000000    
 350.000000000000000      26.030830000000002       0.520620000000000    
 400.000000000000000      25.875470000000000       0.517510000000000    
 500.000000000000000      26.546930000000000       0.530940000000000    
 600.000000000000000      26.418040000000001       0.528360000000000    
 700.000000000000000      25.747380000000000       0.514950000000000    
 800.000000000000000      25.624600000000001       0.512490000000000    
 900.000000000000000      26.005949999999999       0.520120000000000    
1000.000000000000000      25.528030000000001       0.510560000000000    

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_50.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_50.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_50.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_50.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_50.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_100.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_100.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_100.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_100.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_100.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_150.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_150.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_150.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_150.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_150.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_200.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_200.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_200.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_200.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_200.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_250.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_250.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_250.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_250.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_250.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_300.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_300.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_300.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_300.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_300.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_350.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_350.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_350.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_350.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_350.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_400.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_400.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_400.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_400.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_400.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_500.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_500.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_500.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_500.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_500.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_600.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_600.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_600.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_600.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_600.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_700.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_700.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_700.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_700.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_700.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_800.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_800.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_800.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_800.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_800.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_900.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_900.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_900.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_900.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_900.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_600_MHz_1000.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_600_MHz_1000.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_600_MHz_1000.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_600_MHz_1000.0', time=0.02)
Setting the '15N_MQ_CPMG_600_MHz_1000.0' spectrum relaxation time period to 0.02 s.

relax> relax_disp.r2eff_read_spin(id='15N_MQ_CPMG_600_MHz', spin_id=':9@N', file='nm_600.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../nm_600.res' for reading.
The spectrum ID '15N_MQ_CPMG_600_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_MQ_CPMG_600_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_MQ_CPMG_600_MHz_50.0', '15N_MQ_CPMG_600_MHz_100.0', '15N_MQ_CPMG_600_MHz_150.0', '15N_MQ_CPMG_600_MHz_200.0', '15N_MQ_CPMG_600_MHz_250.0', '15N_MQ_CPMG_600_MHz_300.0', '15N_MQ_CPMG_600_MHz_350.0', '15N_MQ_CPMG_600_MHz_400.0', '15N_MQ_CPMG_600_MHz_500.0', '15N_MQ_CPMG_600_MHz_600.0', '15N_MQ_CPMG_600_MHz_700.0', '15N_MQ_CPMG_600_MHz_800.0', '15N_MQ_CPMG_600_MHz_900.0', '15N_MQ_CPMG_600_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      25.394420000000000       0.507890000000000    
 100.000000000000000      24.588310000000000       0.491770000000000    
 150.000000000000000      25.657830000000001       0.513160000000000    
 200.000000000000000      26.179710000000000       0.523590000000000    
 250.000000000000000      27.787469999999999       0.555750000000000    
 300.000000000000000      28.545069999999999       0.570900000000000    
 350.000000000000000      28.329730000000001       0.566590000000000    
 400.000000000000000      28.354820000000000       0.567100000000000    
 500.000000000000000      28.362089999999998       0.567240000000000    
 600.000000000000000      27.993089999999999       0.559860000000000    
 700.000000000000000      27.606150000000000       0.552120000000000    
 800.000000000000000      27.909379999999999       0.558190000000000    
 900.000000000000000      27.743770000000001       0.554880000000000    
1000.000000000000000      27.652970000000000       0.553060000000000    

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_50.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_50.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_50.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_50.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_50.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_100.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_100.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_100.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_100.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_100.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_150.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_150.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_150.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_150.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_150.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_200.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_200.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_200.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_200.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_200.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_250.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_250.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_250.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_250.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_250.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_300.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_300.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_300.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_300.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_300.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_350.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_350.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_350.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_350.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_350.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_400.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_400.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_400.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_400.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_400.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_500.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_500.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_500.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_500.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_500.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_600.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_600.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_600.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_600.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_600.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_700.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_700.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_700.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_700.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_700.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_800.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_800.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_800.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_800.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_800.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_900.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_900.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_900.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_900.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_900.0' spectrum relaxation time period to 0.02 s.

relax> spectrometer.frequency(id='15N_MQ_CPMG_800_MHz_1000.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_MQ_CPMG_800_MHz_1000.0', exp_type='MQ CPMG')
The spectrum ID '15N_MQ_CPMG_800_MHz_1000.0' is now set to the multiple quantum (MQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_MQ_CPMG_800_MHz_1000.0', time=0.02)
Setting the '15N_MQ_CPMG_800_MHz_1000.0' spectrum relaxation time period to 0.02 s.

relax> relax_disp.r2eff_read_spin(id='15N_MQ_CPMG_800_MHz', spin_id=':9@N', file='nm_800.res', dir='..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../nm_800.res' for reading.
The spectrum ID '15N_MQ_CPMG_800_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_MQ_CPMG_800_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_MQ_CPMG_800_MHz_50.0', '15N_MQ_CPMG_800_MHz_100.0', '15N_MQ_CPMG_800_MHz_150.0', '15N_MQ_CPMG_800_MHz_200.0', '15N_MQ_CPMG_800_MHz_250.0', '15N_MQ_CPMG_800_MHz_300.0', '15N_MQ_CPMG_800_MHz_350.0', '15N_MQ_CPMG_800_MHz_400.0', '15N_MQ_CPMG_800_MHz_500.0', '15N_MQ_CPMG_800_MHz_600.0', '15N_MQ_CPMG_800_MHz_700.0', '15N_MQ_CPMG_800_MHz_800.0', '15N_MQ_CPMG_800_MHz_900.0', '15N_MQ_CPMG_800_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      29.957480000000000       0.599150000000000    
 100.000000000000000      29.591799999999999       0.591840000000000    
 150.000000000000000      29.099399999999999       0.581990000000000    
 200.000000000000000      28.687690000000000       0.573750000000000    
 250.000000000000000      28.848030000000001       0.576960000000000    
 300.000000000000000      30.061170000000001       0.601220000000000    
 350.000000000000000      30.651360000000000       0.613030000000000    
 400.000000000000000      31.309760000000001       0.626200000000000    
 500.000000000000000      31.353290000000001       0.627070000000000    
 600.000000000000000      30.993739999999999       0.619870000000000    
 700.000000000000000      31.109230000000000       0.622180000000000    
 800.000000000000000      30.881589999999999       0.617630000000000    
 900.000000000000000      31.037009999999999       0.620740000000000    
1000.000000000000000      30.837470000000000       0.616750000000000    

relax> relax_disp.select_model(model='MQ CR72')
The Carver and Richards (1972) 2-site model for all time scales expanded for MQ CPMG data by Korzhnev et al., 2004.

relax> calc(verbosity=1)

relax> relax_disp.plot_disp_curves(dir='.', num_points=100, extend=0, force=True)
Opening the file './disp_9_N.agr' for writing.
RelaxWarning: divide by zero encountered in divide
Opening the file './grace2images.py' for writing.

relax> state.save(state='cpmg_fit_solution_cr72', dir='.', compress_type=1, force=True)
Opening the file './cpmg_fit_solution_cr72.bz2' for writing.


Moving 'disp_9_N.agr' to 'cpmg_fit_solution_cr72.agr'.
Deleting 'grace2images.py'.

