


                                  relax repository checkout r21622
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'optimise.py'
----------------------------------------------------------------------------------------------------
"""Optimise the SQ data in relax.

To run this, type:

$ rm -f optimise.log; ../../../../../../relax --tee optimise.log optimise.py
"""

# relax module imports.
from specific_analyses.relax_disp.disp_data import generate_r20_key
from specific_analyses.relax_disp.variables import EXP_TYPE_CPMG_DQ, EXP_TYPE_CPMG_MQ, EXP_TYPE_CPMG_PROTON_MQ, EXP_TYPE_CPMG_PROTON_SQ, EXP_TYPE_CPMG_SQ, EXP_TYPE_CPMG_ZQ


# Create a data pipe.
pipe.create('R2eff', 'relax_disp')

# Create the spin system.
spin.create(res_name='Asp', res_num=9, spin_name='H')
spin.create(res_name='Asp', res_num=9, spin_name='N')
spin.element('H', spin_id='@H')
spin.element('N', spin_id='@N')
spin.isotope('1H', spin_id='@H')
spin.isotope('15N', spin_id='@N')

# Define the magnetic dipole-dipole relaxation interaction.
interatom.define(spin_id1=':9@N', spin_id2=':9@H', direct_bond=True)

# The spectral data - experiment ID, R2eff file name, experiment type, spin ID string, spectrometer frequency in Hertz, relaxation time.
data = [
    ['ZQ_CPMG_500_MHz', 'zq_500.res', EXP_TYPE_CPMG_ZQ, ':9@N', 500e6, 0.03],
    ['ZQ_CPMG_600_MHz', 'zq_600.res', EXP_TYPE_CPMG_ZQ, ':9@N', 600e6, 0.03],
    ['ZQ_CPMG_800_MHz', 'zq_800.res', EXP_TYPE_CPMG_ZQ, ':9@N', 800e6, 0.03]
]
cpmg_frqs = [33.0, 67.0, 133.0, 200.0, 267.0, 333.0, 400.0, 467.0, 533.0, 667.0, 800.0, 933.0, 1067.0]

# Loop over the files, reading in the data.
for id, file, exp_type, spin_id, H_frq, relax_time in data:
    # Loop over each CPMG frequency.
    for cpmg_frq in cpmg_frqs:
        # The id.
        new_id = "%s_%s" % (id, cpmg_frq)

        # Set the NMR field strength.
        spectrometer.frequency(id=new_id, frq=H_frq)

        # Set the relaxation dispersion experiment type.
        relax_disp.exp_type(spectrum_id=new_id, exp_type=exp_type)

        # Relaxation dispersion CPMG constant time delay T (in s).
        relax_disp.relax_time(spectrum_id=new_id, time=relax_time)

    # Read the R2eff data.
    relax_disp.r2eff_read_spin(id=id, file=file, dir='../..', spin_id=spin_id, disp_point_col=1, data_col=2, error_col=3)

# Change the model.
relax_disp.select_model('MMQ 2-site')

# The R20 keys.
r20_key_sq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=500e6)
r20_key_sq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=600e6)
r20_key_sq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=800e6)
r20_key_1h_sq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=500e6)
r20_key_1h_sq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=600e6)
r20_key_1h_sq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=800e6)
r20_key_zq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=500e6)
r20_key_zq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=600e6)
r20_key_zq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=800e6)
r20_key_dq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=500e6)
r20_key_dq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=600e6)
r20_key_dq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=800e6)
r20_key_mq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=500e6)
r20_key_mq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=600e6)
r20_key_mq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=800e6)
r20_key_1h_mq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=500e6)
r20_key_1h_mq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=600e6)
r20_key_1h_mq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=800e6)

# Manually set the parameter values to the cpmg_fit results for all data.
spin = cdp.mol[0].res[0].spin[1]
spin.r2 = {
    r20_key_sq_500: 8.481132,
    r20_key_sq_600: 8.977845,
    r20_key_sq_800: 10.490257,
    r20_key_1h_sq_500: 6.778902,
    r20_key_1h_sq_600: 7.097458,
    r20_key_1h_sq_800: 5.635893,
    r20_key_zq_500: 6.043942,
    r20_key_zq_600: 6.827802,
    r20_key_zq_800: 6.946693,
    r20_key_dq_500: 8.693570,
    r20_key_dq_600: 10.744672,
    r20_key_dq_800: 12.647869,
    r20_key_mq_500: 9.245925,
    r20_key_mq_600: 9.949255,
    r20_key_mq_800: 12.053031,
    r20_key_1h_mq_500: 7.887264,
    r20_key_1h_mq_600: 8.506481,
    r20_key_1h_mq_800: 11.276893
}
spin.pA = 0.944322
spin.kex = 368.075
spin.dw = 4.413451
spin.dwH = -0.271799

# Optimisation.
minimise(min_algor='simplex')

# Monte Carlo simulations.
monte_carlo.setup(number=3)
monte_carlo.create_data(method='back_calc')
monte_carlo.initial_values()
minimise(min_algor='simplex', max_iter=100)
monte_carlo.error_analysis()

# Plot the dispersion curves.
relax_disp.plot_disp_curves(dir='.', force=True)

# Save the results.
state.save('state', compress_type=1, force=True)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='R2eff', pipe_type='relax_disp', bundle=None)

relax> spin.create(spin_name='H', spin_num=None, res_name='Asp', res_num=9, mol_name=None)

relax> spin.create(spin_name='N', spin_num=None, res_name='Asp', res_num=9, mol_name=None)

relax> spin.element(element='H', spin_id='@H', force=False)

relax> spin.element(element='N', spin_id='@N', force=False)

relax> spin.isotope(isotope='1H', spin_id='@H', force=False)

relax> spin.isotope(isotope='15N', spin_id='@N', force=False)

relax> interatom.define(spin_id1=':9@N', spin_id2=':9@H', direct_bond=True, pipe=None)
Interatomic interactions are now defined for the following spins:

# Spin_ID_1    Spin_ID_2    
':9@N'         ':9@H'       

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_33.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_33.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_33.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_33.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_33.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_67.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_67.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_67.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_67.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_133.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_133.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_133.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_133.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_200.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_200.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_200.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_200.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_200.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_267.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_267.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_267.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_267.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_333.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_333.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_333.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_333.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_333.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_400.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_400.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_400.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_400.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_467.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_467.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_467.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_467.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_467.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_533.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_533.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_533.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_533.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_667.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_667.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_667.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_667.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_800.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_800.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_800.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_800.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_933.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_933.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_933.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_933.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_500_MHz_1067.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_500_MHz_1067.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_500_MHz_1067.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_500_MHz_1067.0', time=0.03)
Setting the 'ZQ_CPMG_500_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='ZQ_CPMG_500_MHz', spin_id=':9@N', file='zq_500.res', dir='../..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../../zq_500.res' for reading.
The spectrum ID 'ZQ_CPMG_500_MHz_33.0' CPMG frequency is set to 33.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_333.0' CPMG frequency is set to 333.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_467.0' CPMG frequency is set to 467.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID 'ZQ_CPMG_500_MHz_933.0' CPMG frequency is set to 933.0 Hz.
Using the experiment IDs ['ZQ_CPMG_500_MHz_33.0', 'ZQ_CPMG_500_MHz_67.0', 'ZQ_CPMG_500_MHz_133.0', 'ZQ_CPMG_500_MHz_200.0', 'ZQ_CPMG_500_MHz_267.0', 'ZQ_CPMG_500_MHz_333.0', 'ZQ_CPMG_500_MHz_400.0', 'ZQ_CPMG_500_MHz_467.0', 'ZQ_CPMG_500_MHz_533.0', 'ZQ_CPMG_500_MHz_667.0', 'ZQ_CPMG_500_MHz_800.0', 'ZQ_CPMG_500_MHz_933.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  33.000000000000000      18.544770000000000       0.741790000000000    
  67.000000000000000      16.514669999999999       0.660590000000000    
 133.000000000000000      10.803490000000000       0.432140000000000    
 200.000000000000000       8.325419999999999       0.333020000000000    
 267.000000000000000       7.235040000000000       0.289400000000000    
 333.000000000000000       6.889130000000000       0.275570000000000    
 400.000000000000000       6.515130000000000       0.260610000000000    
 467.000000000000000       6.251600000000000       0.250060000000000    
 533.000000000000000       6.374040000000000       0.254960000000000    
 667.000000000000000       6.232320000000000       0.249290000000000    
 800.000000000000000       6.170270000000000       0.246810000000000    
 933.000000000000000       6.451310000000000       0.258050000000000    

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_33.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_33.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_33.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_33.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_33.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_67.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_67.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_67.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_67.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_133.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_133.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_133.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_133.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_200.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_200.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_200.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_200.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_200.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_267.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_267.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_267.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_267.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_333.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_333.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_333.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_333.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_333.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_400.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_400.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_400.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_400.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_467.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_467.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_467.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_467.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_467.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_533.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_533.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_533.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_533.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_667.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_667.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_667.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_667.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_800.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_800.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_800.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_800.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_933.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_933.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_933.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_933.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_600_MHz_1067.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_600_MHz_1067.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_600_MHz_1067.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_600_MHz_1067.0', time=0.03)
Setting the 'ZQ_CPMG_600_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='ZQ_CPMG_600_MHz', spin_id=':9@N', file='zq_600.res', dir='../..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../../zq_600.res' for reading.
The spectrum ID 'ZQ_CPMG_600_MHz_33.0' CPMG frequency is set to 33.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_333.0' CPMG frequency is set to 333.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_467.0' CPMG frequency is set to 467.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID 'ZQ_CPMG_600_MHz_933.0' CPMG frequency is set to 933.0 Hz.
Using the experiment IDs ['ZQ_CPMG_600_MHz_33.0', 'ZQ_CPMG_600_MHz_67.0', 'ZQ_CPMG_600_MHz_133.0', 'ZQ_CPMG_600_MHz_200.0', 'ZQ_CPMG_600_MHz_267.0', 'ZQ_CPMG_600_MHz_333.0', 'ZQ_CPMG_600_MHz_400.0', 'ZQ_CPMG_600_MHz_467.0', 'ZQ_CPMG_600_MHz_533.0', 'ZQ_CPMG_600_MHz_667.0', 'ZQ_CPMG_600_MHz_800.0', 'ZQ_CPMG_600_MHz_933.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  33.000000000000000      20.994479999999999       0.839780000000000    
  67.000000000000000      19.016130000000000       0.760650000000000    
 133.000000000000000      12.426330000000000       0.497230000000000    
 200.000000000000000      10.197270000000000       0.407890000000000    
 267.000000000000000       9.721399999999999       0.458480000000000    
 333.000000000000000       8.034940000000001       0.435860000000000    
 400.000000000000000       7.712380000000000       0.431660000000000    
 467.000000000000000       7.703030000000000       0.431540000000000    
 533.000000000000000       7.314080000000000       0.426530000000000    
 667.000000000000000       7.299390000000000       0.426350000000000    
 800.000000000000000       6.647380000000000       0.418090000000000    
 933.000000000000000       6.999720000000000       0.422530000000000    

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_33.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_33.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_33.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_33.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_33.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_67.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_67.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_67.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_67.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_67.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_133.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_133.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_133.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_133.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_133.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_200.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_200.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_200.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_200.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_200.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_267.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_267.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_267.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_267.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_267.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_333.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_333.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_333.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_333.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_333.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_400.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_400.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_400.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_400.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_400.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_467.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_467.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_467.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_467.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_467.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_533.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_533.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_533.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_533.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_533.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_667.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_667.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_667.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_667.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_667.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_800.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_800.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_800.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_800.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_800.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_933.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_933.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_933.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_933.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_933.0' spectrum relaxation time period to 0.03 s.

relax> spectrometer.frequency(id='ZQ_CPMG_800_MHz_1067.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='ZQ_CPMG_800_MHz_1067.0', exp_type='ZQ CPMG')
The spectrum ID 'ZQ_CPMG_800_MHz_1067.0' is now set to the zero quantum (ZQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='ZQ_CPMG_800_MHz_1067.0', time=0.03)
Setting the 'ZQ_CPMG_800_MHz_1067.0' spectrum relaxation time period to 0.03 s.

relax> relax_disp.r2eff_read_spin(id='ZQ_CPMG_800_MHz', spin_id=':9@N', file='zq_800.res', dir='../..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../../zq_800.res' for reading.
The spectrum ID 'ZQ_CPMG_800_MHz_33.0' CPMG frequency is set to 33.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_67.0' CPMG frequency is set to 67.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_133.0' CPMG frequency is set to 133.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_267.0' CPMG frequency is set to 267.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_333.0' CPMG frequency is set to 333.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_467.0' CPMG frequency is set to 467.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_533.0' CPMG frequency is set to 533.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_667.0' CPMG frequency is set to 667.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_933.0' CPMG frequency is set to 933.0 Hz.
The spectrum ID 'ZQ_CPMG_800_MHz_1067.0' CPMG frequency is set to 1067.0 Hz.
Using the experiment IDs ['ZQ_CPMG_800_MHz_33.0', 'ZQ_CPMG_800_MHz_67.0', 'ZQ_CPMG_800_MHz_133.0', 'ZQ_CPMG_800_MHz_200.0', 'ZQ_CPMG_800_MHz_267.0', 'ZQ_CPMG_800_MHz_333.0', 'ZQ_CPMG_800_MHz_400.0', 'ZQ_CPMG_800_MHz_467.0', 'ZQ_CPMG_800_MHz_533.0', 'ZQ_CPMG_800_MHz_667.0', 'ZQ_CPMG_800_MHz_800.0', 'ZQ_CPMG_800_MHz_933.0', 'ZQ_CPMG_800_MHz_1067.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  33.000000000000000      24.098389999999998       0.963940000000000    
  67.000000000000000      22.581070000000000       0.903240000000000    
 133.000000000000000      17.796029999999998       0.711840000000000    
 200.000000000000000      13.554140000000000       0.542170000000000    
 267.000000000000000      10.998480000000001       0.439940000000000    
 333.000000000000000       9.698230000000001       0.387930000000000    
 400.000000000000000       8.615190000000000       0.344610000000000    
 467.000000000000000       8.060570000000000       0.322420000000000    
 533.000000000000000       7.483890000000000       0.299360000000000    
 667.000000000000000       7.946680000000000       0.317870000000000    
 800.000000000000000       7.211550000000000       0.288460000000000    
 933.000000000000000       6.728530000000000       0.269140000000000    
1067.000000000000000       7.019760000000000       0.280790000000000    

relax> relax_disp.select_model(model='MMQ 2-site')
The reduced numerical solution for the 2-site Bloch-McConnell equations for MQ CPMG data using 3D magnetisation vectors, whereby the simplification R20A = R20B is assumed.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':9@N']
----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [      0.6043942,       0.6827802,       0.6946693,        4.413451,       -0.271799,        0.944322,       0.0368075]    fk: 28.911790814        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [      0.6043942,       0.6827802,       0.6946693,        4.413451,       -0.271799,        0.944322,       0.0368075]    fk: 28.8524538327       
	k: 100      xk: [   0.5907288598,    0.6655417537,    0.6783262629,     4.450372289,   -0.2773523226,    0.9426445503,   0.03770458802]    fk: 23.8036607768       
	k: 200      xk: [   0.5907291406,    0.6655428867,    0.6783257095,     4.450371937,   -0.2773522058,    0.9426446287,   0.03770462313]    fk: 23.8027129777       
	k: 300      xk: [   0.5907291418,    0.6655428896,    0.6783257083,     4.450371938,   -0.2773522058,    0.9426446288,   0.03770462313]    fk: 23.8027129764       

	Parameter values: [0.59072914178808744, 0.66554288954846264, 0.67832570831507, 4.4503719377000417, -0.2773522058442352, 0.9426446287726773, 0.0377046231264304]
	Function value:   23.802712976444642
	Iterations:       346
	Function calls:   763
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 1        xk: [   0.5907291418,    0.6655428895,    0.6783257083,     4.450371938,   -0.2773522058,    0.9426446288,   0.03770462313]    fk: 23.8618516669       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5907291418,    0.6655428895,    0.6783257083,     4.450371938,   -0.2773522058,    0.9426446288,   0.03770462313]    fk: 23.86126028         
	k: 100      xk: [   0.5907291418,    0.6655428895,    0.6783257083,     4.450371938,   -0.2773522058,    0.9426446288,   0.03770462313]    fk: 23.86126028         
	k: 200      xk: [   0.5907294184,    0.6655424474,    0.6783257024,     4.450373486,   -0.2773525175,     0.942644615,   0.03770462333]    fk: 23.8602272304       
	k: 300      xk: [   0.5907294235,    0.6655424442,    0.6783257097,     4.450373499,   -0.2773525198,    0.9426446155,   0.03770462336]    fk: 23.8602272188       
	k: 400      xk: [   0.5907294236,    0.6655424442,    0.6783257098,     4.450373499,   -0.2773525198,    0.9426446155,   0.03770462336]    fk: 23.8602272186       

	Parameter values: [0.59072942357978819, 0.6655424442248129, 0.67832570980925455, 4.4503734989558037, -0.27735251982341558, 0.94264461545683498, 0.037704623360109546]
	Function value:   23.860227218598268
	Iterations:       474
	Function calls:   959
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [   0.5907294236,    0.6655424442,    0.6783257098,     4.450373499,   -0.2773525198,    0.9426446155,   0.03770462336]    fk: 23.8608186055       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5907294236,    0.6655424442,    0.6783257098,     4.450373499,   -0.2773525198,    0.9426446155,   0.03770462336]    fk: 23.8608126916       
	k: 100      xk: [   0.5907884918,    0.6657718722,    0.6783976195,     4.449618833,   -0.2772786732,    0.9425970552,   0.03763338572]    fk: 23.8584801895       
	k: 200      xk: [   0.5907885382,    0.6657717689,    0.6783974907,     4.449619741,   -0.2772787029,     0.942597101,   0.03763341422]    fk: 23.8566527879       
	k: 300      xk: [    0.590788538,    0.6657717649,    0.6783974906,      4.44961976,   -0.2772787046,    0.9425971013,   0.03763341439]    fk: 23.8566527775       
	k: 400      xk: [   0.5907885386,    0.6657717667,    0.6783974904,     4.449619746,   -0.2772787029,    0.9425971014,   0.03763341438]    fk: 23.8566527766       

	Parameter values: [0.59078853864005132, 0.66577176660926907, 0.67839749035888275, 4.4496197470459187, -0.27727870295905377, 0.94259710136379482, 0.037633414377133162]
	Function value:   23.856652776487802
	Iterations:       500
	Function calls:   963
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 3        xk: [   0.5907885386,    0.6657717666,    0.6783974904,     4.449619747,    -0.277278703,    0.9425971014,   0.03763341438]    fk: 23.8566586897       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5907885386,    0.6657717666,    0.6783974904,     4.449619747,    -0.277278703,    0.9425971014,   0.03763341438]    fk: 23.8566586306       
	k: 100      xk: [   0.5907885386,    0.6657717666,    0.6783974904,     4.449619747,    -0.277278703,    0.9425971014,   0.03763341438]    fk: 23.8566586306       
	k: 200      xk: [   0.5907887746,    0.6657722328,     0.678397051,     4.449623456,   -0.2772789763,    0.9425970781,   0.03763342289]    fk: 23.8564770627       
	k: 300      xk: [   0.5907887694,    0.6657722349,    0.6783970978,     4.449623505,   -0.2772789829,    0.9425970793,   0.03763342285]    fk: 23.8564770261       
	k: 400      xk: [   0.5907887635,    0.6657722372,    0.6783971512,     4.449623561,   -0.2772789905,    0.9425970806,   0.03763342279]    fk: 23.856474456        

	Parameter values: [0.59078876551280723, 0.66577224919010369, 0.67839718505480318, 4.4496236349071534, -0.27727899790846933, 0.94259708129694275, 0.037633422752261725]
	Function value:   23.856474434960113
	Iterations:       500
	Function calls:   930
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 4        xk: [   0.5907887655,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.8564744957       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5907887655,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.8564744935       
	k: 100      xk: [   0.5907887655,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.8564744935       
	k: 200      xk: [   0.5907887655,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.8564744934       
	k: 300      xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.8564744934       

	Parameter values: [0.59078876541926006, 0.66577224921232891, 0.67839718506765356, 4.4496236352489396, -0.27727899793494382, 0.94259708130093511, 0.037633422754293974]
	Function value:   23.856474493377323
	Iterations:       322
	Function calls:   802
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 5        xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
	k: 100      xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
	k: 200      xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        

	Parameter values: [0.59078876541926562, 0.6657722492124003, 0.67839718506767399, 4.4496236352491838, -0.2772789979349668, 0.94259708130093933, 0.037633422754296091]
	Function value:   23.856474493962622
	Iterations:       205
	Function calls:   613
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 6        xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
	k: 100      xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
	k: 200      xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        

	Parameter values: [0.59078876541926562, 0.6657722492124003, 0.67839718506767399, 4.4496236352491838, -0.2772789979349668, 0.94259708130093933, 0.037633422754296091]
	Function value:   23.856474493968481
	Iterations:       208
	Function calls:   621
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 7        xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
	k: 100      xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
	k: 200      xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        

	Parameter values: [0.59078876541926562, 0.6657722492124003, 0.67839718506767399, 4.4496236352491838, -0.2772789979349668, 0.94259708130093933, 0.037633422754296091]
	Function value:   23.856474493968541
	Iterations:       208
	Function calls:   621
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 8        xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
	k: 100      xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        
	k: 200      xk: [   0.5907887654,    0.6657722492,    0.6783971851,     4.449623635,   -0.2772789979,    0.9425970813,   0.03763342275]    fk: 23.856474494        

	Parameter values: [0.59078876541926562, 0.6657722492124003, 0.67839718506767399, 4.4496236352491838, -0.2772789979349668, 0.94259708130093933, 0.037633422754296091]
	Function value:   23.856474493968541
	Iterations:       208
	Function calls:   621
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.


Parameter values: [0.59078876541926562, 0.6657722492124003, 0.67839718506767399, 4.4496236352491838, -0.2772789979349668, 0.94259708130093933, 0.037633422754296091]
Function value:   23.856474493968541
Iterations:       2971
Function calls:   6893
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (ZQ CPMG - 500.00000000 MHz)         5.907887654192656
r2 (ZQ CPMG - 600.00000000 MHz)         6.657722492124003
r2 (ZQ CPMG - 800.00000000 MHz)         6.783971850676740
dw                           4.449623635249184
dwH                         -0.277278997934967
pA                           0.942597081300939
kex                        376.334227542960889

relax> monte_carlo.setup(number=3)

relax> monte_carlo.create_data(method='back_calc')

relax> monte_carlo.initial_values()

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=100, constraints=True, scaling=True, verbosity=1)
Simulation 1, cluster [':9@N']
Simulation 2, cluster [':9@N']
Simulation 3, cluster [':9@N']

relax> monte_carlo.error_analysis()

relax> relax_disp.plot_disp_curves(dir='.', num_points=1000, extend=500.0, force=True)
Opening the file './disp_9_N.agr' for writing.
RelaxWarning: divide by zero encountered in divide
Opening the file './grace2images.py' for writing.

relax> state.save(state='state', dir=None, compress_type=1, force=True)
Opening the file 'state.bz2' for writing.

