


                                  relax repository checkout r21622
                     svn+ssh://bugman@svn.gna.org/svn/relax/branches/relax_disp

                              Molecular dynamics by NMR data analysis

                             Copyright (C) 2001-2006 Edward d'Auvergne
                         Copyright (C) 2006-2013 the relax development team

This is free software which you are welcome to modify and redistribute under the conditions of the
GNU General Public License (GPL).  This program, including all modules, is licensed under the GPL
and comes with absolutely no warranty.  For details type 'GPL' within the relax prompt.

Assistance in using the relax prompt and scripting interface can be accessed by typing 'help' within
the prompt.

Processor fabric:  Uni-processor.

script = 'optimise.py'
----------------------------------------------------------------------------------------------------
"""Optimise the SQ data in relax.

To run this, type:

$ rm -f optimise.log; ../../../../../../relax --tee optimise.log optimise.py
"""

# relax module imports.
from specific_analyses.relax_disp.disp_data import generate_r20_key
from specific_analyses.relax_disp.variables import EXP_TYPE_CPMG_DQ, EXP_TYPE_CPMG_MQ, EXP_TYPE_CPMG_PROTON_MQ, EXP_TYPE_CPMG_PROTON_SQ, EXP_TYPE_CPMG_SQ, EXP_TYPE_CPMG_ZQ


# Create a data pipe.
pipe.create('R2eff', 'relax_disp')

# Create the spin system.
spin.create(res_name='Asp', res_num=9, spin_name='H')
spin.create(res_name='Asp', res_num=9, spin_name='N')
spin.element('H', spin_id='@H')
spin.element('N', spin_id='@N')
spin.isotope('1H', spin_id='@H')
spin.isotope('15N', spin_id='@N')

# Define the magnetic dipole-dipole relaxation interaction.
interatom.define(spin_id1=':9@N', spin_id2=':9@H', direct_bond=True)

# The spectral data - experiment ID, R2eff file name, experiment type, spin ID string, spectrometer frequency in Hertz, relaxation time.
data = [
    ['15N_CPMG_500_MHz', 'ns_500.res', EXP_TYPE_CPMG_SQ, ':9@N', 500e6, 0.04],
    ['15N_CPMG_600_MHz', 'ns_600.res', EXP_TYPE_CPMG_SQ, ':9@N', 600e6, 0.04],
    ['15N_CPMG_800_MHz', 'ns_800.res', EXP_TYPE_CPMG_SQ, ':9@N', 800e6, 0.04]
]
cpmg_frqs = [50.0, 100.0, 150.0, 200.0, 250.0, 300.0, 350.0, 400.0, 450.0, 500.0, 600.0, 700.0, 800.0, 900.0, 1000.0]

# Loop over the files, reading in the data.
for id, file, exp_type, spin_id, H_frq, relax_time in data:
    # Loop over each CPMG frequency.
    for cpmg_frq in cpmg_frqs:
        # The id.
        new_id = "%s_%s" % (id, cpmg_frq)

        # Set the NMR field strength.
        spectrometer.frequency(id=new_id, frq=H_frq)

        # Set the relaxation dispersion experiment type.
        relax_disp.exp_type(spectrum_id=new_id, exp_type=exp_type)

        # Relaxation dispersion CPMG constant time delay T (in s).
        relax_disp.relax_time(spectrum_id=new_id, time=relax_time)

    # Read the R2eff data.
    relax_disp.r2eff_read_spin(id=id, file=file, dir='../..', spin_id=spin_id, disp_point_col=1, data_col=2, error_col=3)

# Change the model.
relax_disp.select_model('MMQ 2-site')

# The R20 keys.
r20_key_sq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=500e6)
r20_key_sq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=600e6)
r20_key_sq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_SQ, frq=800e6)
r20_key_1h_sq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=500e6)
r20_key_1h_sq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=600e6)
r20_key_1h_sq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_SQ, frq=800e6)
r20_key_zq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=500e6)
r20_key_zq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=600e6)
r20_key_zq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_ZQ, frq=800e6)
r20_key_dq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=500e6)
r20_key_dq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=600e6)
r20_key_dq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_DQ, frq=800e6)
r20_key_mq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=500e6)
r20_key_mq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=600e6)
r20_key_mq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_MQ, frq=800e6)
r20_key_1h_mq_500 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=500e6)
r20_key_1h_mq_600 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=600e6)
r20_key_1h_mq_800 = generate_r20_key(exp_type=EXP_TYPE_CPMG_PROTON_MQ, frq=800e6)

# Manually set the parameter values to the cpmg_fit results for all data.
spin = cdp.mol[0].res[0].spin[1]
spin.r2 = {
    r20_key_sq_500: 8.481132,
    r20_key_sq_600: 8.977845,
    r20_key_sq_800: 10.490257,
    r20_key_1h_sq_500: 6.778902,
    r20_key_1h_sq_600: 7.097458,
    r20_key_1h_sq_800: 5.635893,
    r20_key_zq_500: 6.043942,
    r20_key_zq_600: 6.827802,
    r20_key_zq_800: 6.946693,
    r20_key_dq_500: 8.693570,
    r20_key_dq_600: 10.744672,
    r20_key_dq_800: 12.647869,
    r20_key_mq_500: 9.245925,
    r20_key_mq_600: 9.949255,
    r20_key_mq_800: 12.053031,
    r20_key_1h_mq_500: 7.887264,
    r20_key_1h_mq_600: 8.506481,
    r20_key_1h_mq_800: 11.276893
}
spin.pA = 0.944322
spin.kex = 368.075
spin.dw = 4.413451
spin.dwH = -0.271799

# Optimisation.
minimise(min_algor='simplex')

# Monte Carlo simulations.
monte_carlo.setup(number=3)
monte_carlo.create_data(method='back_calc')
monte_carlo.initial_values()
minimise(min_algor='simplex', max_iter=100)
monte_carlo.error_analysis()

# Plot the dispersion curves.
relax_disp.plot_disp_curves(dir='.', force=True)

# Save the results.
state.save('state', compress_type=1, force=True)
----------------------------------------------------------------------------------------------------

relax> pipe.create(pipe_name='R2eff', pipe_type='relax_disp', bundle=None)

relax> spin.create(spin_name='H', spin_num=None, res_name='Asp', res_num=9, mol_name=None)

relax> spin.create(spin_name='N', spin_num=None, res_name='Asp', res_num=9, mol_name=None)

relax> spin.element(element='H', spin_id='@H', force=False)

relax> spin.element(element='N', spin_id='@N', force=False)

relax> spin.isotope(isotope='1H', spin_id='@H', force=False)

relax> spin.isotope(isotope='15N', spin_id='@N', force=False)

relax> interatom.define(spin_id1=':9@N', spin_id2=':9@H', direct_bond=True, pipe=None)
Interatomic interactions are now defined for the following spins:

# Spin_ID_1    Spin_ID_2    
':9@N'         ':9@H'       

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_50.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_50.0', time=0.04)
Setting the '15N_CPMG_500_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_100.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_100.0', time=0.04)
Setting the '15N_CPMG_500_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_150.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_150.0', time=0.04)
Setting the '15N_CPMG_500_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_200.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_200.0', time=0.04)
Setting the '15N_CPMG_500_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_250.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_250.0', time=0.04)
Setting the '15N_CPMG_500_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_300.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_300.0', time=0.04)
Setting the '15N_CPMG_500_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_350.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_350.0', time=0.04)
Setting the '15N_CPMG_500_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_400.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_400.0', time=0.04)
Setting the '15N_CPMG_500_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_450.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_450.0', time=0.04)
Setting the '15N_CPMG_500_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_500.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_500.0', time=0.04)
Setting the '15N_CPMG_500_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_600.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_600.0', time=0.04)
Setting the '15N_CPMG_500_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_700.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_700.0', time=0.04)
Setting the '15N_CPMG_500_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_800.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_800.0', time=0.04)
Setting the '15N_CPMG_500_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_900.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_900.0', time=0.04)
Setting the '15N_CPMG_500_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_500_MHz_1000.0', frq=500000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_500_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_500_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_500_MHz_1000.0', time=0.04)
Setting the '15N_CPMG_500_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_CPMG_500_MHz', spin_id=':9@N', file='ns_500.res', dir='../..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../../ns_500.res' for reading.
The spectrum ID '15N_CPMG_500_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_CPMG_500_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_CPMG_500_MHz_50.0', '15N_CPMG_500_MHz_100.0', '15N_CPMG_500_MHz_150.0', '15N_CPMG_500_MHz_200.0', '15N_CPMG_500_MHz_250.0', '15N_CPMG_500_MHz_300.0', '15N_CPMG_500_MHz_350.0', '15N_CPMG_500_MHz_400.0', '15N_CPMG_500_MHz_500.0', '15N_CPMG_500_MHz_600.0', '15N_CPMG_500_MHz_700.0', '15N_CPMG_500_MHz_800.0', '15N_CPMG_500_MHz_900.0', '15N_CPMG_500_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      27.157670000000000       0.543150000000000    
 100.000000000000000      26.557810000000000       0.531160000000000    
 150.000000000000000      24.734620000000000       0.494690000000000    
 200.000000000000000      20.986170000000001       0.419720000000000    
 250.000000000000000      17.824420000000000       0.356490000000000    
 300.000000000000000      15.553520000000001       0.311070000000000    
 350.000000000000000      13.789580000000001       0.275790000000000    
 400.000000000000000      12.483340000000000       0.249670000000000    
 500.000000000000000      11.557240000000000       0.231140000000000    
 600.000000000000000      10.538740000000001       0.210770000000000    
 700.000000000000000      10.073950000000000       0.201480000000000    
 800.000000000000000       9.629519999999999       0.192590000000000    
 900.000000000000000       9.499940000000000       0.190000000000000    
1000.000000000000000       8.713500000000000       0.174270000000000    

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_50.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_50.0', time=0.04)
Setting the '15N_CPMG_600_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_100.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_100.0', time=0.04)
Setting the '15N_CPMG_600_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_150.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_150.0', time=0.04)
Setting the '15N_CPMG_600_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_200.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_200.0', time=0.04)
Setting the '15N_CPMG_600_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_250.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_250.0', time=0.04)
Setting the '15N_CPMG_600_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_300.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_300.0', time=0.04)
Setting the '15N_CPMG_600_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_350.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_350.0', time=0.04)
Setting the '15N_CPMG_600_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_400.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_400.0', time=0.04)
Setting the '15N_CPMG_600_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_450.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_450.0', time=0.04)
Setting the '15N_CPMG_600_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_500.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_500.0', time=0.04)
Setting the '15N_CPMG_600_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_600.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_600.0', time=0.04)
Setting the '15N_CPMG_600_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_700.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_700.0', time=0.04)
Setting the '15N_CPMG_600_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_800.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_800.0', time=0.04)
Setting the '15N_CPMG_600_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_900.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_900.0', time=0.04)
Setting the '15N_CPMG_600_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_600_MHz_1000.0', frq=600000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_600_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_600_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_600_MHz_1000.0', time=0.04)
Setting the '15N_CPMG_600_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_CPMG_600_MHz', spin_id=':9@N', file='ns_600.res', dir='../..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../../ns_600.res' for reading.
The spectrum ID '15N_CPMG_600_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_CPMG_600_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_CPMG_600_MHz_50.0', '15N_CPMG_600_MHz_100.0', '15N_CPMG_600_MHz_150.0', '15N_CPMG_600_MHz_200.0', '15N_CPMG_600_MHz_250.0', '15N_CPMG_600_MHz_300.0', '15N_CPMG_600_MHz_350.0', '15N_CPMG_600_MHz_400.0', '15N_CPMG_600_MHz_500.0', '15N_CPMG_600_MHz_600.0', '15N_CPMG_600_MHz_800.0', '15N_CPMG_600_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      28.712740000000000       0.574250000000000    
 100.000000000000000      28.156870000000001       0.648350000000000    
 150.000000000000000      27.460400000000000       0.630540000000000    
 200.000000000000000      24.311219999999999       0.555910000000000    
 250.000000000000000      21.550129999999999       0.497780000000000    
 300.000000000000000      18.737749999999998       0.444820000000000    
 350.000000000000000      16.154080000000000       0.401140000000000    
 400.000000000000000      14.696420000000000       0.378420000000000    
 500.000000000000000      13.146250000000000       0.262930000000000    
 600.000000000000000      11.594429999999999       0.334260000000000    
 800.000000000000000      10.244870000000001       0.316700000000000    
1000.000000000000000       9.741450000000000       0.310380000000000    

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_50.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_50.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_50.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_50.0', time=0.04)
Setting the '15N_CPMG_800_MHz_50.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_100.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_100.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_100.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_100.0', time=0.04)
Setting the '15N_CPMG_800_MHz_100.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_150.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_150.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_150.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_150.0', time=0.04)
Setting the '15N_CPMG_800_MHz_150.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_200.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_200.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_200.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_200.0', time=0.04)
Setting the '15N_CPMG_800_MHz_200.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_250.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_250.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_250.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_250.0', time=0.04)
Setting the '15N_CPMG_800_MHz_250.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_300.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_300.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_300.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_300.0', time=0.04)
Setting the '15N_CPMG_800_MHz_300.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_350.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_350.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_350.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_350.0', time=0.04)
Setting the '15N_CPMG_800_MHz_350.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_400.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_400.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_400.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_400.0', time=0.04)
Setting the '15N_CPMG_800_MHz_400.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_450.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_450.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_450.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_450.0', time=0.04)
Setting the '15N_CPMG_800_MHz_450.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_500.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_500.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_500.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_500.0', time=0.04)
Setting the '15N_CPMG_800_MHz_500.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_600.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_600.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_600.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_600.0', time=0.04)
Setting the '15N_CPMG_800_MHz_600.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_700.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_700.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_700.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_700.0', time=0.04)
Setting the '15N_CPMG_800_MHz_700.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_800.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_800.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_800.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_800.0', time=0.04)
Setting the '15N_CPMG_800_MHz_800.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_900.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_900.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_900.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_900.0', time=0.04)
Setting the '15N_CPMG_800_MHz_900.0' spectrum relaxation time period to 0.04 s.

relax> spectrometer.frequency(id='15N_CPMG_800_MHz_1000.0', frq=800000000.0, units='Hz')
RelaxWarning: The precise spectrometer frequency should be suppled, a value such as 500000000 or 5e8 for a 500 MHz machine is not acceptable.  Please see the 'sfrq' parameter in the Varian procpar file or the 'SFO1' parameter in the Bruker acqus file.

relax> relax_disp.exp_type(spectrum_id='15N_CPMG_800_MHz_1000.0', exp_type='SQ CPMG')
The spectrum ID '15N_CPMG_800_MHz_1000.0' is now set to the standard single quantum (SQ) CPMG-type experiment.

relax> relax_disp.relax_time(spectrum_id='15N_CPMG_800_MHz_1000.0', time=0.04)
Setting the '15N_CPMG_800_MHz_1000.0' spectrum relaxation time period to 0.04 s.

relax> relax_disp.r2eff_read_spin(id='15N_CPMG_800_MHz', spin_id=':9@N', file='ns_800.res', dir='../..', disp_point_col=1, data_col=2, error_col=3, sep=None)
Opening the file '../../ns_800.res' for reading.
The spectrum ID '15N_CPMG_800_MHz_50.0' CPMG frequency is set to 50.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_100.0' CPMG frequency is set to 100.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_150.0' CPMG frequency is set to 150.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_200.0' CPMG frequency is set to 200.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_250.0' CPMG frequency is set to 250.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_300.0' CPMG frequency is set to 300.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_350.0' CPMG frequency is set to 350.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_400.0' CPMG frequency is set to 400.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_450.0' CPMG frequency is set to 450.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_500.0' CPMG frequency is set to 500.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_600.0' CPMG frequency is set to 600.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_700.0' CPMG frequency is set to 700.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_800.0' CPMG frequency is set to 800.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_900.0' CPMG frequency is set to 900.0 Hz.
The spectrum ID '15N_CPMG_800_MHz_1000.0' CPMG frequency is set to 1000.0 Hz.
Using the experiment IDs ['15N_CPMG_800_MHz_50.0', '15N_CPMG_800_MHz_100.0', '15N_CPMG_800_MHz_150.0', '15N_CPMG_800_MHz_200.0', '15N_CPMG_800_MHz_250.0', '15N_CPMG_800_MHz_300.0', '15N_CPMG_800_MHz_350.0', '15N_CPMG_800_MHz_400.0', '15N_CPMG_800_MHz_450.0', '15N_CPMG_800_MHz_500.0', '15N_CPMG_800_MHz_600.0', '15N_CPMG_800_MHz_700.0', '15N_CPMG_800_MHz_800.0', '15N_CPMG_800_MHz_900.0', '15N_CPMG_800_MHz_1000.0'].
The following R2eff/R1rho data has been loaded into the relax data store:

# Disp_point            R2eff                   R2eff_error             
  50.000000000000000      30.671690000000002       0.613430000000000    
 100.000000000000000      30.627970000000001       0.612560000000000    
 150.000000000000000      29.828849999999999       0.596580000000000    
 200.000000000000000      29.389659999999999       0.587790000000000    
 250.000000000000000      27.570190000000000       0.551400000000000    
 300.000000000000000      24.543270000000000       0.490870000000000    
 350.000000000000000      22.107839999999999       0.442160000000000    
 400.000000000000000      20.068380000000001       0.401370000000000    
 450.000000000000000      18.443570000000001       0.368870000000000    
 500.000000000000000      17.131820000000001       0.342640000000000    
 600.000000000000000      15.412590000000000       0.308250000000000    
 700.000000000000000      13.930770000000001       0.278620000000000    
 800.000000000000000      13.458140000000000       0.269160000000000    
 900.000000000000000      12.694400000000000       0.253890000000000    
1000.000000000000000      12.142960000000000       0.242860000000000    

relax> relax_disp.select_model(model='MMQ 2-site')
The reduced numerical solution for the 2-site Bloch-McConnell equations for MQ CPMG data using 3D magnetisation vectors, whereby the simplification R20A = R20B is assumed.

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=10000000, constraints=True, scaling=True, verbosity=1)


Fitting to the spin block [':9@N']
----------------------------------



Logarithmic barrier function
~~~~~~~~~~~~~~~~~~~~~~~~~~~~
k: 0        xk: [      0.8481132,       0.8977845,       1.0490257,        4.413451,       -0.271799,        0.944322,       0.0368075]    fk: 24.0431007363       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [      0.8481132,       0.8977845,       1.0490257,        4.413451,       -0.271799,        0.944322,       0.0368075]    fk: 23.9739401355       
	k: 100      xk: [   0.8336975828,    0.8766486982,      1.02820994,      4.40082036,   -0.2727743347,    0.9448368728,   0.03811422753]    fk: 17.9879561239       
	k: 200      xk: [   0.8337820038,    0.8761537792,     1.023104604,     4.359092864,   -0.2756435927,    0.9497366053,   0.04270299995]    fk: 17.3197770172       
	k: 300      xk: [   0.8337826079,    0.8761552089,     1.023105688,     4.359090289,   -0.2756453717,    0.9497366277,    0.0427030217]    fk: 17.3170036889       
	k: 400      xk: [   0.8337826776,    0.8761552285,     1.023105739,     4.359090174,    -0.275645438,    0.9497366277,   0.04270302171]    fk: 17.3170036874       

	Parameter values: [0.83378267757250435, 0.87615522843707916, 1.0231057391174683, 4.3590901738052068, -0.27564543793060359, 0.94973662773636758, 0.042703021717670472]
	Function value:   17.31700368729086
	Iterations:       500
	Function calls:   940
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Maximum number of iterations reached

k: 1        xk: [   0.8337826776,    0.8761552284,     1.023105739,     4.359090174,   -0.2756454379,    0.9497366277,   0.04270302172]    fk: 17.3861157086       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337826776,    0.8761552284,     1.023105739,     4.359090174,   -0.2756454379,    0.9497366277,   0.04270302172]    fk: 17.3854245884       
	k: 100      xk: [   0.8337826776,    0.8761552284,     1.023105739,     4.359090174,   -0.2756454379,    0.9497366277,   0.04270302172]    fk: 17.3854245884       
	k: 200      xk: [   0.8337828935,    0.8761553527,     1.023105725,     4.359090275,     -0.27565616,    0.9497366308,   0.04270301715]    fk: 17.3853637971       
	k: 300      xk: [   0.8337829048,    0.8761553442,     1.023105723,     4.359090282,   -0.2756582237,    0.9497366316,   0.04270301742]    fk: 17.385363791        
	k: 400      xk: [   0.8337829083,      0.87615537,     1.023105717,     4.359090312,   -0.2756571625,    0.9497366316,   0.04270301743]    fk: 17.3853637909       

	Parameter values: [0.83378290886148398, 0.87615537444841896, 1.0231057153678211, 4.3590903174710558, -0.27565697866542266, 0.94973663163200195, 0.042703017426756647]
	Function value:   17.385363790929322
	Iterations:       469
	Function calls:   962
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 2        xk: [   0.8337829089,    0.8761553744,     1.023105715,     4.359090317,   -0.2756569787,    0.9497366316,   0.04270301743]    fk: 17.3860549112       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337829089,    0.8761553744,     1.023105715,     4.359090317,   -0.2756569787,    0.9497366316,   0.04270301743]    fk: 17.386048           
	k: 100      xk: [   0.8337829089,    0.8761553744,     1.023105715,     4.359090317,   -0.2756569787,    0.9497366316,   0.04270301743]    fk: 17.386048           
	k: 200      xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,    -0.275656981,    0.9497366316,   0.04270301743]    fk: 17.386048           

	Parameter values: [0.83378290886759387, 0.87615537449233638, 1.0231057153845458, 4.3590903174669364, -0.27565698102038361, 0.94973663163351629, 0.042703017426525075]
	Function value:   17.386047999951447
	Iterations:       236
	Function calls:   668
	Gradient calls:   0
	Hessian calls:    0
	Warning:          Simplex has not moved.

k: 3        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,    -0.275656981,    0.9497366316,   0.04270301743]    fk: 17.3860549112       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,    -0.275656981,    0.9497366316,   0.04270301743]    fk: 17.386054842        
	k: 100      xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,    -0.275656981,    0.9497366316,   0.04270301743]    fk: 17.386054842        

	Parameter values: [0.83378290886910533, 0.87615537449891401, 1.0231057153783749, 4.3590903174547506, -0.27565698256651677, 0.94973663163380051, 0.042703017426865539]
	Function value:   17.386054842039524
	Iterations:       178
	Function calls:   559
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 4        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549105       
	k: 100      xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549105       

	Parameter values: [0.83378290886910533, 0.87615537449891401, 1.0231057153783749, 4.3590903174547506, -0.27565698256651677, 0.94973663163380051, 0.042703017426865539]
	Function value:   17.386054910460434
	Iterations:       163
	Function calls:   546
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 5        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549111       
	k: 100      xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549111       

	Parameter values: [0.83378290886910533, 0.87615537449891401, 1.0231057153783749, 4.3590903174547506, -0.27565698256651677, 0.94973663163380051, 0.042703017426865539]
	Function value:   17.386054911144647
	Iterations:       163
	Function calls:   546
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 6        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       
	k: 100      xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       

	Parameter values: [0.83378290886910533, 0.87615537449891401, 1.0231057153783749, 4.3590903174547506, -0.27565698256651677, 0.94973663163380051, 0.042703017426865539]
	Function value:   17.386054911151486
	Iterations:       163
	Function calls:   546
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 7        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       
	k: 100      xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       

	Parameter values: [0.83378290886910533, 0.87615537449891401, 1.0231057153783749, 4.3590903174547506, -0.27565698256651677, 0.94973663163380051, 0.042703017426865539]
	Function value:   17.386054911151554
	Iterations:       163
	Function calls:   546
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None

k: 8        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       
Entering sub-algorithm.
	
	Simplex minimisation
	~~~~~~~~~~~~~~~~~~~~

	k: 0        xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       
	k: 100      xk: [   0.8337829089,    0.8761553745,     1.023105715,     4.359090317,   -0.2756569826,    0.9497366316,   0.04270301743]    fk: 17.3860549112       

	Parameter values: [0.83378290886910533, 0.87615537449891401, 1.0231057153783749, 4.3590903174547506, -0.27565698256651677, 0.94973663163380051, 0.042703017426865539]
	Function value:   17.386054911151554
	Iterations:       163
	Function calls:   546
	Gradient calls:   0
	Hessian calls:    0
	Warning:          None


Parameter values: [0.83378290886910533, 0.87615537449891401, 1.0231057153783749, 4.3590903174547506, -0.27565698256651677, 0.94973663163380051, 0.042703017426865539]
Function value:   17.386054911151554
Iterations:       2198
Function calls:   5859
Gradient calls:   0
Hessian calls:    0
Warning:          None


Optimised parameter values:
r2 (SQ CPMG - 500.00000000 MHz)         8.337829088691054
r2 (SQ CPMG - 600.00000000 MHz)         8.761553744989140
r2 (SQ CPMG - 800.00000000 MHz)        10.231057153783748
dw                           4.359090317454751
dwH                         -0.275656982566517
pA                           0.949736631633801
kex                        427.030174268655401

relax> monte_carlo.setup(number=3)

relax> monte_carlo.create_data(method='back_calc')

relax> monte_carlo.initial_values()

relax> minimise(min_algor='simplex', line_search=None, hessian_mod=None, hessian_type=None, func_tol=1e-25, grad_tol=None, max_iter=100, constraints=True, scaling=True, verbosity=1)
Simulation 1, cluster [':9@N']
Simulation 2, cluster [':9@N']
Simulation 3, cluster [':9@N']

relax> monte_carlo.error_analysis()

relax> relax_disp.plot_disp_curves(dir='.', num_points=1000, extend=500.0, force=True)
Opening the file './disp_9_N.agr' for writing.
RelaxWarning: divide by zero encountered in divide
Opening the file './grace2images.py' for writing.

relax> state.save(state='state', dir=None, compress_type=1, force=True)
Opening the file 'state.bz2' for writing.

